{
  "title": "Five most notable women on TIME's list of 100 Most Influential People of 2025",
  "publication_date": "2025-04-17T13:22:22+05:00",
  "summary": "TIME's 100 Most Influential People of 2025 features remarkable women including Gisèle Pelicot, who challenged sexual violence, actress Scarlett Johansson, philanthropist Blake Lively, BLACKPINK's Rosé, and athlete-turned-entrepreneur Serena Williams. Each woman is praised by notable figures for their groundbreaking achievements and influence in their respective fields.",
  "content": "From courtrooms to concert halls to artistic powerhouses, this year's TIME100 list of 100 most influential people features a host of women who are making history and shaping the future.\n\nGisèle Pelicot stood tall against sexual violence, naming her abuser in open court in a landmark trial. Gloria Steinem praised her as a symbol of strength and survival, comparing her impact to Gandhi's challenge of racial violence in India.\n\nScarlett Johansson, celebrated by Chris Evans, has spent over two decades redefining leading lady roles. Evans, who's known her since their teenage years, describes her as \"a pioneer, a rebel, a force\" who seamlessly transitions between independent and mainstream films.\n\nBlake Lively's impact extends beyond Hollywood into philanthropy. Civil rights lawyer Sherrilyn Ifill commends Lively's dedication to understanding and addressing social issues, particularly through her work with the NAACP Legal Defence Fund.\n\nRosé of BLACKPINK is praised by Lilly Collins as \"the definition of an icon and a boss.\" Collins appreciates her authenticity, dynamic performance abilities, and success both as a group member and solo artist.\n\nSerena Williams continues to make waves post-tennis career through her venture-capital fund supporting women and people of color, and her involvement in WNBA expansion. Olympian Allyson Felix writes about Williams' inspiring influence both on and off the court.\n\nOther notable women on the list include Ismahane Elouafi, Bonnie Y Chan, Teresa Ribera, and Mo Abudu.",
  "category": "Entertainment",
  "tags": [
    "women leaders",
    "TIME 100",
    "influence",
    "entertainment",
    "sports",
    "activism",
    "philanthropy",
    "business"
  ],
  "location": "Global",
  "source": {
    "title": "Five most notable women on TIME’s list of 100 Most Influential People of 2025",
    "publication_date": 1744858342,
    "content": [
      {
        "title": "Five most notable women on TIME’s list of 100 Most Influential People of 2025",
        "publication_date": "2025-04-17T13:22:22+05:00",
        "content": "From courtrooms to concert halls to artistic powerhouses, this year’sTIME100list of 100 most influential people features a host of women who are making history and shaping the future. Here’s a closer look at some of the most remarkable women honoured this year, in the words of those who know them best.\n\nIn the face of devastating trauma,Gisèle Pelicotdid what many couldn’t: she stood tall, named her abuser in open court, and refused to be silenced. Her husband, along with dozens of accomplices, was convicted in a landmark trial that not only delivered justice but disrupted deep-rooted silence around sexual violence.\n\nHer strength reverberated far beyond France. “Just as Gandhi challenged racial violence in India, Gisèle has challenged the patriarchy everywhere,” wrote Gloria Steinem, the writer, political activist, and feminist organiser.\n\n“There have been tributes to Gisèle in many countries. She is a symbol of strength and survival, she is a source of inspiration for women and for humane men, wherever we live. Gisèle has shown us the way. Now we must follow,” she concluded.\n\nScarlett Johanssonhas spent more than two decades redefining what a leading lady looks like. From intimate indie films to billion-dollar blockbusters, she’s always chosen her own path.\n\nChris Evans, who’s known her since they were teenagers on set, calls her “a pioneer, a rebel, a force,” and above all, someone “unafraid to be vulnerable… unafraid to be herself.”\n\nEvans notes, “Despite her being three years younger than me, I’ve always considered Scarlett Johansson my older sister. We met in 2002 while filmingThe Perfect Scorein Vancouver. Even at 17, she had wisdom, talent, and grit beyond her years.”\n\nEvans looked up to her as any younger sibling would, “with equal parts admiration and intimidation.” Having seen her seamlessly transition between independent and mainstream films, refusing to be typecast, Evans wrote that Johansson has proven herself as one of the most “bankable actors of her generation.\n\n“She’s a living testament to the power of fearlessness in art. That’s why even though I’m older, I learn from her, I lean on her, and I look up to her. And as any ‘younger’ sibling would assert, there’s absolutely nothing she can’t do.”\n\nForget the red carpets,Blake Livelyis doing her most meaningful work far from the spotlight, according to Sherrilyn Ifill, a civil rights lawyer. “The Blake Lively I know is a philanthropist and a student of our country’s most intractable problems. She and her husband, Ryan Reynolds, reached out in 2019 to contribute to the NAACP Legal Defence Fund,” wrote Ifill.\n\nIfill immediately admired Lively’s curiosity and her work to understand the conditions that shape her country. “I remember an early conversation in which she expressed frustration that so much of our nation’s history was not part of the instruction she had received as a student. Her commitment to filling those gaps — and becoming the most fully informed and prepared citizen — is what I appreciate most about her,” added Ifill.\n\nShe concluded by calling Lively a “serious person” and a “risk taker,” who’s committed to moving her country forward for children.\n\nRoséisn’t just a member of BLACKPINK, she’s an entire vibe, according to actor Lilly Collins. With a distinct voice and magnetic stage presence, she’s captivated millions. Yet behind the stardom is someone deeply grounded.\n\n“She’s the definition of an icon and a boss,” wrote Collins. “I’ve come to learn that not only is Rosé really genuine and down-to-earth, but she’s also a total badass. She’s such a dynamic performer and songwriter, and I think it’s incredible that she’s able to captivate arenas full of people as both a member of the biggest girl group in the world and also as a solo artist.”\n\nCollins admired her humour, energy, voice, spirit and, “really, everything about her. I’m so proud of all the things she’s done in the past year, and I feel so lucky to call her a friend.”\n\nEven after hanging up her tennis racquet,Serena Williamshasn’t slowed down. She’s investing in women-led businesses, backing WNBA expansion teams, and proving that athleticism and entrepreneurship go hand in hand.\n\nFellow Olympian Allyson Felix wrote about Williams’ comeback after a life-threatening childbirth gave her strength during her own. “She could take a break… Instead, she continues to pave the way. A win for her is a win for all of us.”\n\nWilliams’ perseverance inspired Felix’s own comeback story. “After an unexpectedly difficult pregnancy that required an emergency C-section and a lengthy recovery, I returned to the track to win two medals — a gold and a bronze — at the Tokyo Olympics.”\n\nFelix notes that Williams continues to be impactful even away from professional tennis. “Whether it’s through her venture-capital fund that invests in companies founded by women and people of colour, or joining the ownership group of the Toronto Tempo, a WNBA expansion team, or dancing during halftime at the Super Bowl, she continues to show that we, as athletes, are so far from one-dimensional.”\n\nThese five women are just a glimpse of the wider list. Also celebrated this year are trailblazers likeIsmahane Elouafi,Bonnie Y Chan,Teresa Ribera, andMo Abudu, among many others.\n\nCompunode.com Pvt. Ltd. (www.compunode.com).Designed forDawn."
      },
      {
        "title": "Five most notable women on TIME’s list of 100 Most Influential People of 2025",
        "author": "Images Staff",
        "publication_date": "2025-04-17T13:22:22+05:00"
      }
    ],
    "authors": [],
    "source": "Images Dawn",
    "image_url": "https://i.dawn.com/primary/2025/04/17131740d0bead1.png",
    "url": "https://images.dawn.com/news/1193511"
  },
  "markdown_content": "## Women of Impact\\n\\nFrom courtrooms to concert halls to artistic powerhouses, this year's TIME100 list of 100 most influential people features a host of women who are making history and shaping the future.\\n\\n## Legal & Activism\\n\\nGisèle Pelicot stood tall against sexual violence, naming her abuser in open court in a landmark trial. \\n\\n> \"A symbol of strength and survival,\" praised Gloria Steinem, comparing her impact to Gandhi's challenge of racial violence in India.\\n\\n## Entertainment & Arts\\n\\nScarlett Johansson, celebrated by Chris Evans, has spent over two decades redefining leading lady roles. \\n\\n> \"A pioneer, a rebel, a force,\" describes Evans, who's known her since their teenage years, noting her seamless transitions between independent and mainstream films.\\n\\nBlake Lively's impact extends beyond Hollywood into philanthropy. Civil rights lawyer Sherrilyn Ifill commends Lively's dedication to understanding and addressing social issues, particularly through her work with the NAACP Legal Defence Fund.\\n\\n> \"The definition of an icon and a boss,\" writes Lilly Collins of Rosé of BLACKPINK, praising her authenticity, dynamic performance abilities, and success both as a group member and solo artist.\\n\\n## Sports & Business\\n\\nSerena Williams continues to make waves post-tennis career through her venture-capital fund supporting women and people of color, and her involvement in WNBA expansion. Olympian Allyson Felix writes about Williams' inspiring influence both on and off the court.\\n\\n## Additional Notable Figures\\n\\n* Ismahane Elouafi\\n* Bonnie Y Chan\\n* Teresa Ribera\\n* Mo Abudu"
}