{
  "title": "QpiAI Announces Dawn of Quantum Era in India With 25 Qubit Quantum Computer",
  "publication_date": "2023-10-14T12:16:01Z",
  "summary": "QpiAI has unveiled India's most powerful quantum computer, the 25-qubit Indus Quantum Computer, marking a significant milestone in the country's quantum computing capabilities. The company has outlined plans for future systems with increased qubit counts, including 64, 128, and 1000-qubit machines.",
  "content": "QpiAI has announced the development of India's most powerful quantum computer, code-named Indus Quantum Computer. This breakthrough achievement represents a significant step forward in India's quantum computing capabilities.\n\nThe company has revealed an ambitious roadmap for quantum computing development, with plans to scale up their technology significantly. Future iterations include the 64-qubit 'Kaveri' system, the 128-qubit 'Ganges' computer, and ultimately the 1000-qubit 'Everest' NISQ (Noisy Intermediate-Scale Quantum) quantum computer.\n\nThis development positions India among the select nations with advanced quantum computing capabilities, promising applications across various sectors including scientific research, cryptography, and complex computational problems.",
  "category": "Technology",
  "tags": [
    "quantum computing",
    "technology",
    "India",
    "innovation",
    "computing",
    "scientific research"
  ],
  "location": "India",
  "source": {
    "title": "QpiAI Announces Dawn of Quantum Era in India With 25 Qubit Quantum Computer",
    "publication_date": 1744761361,
    "content": "QpiAI announces India’s most powerful quantum computer, code-named Indus Quantum Computer.\nQpiAI has a roadmap to extend to 64 (code-named Kaveri), 128 (code-named Ganges), and 1000 qubits (code-named Everest) NISQ quantum computers with applications... [6464 chars]",
    "source": "VentureBeat",
    "authors": [],
    "image_url": "https://venturebeat.com/wp-content/uploads/2015/10/BusinessWire_FeaturedImage.jpg?w=285?w=1200&strip=all",
    "url": "https://venturebeat.com/business/qpiai-announces-dawn-of-quantum-era-in-india-with-25-qubit-quantum-computer/"
  },
  "markdown_content": "## Development Announcement\\nQpiAI has announced the development of India's most powerful quantum computer, code-named \"Indus Quantum Computer.\" This breakthrough achievement represents a significant step forward in India's quantum computing capabilities.\\n\\n## Future Roadmap\\nThe company has revealed an ambitious roadmap for quantum computing development, with plans to scale up their technology significantly. Future iterations include:\\n\\n* The 64-qubit \"Kaveri\" system\\n* The 128-qubit \"Ganges\" computer\\n* The 1000-qubit \"Everest\" NISQ (Noisy Intermediate-Scale Quantum) quantum computer\\n\\n## Impact\\nThis development positions India among the select nations with advanced quantum computing capabilities, promising applications across various sectors including scientific research, cryptography, and complex computational problems."
}