{
  "title": "For Children and Adolescents, COVID-19 Carries Higher Risk For Cardiovascular Outcomes",
  "publication_date": "2024-01-15T00:00:00Z",
  "summary": "A large study reveals that children and adolescents who contracted COVID-19 face higher risks of cardiovascular complications compared to those without infection. The research, analyzing data from 19 US children's hospitals, found increased risks of conditions like myocarditis, heart failure, and arrhythmias, regardless of previous cardiovascular history or congenital heart disease status.",
  "content": "Children and adolescents who had COVID-19 were at a higher risk for heart-related outcomes compared with those who did not have SARS-CoV-2 infection. These elevated risks were found in patients regardless of a previous cardiovascular history or congenital heart disease.\n\nThe study, published in Nature Communications, analyzed electronic health records from 19 children's hospitals within the US RECOVER consortium between March 2020 and September 2023. The research included 297,920 COVID-19 positive individuals and 915,402 negative controls.\n\nResearchers found that SARS-CoV-2 positive patients showed increased risks for various cardiovascular outcomes, with relative risk ratios between 1.26 and 2.92. These outcomes included hypertension, ventricular arrhythmias, myocarditis, heart failure, cardiomyopathy, cardiogenic shock, thromboembolism, chest pain, and palpitations.\n\nThe risks remained consistent across demographics, including age, sex, race/ethnicity, obesity status, COVID-19 severity, and virus variant. Even children without prior cardiovascular conditions showed increased risks after infection.\n\nParticularly noteworthy was the elevated risk of myocarditis and pericarditis, consistent with previous research. However, the study had limitations regarding data on reinfections and vaccination status, which could influence outcomes.",
  "category": "Health",
  "tags": [
    "COVID-19",
    "cardiovascular health",
    "pediatrics",
    "medical research",
    "public health",
    "myocarditis",
    "heart disease"
  ],
  "location": "United States",
  "source": {
    "title": "For Children and Adolescents, COVID-19 Carries Higher Risk For Cardiovascular Outcomes",
    "publication_date": 1744888986,
    "content": [
      {
        "title": "For Children and Adolescents, COVID-19 Carries Higher Risk For Cardiovascular Outcomes ",
        "publication_date": "Unknown",
        "content": "A large study showed these SARS-CoV-2 positive groups were more prone to myocarditis, heart failure, arrhythmias, and chest pain—regardless of prior cardiovascular history or presence of congenital heart disease (CHD).\n\nChildren and adolescents who had COVID-19 were at a higher risk for heart-related outcomes compared with those who did not have SARS-CoV-2 infection. These elevated risks were found in patients regardless of a previous cardiovascular history or congenital heart disease. These findings were part of a large study that were published inNature Communications.\n\n“We found that those infected with SARS-CoV-2 exhibited increased risks for a range of post-acute cardiovascular outcomes, with RR between 1.26 and 2.92,” The study authors wrote. “These outcomes included hypertension, ventricular arrhythmias, myocarditis, heart failure, cardiomyopathy, cardiogenic shock, thromboembolism, chest pain, and palpitations, compared to non-infected controls. These findings applied to patients both with and without CHDs, although children with CHD showed a notably higher risk of atrial fibrillation.”\n\nThe risk was found to be similar across demographics. “Risks were consistently observed regardless of age, sex, race/ethnicity, obesity status, severity of acute COVID-19, or virus variant. Even children and adolescents without a history of any cardiovascular outcomes before SARS-CoV-2 infection showed increased risks, suggesting a broad potential impact on those previously considered at low risk of cardiovascular disease,” the investigators wrote.\n\nInvestigators assessed cardiovascular risks analyzing electronic health records (EHR) data from 19 children’s hospitals and health institutions within the US from the Researching COVID to Enhance Recovery (RECOVER) consortium during the time period between March 2020 and September 2023. The cohort included both individuals with COVID-19 (297,920) and those who were negative for infection (915,402).  All individuals had at least a single 6-month follow-up after cohort entry. According to the RECOVER website, this initiative “brings together clinicians, scientists, caregivers, patients, and community members to understand, treat, and prevent Long COVID. We’ve created the world’s most comprehensive and diverse group of Long COVID study participants.”\n\nWithin the SARS-CoV-2-positive individuals portion of the study, the investigators said 13,646 individuals had congenital heart disease, and 284,274 without CHD. Of the negative SARS-CoV-2 group, 46,962 had CHD, and 868,440 were without CHD. Of the individuals involved in the study, 623,806 (51.4%) were male with a mean (SD) age of 7.75 (6.11) years.\n\nChildren and adolescents who had COVID-19 were at a notably higher risk for various post-acute cardiovascular conditions—including myocarditis, heart failure, arrhythmias, chest pain, hypertension, and more—regardless of whether they had preexisting heart issues or congenital heart disease (CHD).\n\nThe increased cardiovascular risk was observed regardless of age, sex, race/ethnicity, obesity status, COVID-19 severity, or variant. Even healthy children with no previous cardiovascular conditions showed elevated risk after COVID-19 infection.\n\nThe study found a particularly elevated risk of myocarditis and pericarditis, consistent with prior research. However, limitations existed due to lack of data on reinfections and vaccination status, which could influence the outcomes.\n\nOne of the ongoing discussions—and previously found in other studies—is the connection between COVID-19 infection and the increased risks for myocarditis and pericarditis.\n\n“Especially noteworthy was the increased risk of myocarditis and pericarditis (inflammatory heart disease) in both groups consistent with prior studies showing an increased occurrence of myocarditis in the months following the diagnosis of COVID-19, across different ages and sexes,” the investigators wrote.\n\nThe investigators acknowledged there were some limitations to their study around multiple bouts of COVID-19 and vaccination and the aforementioned heart issues. “Our analysis did not account for reinfection or COVID-19 vaccinations during the study period, which could affect outcomes like myocarditis or pericarditis. We included the dosage of COVID-19 vaccines and the interval since the last immunization as confounders to partially adjust for these variables to make SARS-CoV-2-positive and SARS-CoV-2-negative groups more comparable, but vaccinations and tests conducted outside hospital systems may not be captured accurately in the EHR.”\n\nFindings showed an association between obesity and increased risks of some cardiovascular outcomes.\n\n“While these findings were not substantial, they highlight the complexity of obesity-related cardiovascular health in pediatric populations. Obesity-related complications, including cardiovascular outcomes, typically evolve over a longer period and may not fully manifest within the follow-up period of 28 to 179 days. Future studies with longer follow-up periods and comprehensive assessments are warranted to better understand the long-term cardiovascular implications of obesity in pediatric populations,” the authors wrote.\n\nNirmatrelvir-Ritonavir Shows Efficacy for Long COVID, But Lacks Significant Health Improvements\n\nVaccine Equality vs Equity with Dr. Jacinda Abdul-Mutakabbir\n\nNirmatrelvir/Ritonavir Reduces Post-Acute Mortality in Immunocompromised COVID-19 Patients\n\nVaccine Inequity With Dr. Leonard Friedland\n\nEnsitrelvir Prevents COVID-19 Infection as Post Exposure Prophylaxis\n\nPandemic Disruptions in HIV Care Impacted on Early ART Initiation and Viral Suppression\n\nNirmatrelvir-Ritonavir Shows Efficacy for Long COVID, But Lacks Significant Health Improvements\n\nVaccine Equality vs Equity with Dr. Jacinda Abdul-Mutakabbir\n\nNirmatrelvir/Ritonavir Reduces Post-Acute Mortality in Immunocompromised COVID-19 Patients\n\nVaccine Inequity With Dr. Leonard Friedland\n\nEnsitrelvir Prevents COVID-19 Infection as Post Exposure Prophylaxis\n\nPandemic Disruptions in HIV Care Impacted on Early ART Initiation and Viral Suppression\n\n2 Commerce DriveCranbury, NJ 08512\n\n609-716-7777"
      },
      {
        "title": "For Children and Adolescents, COVID-19 Carries Higher Risk For Cardiovascular Outcomes ",
        "author": "Unknown Author",
        "publication_date": "Unknown"
      }
    ],
    "authors": [
      "Sophia Abene"
    ],
    "source": "Contagion Live",
    "image_url": null,
    "url": "https://www.contagionlive.com/view/for-children-and-adolescents-covid-19-carries-higher-risk-for-cardiovascular-outcomes"
  },
  "markdown_content": "## Study Findings\\n\\nChildren and adolescents who had COVID-19 were at a higher risk for heart-related outcomes compared with those who did not have SARS-CoV-2 infection. These elevated risks were found in patients regardless of a previous cardiovascular history or congenital heart disease.\\n\\n## Research Methodology\\n\\nThe study, published in Nature Communications, analyzed electronic health records from 19 children's hospitals within the US RECOVER consortium between March 2020 and September 2023. The research included 297,920 COVID-19 positive individuals and 915,402 negative controls.\\n\\n## Key Results\\n\\nResearchers found that SARS-CoV-2 positive patients showed increased risks for various cardiovascular outcomes, with relative risk ratios between 1.26 and 2.92. These outcomes included:\\n\\n* Hypertension\\n* Ventricular arrhythmias\\n* Myocarditis\\n* Heart failure\\n* Cardiomyopathy\\n* Cardiogenic shock\\n* Thromboembolism\\n* Chest pain\\n* Palpitations\\n\\n## Impact Across Demographics\\n\\nThe risks remained consistent across demographics, including:\\n- Age\\n- Sex\\n- Race/ethnicity\\n- Obesity status\\n- COVID-19 severity\\n- Virus variant\\n\\nEven children without prior cardiovascular conditions showed increased risks after infection.\\n\\n## Study Limitations\\n\\nParticularly noteworthy was the elevated risk of myocarditis and pericarditis, consistent with previous research. However, the study had limitations regarding data on reinfections and vaccination status, which could influence outcomes."
}