{
  "title": "Moolenaar, Krishnamoorthi Unveil Explosive Report on Chinese AI Firm DeepSeek — Demand Answers from Nvidia Over Chip Use",
  "publication_date": "2025-04-16T14:24:33-04:00",
  "summary": "House Select Committee on China released an investigative report exposing Chinese AI platform DeepSeek as a national security threat. The report reveals DeepSeek transfers American user data to the CCP, spreads propaganda, and uses unauthorized U.S. AI model data. Committee leaders demand answers from Nvidia regarding chip sales potentially violating export controls.",
  "content": "WASHINGTON, D.C. – Chairman John Moolenaar (R-MI) and Ranking Member Raja Krishnamoorthi (D-IL) of the House Select Committee on China released a new investigative report exposing DeepSeek, a Chinese artificial intelligence platform, as a serious national security threat to the United States.\n\nThe bipartisan report titled \"DeepSeek Unmasked: Exposing the CCP's Latest Tool For Spying, Stealing, and Subverting U.S. Export Control Restrictions\" reveals that DeepSeek covertly funnels American user data to the Chinese Communist Party, manipulates information to align with CCP propaganda, and was trained using material unlawfully obtained from U.S. AI models. The report also highlights that DeepSeek operates on tens of thousands of Nvidia chips—some of which are subject to U.S. export controls.\n\nChairman Moolenaar stated that DeepSeek is a weapon in the Chinese Communist Party's arsenal, designed to spy on Americans, steal technology, and subvert U.S. law. In response to the findings, the Select Committee has sent a formal letter to Nvidia demanding answers about sales to China and Southeast Asia.\n\nThe Committee will continue investigating how American innovation is being exploited by the Chinese Communist Party and will work to ensure that U.S. companies are not enabling the CCP's efforts to undermine national security.",
  "category": "Technology",
  "tags": [
    "artificial intelligence",
    "national security",
    "China",
    "CCP",
    "Nvidia",
    "export controls",
    "cybersecurity",
    "government oversight",
    "technology regulation"
  ],
  "location": "Washington, D.C.",
  "source": {
    "title": "Moolenaar, Krishnamoorthi Unveil Explosive Report on Chinese AI Firm DeepSeek — Demand Answers from Nvidia Over Chip Use",
    "publication_date": 1744808073,
    "content": [
      {
        "title": "Moolenaar, Krishnamoorthi Unveil Explosive Report on Chinese AI Firm DeepSeek — Demand Answers from Nvidia Over Chip Use",
        "publication_date": "2025-04-16T14:24:33-04:00",
        "content": "WASHINGTON, D.C. –Today, Chairman John Moolenaar (R-MI) and Ranking Member Raja Krishnamoorthi (D-IL) of the House Select Committee on China released a new investigative report exposing DeepSeek, a Chinese artificial intelligence platform, as a serious national security threat to the United States.\n\nTitled,“DeepSeek Unmasked: Exposing the CCP’s Latest Tool For Spying, Stealing, and Subverting U.S. Export Control Restrictions,”the bipartisan report reveals that DeepSeek covertly funnels American user data to the Chinese Communist Party, manipulates information to align with CCP propaganda, and was trained using material unlawfully obtained from U.S. AI models. The report also highlights reporting that DeepSeek operates on tens of thousands of Nvidia chips—some of which are subject to U.S. export controls.\n\n\"This report makes it clear: DeepSeek isn’t just another AI app — it’s a weapon in the Chinese Communist Party’s arsenal, designed to spy on Americans, steal our technology, and subvert U.S. law,\"said Chairman Moolenaar.\"We now know this tool exploited U.S. AI models and reportedly used advanced Nvidia chips that should never have ended up in CCP hands. That’s why we’re sending a letter to Nvidia to demand answers. American innovation should never be the engine of our adversaries’ ambitions.\"\n\nKey findings include:\n\nIn response to the report’s findings, the Select Committee has sent aformal letterto Nvidia demanding answers about sales to China and Southeast Asia to examine whether and how its chips ended up powering DeepSeek’s AI models—despite U.S. export restrictions.\n\nThe Committee will continue investigating how American innovation is being exploited by the Chinese Communist Party and will work to ensure that U.S. companies are not enabling the CCP’s efforts to undermine our national security.\n\nRead the full report:DeepSeek Unmasked: Exposing the CCP’s Latest Tool For Spying, Stealing, and Subverting U.S. Export Control Restrictions\n\n###"
      },
      {
        "title": "Moolenaar, Krishnamoorthi Unveil Explosive Report on Chinese AI Firm DeepSeek — Demand Answers from Nvidia Over Chip Use",
        "author": "Unknown Author",
        "publication_date": "2025-04-16T14:24:33-04:00"
      }
    ],
    "authors": [],
    "source": "Select Committee on the CCP | (.gov)",
    "image_url": null,
    "url": "https://selectcommitteeontheccp.house.gov/media/press-releases/moolenaar-krishnamoorthi-unveil-explosive-report-chinese-ai-firm-deepseek"
  },
  "markdown_content": "## Key Findings\\nA new bipartisan investigative report reveals DeepSeek, a Chinese artificial intelligence platform, poses a significant national security threat to the United States.\\n\\n## Report Details\\nThe report, titled \"DeepSeek Unmasked: Exposing the CCP's Latest Tool For Spying, Stealing, and Subverting U.S. Export Control Restrictions,\" uncovered several concerning practices:\\n\\n* Covert transfer of American user data to the Chinese Communist Party\\n* Manipulation of information to align with CCP propaganda\\n* Training using unlawfully obtained material from U.S. AI models\\n* Operation using thousands of Nvidia chips—some under U.S. export controls\\n\\n## Official Statement\\n> DeepSeek is a weapon in the Chinese Communist Party's arsenal, designed to spy on Americans, steal technology, and subvert U.S. law.\\n\\n– Chairman John Moolenaar (R-MI)\\n\\n## Committee Response\\n* Formal letter sent to Nvidia requesting answers about sales to China and Southeast Asia\\n* Ongoing investigation into CCP exploitation of American innovation\\n* Commitment to prevent U.S. companies from enabling CCP's national security threats"
}