{
  "title": "10 Facts About U.S. Catholics: Key Demographics and Trends",
  "publication_date": "2024-01-15T12:30:00Z",
  "summary": "A comprehensive analysis of the U.S. Catholic population reveals that Catholics comprise 20% of U.S. adults, approximately 53 million people. The demographic is shifting, with increasing Hispanic representation and significant immigrant presence. The study shows varying patterns in age distribution, geographic spread, education levels, religious practices, and political affiliations among different ethnic groups within the Catholic community.",
  "content": "According to recent Pew Research Center surveys, Catholics represent one of the largest religious groups in the United States, with the U.S. having more Catholics than any country except Brazil, Mexico, and the Philippines.\n\nThe research shows that 20% of U.S. adults identify as Catholic, translating to roughly 53 million Catholic adults nationwide. The demographic composition reveals that 54% are White, 36% Hispanic, 4% Asian, and 2% Black, with notable shifts showing a 10-percentage-point decrease in White Catholics and a 7-point increase in Hispanic Catholics since 2007.\n\nImmigration plays a significant role, with 43% of U.S. Catholics being either immigrants (29%) or children of immigrants (14%). This varies significantly by ethnic group - 78% of Asian Catholics and 58% of Hispanic Catholics were born outside the U.S., while 83% of White Catholics come from families established in the U.S. for three or more generations.\n\nAge demographics indicate that Catholics tend to be older than the general population, with 58% aged 50 or older. However, Hispanic and Asian Catholics typically skew younger than their White counterparts.\n\nGeographically, Catholics are relatively evenly distributed across the U.S., with 29% in the South, 26% in the Northeast, 25% in the West, and 20% in the Midwest. Educational attainment varies by ethnic group, with 35% of all U.S. Catholics holding a bachelor's degree.\n\nRegarding religious practice, 29% attend Mass weekly or more often, while 51% pray daily. Political affiliations show that 53% of Catholic registered voters identify with or lean Republican, though this varies significantly by ethnicity.",
  "category": "World",
  "tags": [
    "religion",
    "demographics",
    "Catholic Church",
    "immigration",
    "politics",
    "education",
    "United States",
    "social trends"
  ],
  "location": "United States",
  "source": {
    "title": "What the data says about the U.S. Department of Education",
    "publication_date": 1742261400,
    "content": [
      {
        "title": "10 facts about U.S. Catholics",
        "publication_date": "Unknown",
        "content": "Numbers, Facts and Trends Shaping Your World\n\nRead our research on:\n\nFull Topic List\n\nRead Our Research On:\n\n|\n\nCatholics are one of the largest religious groups in the United States, outnumbering any single Protestant denomination. The U.S. has more Catholics than all but three other countries – Brazil, Mexico and the Philippines – according to the Vatican’s 2021 Statistical Yearbook of the Church.\n\nHere are 10 key facts about the U.S. Catholic population, drawn from Pew Research Center surveys.\n\nPew Research Center conducted this analysis to explore the basic demographic traits, religious characteristics and political preferences of U.S. Catholics.\n\nThe analysis draws mainly on data from the Center’s2023-24 Religious Landscape Study (RLS). It also draws from the Center’sNational Public Opinion Reference Survey (NPORS), an annual benchmarking survey of U.S. adults. Both the RLS and NPORS use address-based sampling from the U.S. Postal Service’s Delivery Sequence File to recruit participants. RLS respondents were surveyed mainly online or on paper, though respondents also had the option of calling a toll-free number to participate by telephone. NPORS respondents could answer either by paper or online. Follow the links to read more about each survey’s methodology.\n\nThis post also relies on online surveys of respondents who are part of the Center’sAmerican Trends Panel. Data from before 2020 comes from the Center’s random-digit-dial telephone surveys.\n\nAll of these surveys are weighted to be representative of the U.S. adult population by gender, race, ethnicity, education and other categories.\n\nToday, 20% of U.S. adults describe themselves as Catholics.This percentage has been generally stable since 2014. But it is slightly lower than in 2007, when 24% of U.S. adults identified as Catholic.\n\nOverall, there were about 267 million U.S. adults in 2024,according to the U.S. Census Bureau. This suggests that there are roughly 53 million Catholic adults nationwide.\n\nThe share of U.S. Catholics who are Hispanic is rising.Currently, the Catholic population is 54% White, 36% Hispanic, 4% Asian and 2% Black. An additional 2% identify with another race.\n\nSince 2007, the share who are White has dropped by 10 percentage points, while the share who are Hispanic has grown by 7 points.\n\nThis change has implications for the profile of Catholic Americans overall because Catholics from different racial and ethnic backgrounds have distinctive social and political traits, as we’ll discuss below.\n\nMore than four-in-ten U.S. Catholics are immigrants (29%) or the children of immigrants (14%).But some racial and ethnic groups have much higher shares of first- and second-generation immigrants.\n\nFor example, 78% of Asian Catholics were born outside the U.S., and an additional 14% were born in the U.S. but have at least one parent who was not.\n\nAmong Hispanic Catholics, 58% were born outside the U.S., and 22% were born in the U.S. to at least one immigrant parent.\n\nBy contrast, 83% of White Catholics are from families who have been in the U.S. for three generations or longer.\n\n(The 2023-24 survey did not include enough Black Catholics to report on them separately. Refer to our2022 analysisfor more information about Black Catholics.)\n\nCatholics tend to be older than Americans overall.Nearly six-in-ten Catholic adults (58%) are ages 50 and older. By comparison, 47% ofallU.S. adults in the Center’s2023-24 Religious Landscape Study (RLS)fall in this age range.\n\nBut Hispanic Catholics and Asian Catholics tend to be a lot younger than White Catholics. Four-in-ten Hispanic Catholics and 53% of Asian Catholics are 50 and older, compared with 70% of White Catholics. And just 14% of Hispanic Catholics and 20% of Asian Catholics are ages 65 and older, versus 39% of White Catholics.\n\nCatholics are spread out relatively evenly across the U.S.Roughly three-in-ten (29%) live in the South, while 26% live in the Northeast, 25% in the West and 20% in the Midwest.\n\nThe racial and ethnic makeup of the Catholic population varies by region. For example, in the Midwest, 78% of Catholics are White and 15% are Hispanic. In the Northeast, 72% of Catholics are White and 20% are Hispanic.\n\nIn the South, 44% are White and 45% are Hispanic. And in the West, there are more Hispanic Catholics than White Catholics (58% vs. 27%). The West also has a relatively larger population of Asian Catholics than do other regions (10%).\n\nMore than one-third of U.S. Catholics (35%) have a bachelor’s degree.Another 27% have some college experience but not a bachelor’s degree, and 38% have a high school education or less. This distribution is similar to that of the general adult population.\n\nOn average, Asian Catholics and White Catholics have higher levels of educational attainment than Hispanic Catholics. About half of Asian Catholics (53%) have a college degree, while 21% have a high school education or less. Among White Catholics, 43% have at least a bachelor’s degree, while 29% have a high school education or less. Among Hispanic Catholics, 20% have a bachelor’s degree and 54% have a high school education or less.\n\nAbout three-in-ten U.S. Catholics (29%) say they attend Mass weekly or more often.Larger shares say they pray on a daily basis (51%) and say religion is very important in their lives (44%). By comparison, Protestants are slightly more likely to say they do or believe each of these things.\n\nOverall, 21% of U.S. Catholics say they attend Mass weeklyandpray dailyandconsider religion very important. By contrast, 10% say they attend Mass a few times a year or less, pray seldom or never,andconsider religion not too or not all important.\n\nAbout half of Catholics who are registered voters (53%) identify with or lean toward the Republican Party, while 43% affiliate with the Democratic Party.\n\nBut partisan affiliation varies by race and ethnicity. Roughly six-in-ten White Catholic registered voters (61%) say they identify with or lean toward the GOP, while 36% identify with or lean toward the Democratic Party.\n\nConversely, 56% of Hispanic Catholics who are registered voters say they identify with or lean toward the Democratic Party, compared with 39% who favor the GOP.\n\nWhile theCatholic Church opposes abortion, 59% of Catholics say abortion should be legal.This includes 35% who say it should be legal in most cases and 25% who say it should be legal in all cases. Roughly four-in-ten Catholics say abortion should beillegalin most (26%) or all (13%) cases.\n\nCatholics’ opinions about abortion tend to align with their political leanings. Among Catholic Democrats, 78% say abortion should be legal in most or all cases. Among Catholic Republicans, 43% say this.\n\nCatholic Democrats (78%) are a little less likely than Democrats as a whole (86%) to say abortion should be legal in most or all cases.\n\nRoughly three-quarters of Catholics (78%) view Pope Francis favorably,according toour February 2025 survey. At least 80% of Catholics have expressed a favorable opinion of him in 10 of the 15 U.S. surveys in which we have asked about the pope since 2013.\n\nCatholic Democrats (88%) are much more likely than Catholic Republicans (69%) to view Francis favorably.\n\nNote: This is an update of a post originally published Sept. 4, 2018.\n\nTopics\n\nJustin Norteyis a research analyst focusing on religion research at Pew Research Center.\n\nPatricia Tevingtonis a research associate focusing on religion research at Pew Research Center.\n\nGregory A. Smithis a senior associate director of research at Pew Research Center.\n\n901 E St. NW, Suite 300Washington, DC 20004USA(+1) 202-419-4300 | Main(+1) 202-857-8562 | Fax(+1) 202-419-4372 |Media Inquiries\n\nABOUT PEW RESEARCH CENTERPew Research Center is a nonpartisan, nonadvocacy fact tank that informs the public about the issues, attitudes and trends shaping the world. It does not take policy positions. The Center conducts public opinion polling, demographic research, computational social science research and other data-driven research. Pew Research Center is a subsidiary ofThe Pew Charitable Trusts, its primary funder.\n\n© 2025 Pew Research Center"
      },
      {
        "title": "10 facts about U.S. Catholics",
        "author": "Unknown Author",
        "publication_date": "Unknown"
      }
    ],
    "authors": [
      "Drew DeSilver"
    ],
    "source": "Pew Research Center",
    "image_url": "https://www.pewresearch.org/wp-content/uploads/sites/20/2025/03/SR_25.03.18_DOE_feature.jpg",
    "url": "https://www.pewresearch.org/short-reads/2025/03/18/what-the-data-says-about-the-us-department-of-education/"
  },
  "markdown_content": "## Demographic Overview\\nCatholics represent one of the largest religious groups in the United States, with the U.S. having more Catholics than any country except Brazil, Mexico, and the Philippines.\\n\\nThe research shows that 20% of U.S. adults identify as Catholic, translating to roughly 53 million Catholic adults nationwide. The demographic composition reveals that:\\n* 54% are White\\n* 36% Hispanic\\n* 4% Asian\\n* 2% Black\\n\\nNotable shifts show a 10-percentage-point decrease in White Catholics and a 7-point increase in Hispanic Catholics since 2007.\\n\\n## Immigration Impact\\nImmigration plays a significant role, with 43% of U.S. Catholics being either immigrants (29%) or children of immigrants (14%). This varies significantly by ethnic group:\\n* 78% of Asian Catholics born outside the U.S.\\n* 58% of Hispanic Catholics born outside the U.S.\\n* 83% of White Catholics from families established in the U.S. for three or more generations\\n\\n## Age and Geographic Distribution\\nAge demographics indicate that Catholics tend to be older than the general population, with 58% aged 50 or older. However, Hispanic and Asian Catholics typically skew younger than their White counterparts.\\n\\nGeographically, Catholics are relatively evenly distributed across the U.S.:\\n* 29% in the South\\n* 26% in the Northeast\\n* 25% in the West\\n* 20% in the Midwest\\n\\n## Education and Religious Practice\\nEducational attainment varies by ethnic group, with 35% of all U.S. Catholics holding a bachelor's degree.\\n\\nRegarding religious practice:\\n* 29% attend Mass weekly or more often\\n* 51% pray daily\\n\\nPolitical affiliations show that 53% of Catholic registered voters identify with or lean Republican, though this varies significantly by ethnicity."
}