{
  "title": "MIT ADT University to offer Post Graduate Diploma in Data Science",
  "publication_date": "2021-12-24T00:00:00Z",
  "summary": "MIT Centre for Future Skills Excellence at MIT Art, Design and Technology University has partnered with AI Beehive to launch a Post Graduate Diploma program in Data Science.",
  "content": "MIT Art, Design and Technology University has announced a collaboration with AI Beehive to offer a Post Graduate Diploma in Data Science. The program will be run through the MIT Centre for Future Skills Excellence, aiming to provide advanced education in the growing field of data science. This partnership represents a significant step in expanding educational opportunities in technology and data analytics at the graduate level.",
  "category": "Technology",
  "tags": [
    "education",
    "data science",
    "technology",
    "higher education",
    "university",
    "postgraduate studies"
  ],
  "location": "Pune, India",
  "source": {
    "title": "MIT ADT University to offer Post Graduate Diploma in Data Science",
    "publication_date": 1640302200,
    "content": "MIT ADT University to offer Post Graduate Diploma in Data Science\nPUNE, India, Dec. 24, 2021 /PRNewswire/ — MIT Centre for Future Skills Excellence, MIT Art, Design and Technology University teams up with AI Beehive to jointly run the Post Graduate D... [7807 chars]",
    "source": "Jimmys Post",
    "authors": [],
    "image_url": "https://jimmyspost.com/wp-content/uploads/2021/12/MIT-ADT-University-to-offer-Post-Graduate-Diploma-in-Data.jpg",
    "url": "https://jimmyspost.com/mit-adt-university-to-offer-post-graduate-diploma-in-data-science"
  },
  "markdown_content": "MIT Art, Design and Technology University has announced a collaboration with AI Beehive to offer a Post Graduate Diploma in Data Science. The program will be run through the MIT Centre for Future Skills Excellence, aiming to provide advanced education in the growing field of data science.\\n\\nThis partnership represents a significant step in expanding educational opportunities in technology and data analytics at the graduate level.\\n[note: no special markdown formatting needed as this is a simple news announcement without sections, quotes, or lists]"
}