{
  "title": "Tuberculosis: An ancient killer we can't seem to defeat",
  "publication_date": "2025-04-18T00:00:00Z",
  "summary": "Despite having a cure since the 1950s, tuberculosis (TB) remains the world's deadliest infectious disease, killing over 1 million people annually. COVID-19 reversed years of progress in TB control, with cases rising even in wealthy nations. The disease faces multiple challenges including high testing costs, missing diagnoses, drug resistance, and underfunded vaccine research, requiring renewed global commitment to eliminate.",
  "content": "We've been able to cure tuberculosis for decades. So why does the disease still kill more than 1 million people every year?\n\nAn estimated quarter of the world's population — about 2 billion people — unknowingly carries a dormant tuberculosis infection.\n\nIt's a disease we've known how to treat since the 1950s, and yet tuberculosis (TB) continues to infect some 10 million people and kill a million more every year.\n\nThe World Health Organization (WHO) aims to reduce TB cases by 80% by 2030. But control efforts were dealt a blow by COVID-19, which reversed years of progress as attention shifted to addressing the pandemic.\n\nNow TB is again the world's deadliest infectious disease.\n\nWhile TB disproportionately affects lower-income countries, wealthy nations aren't immune. The United Kingdom reported a 13% rise in TB cases in 2024, threatening its \"low TB\" status, with one-third of patients experiencing treatment delays.\n\nSkeletal records from 4,000 B.C. show TB has been infecting humans for thousands of years, spreading through airborne droplets when infected people cough or speak. Unlike many disease-causing microbes, TB can lie dormant in a person's body for decades without causing symptoms.\n\nThe WHO estimates nearly 3 million TB cases are never diagnosed or reported every year, creating a reservoir for continued transmission. These cases are known as the \"missing millions.\"\n\nTB bacteria can develop resistance to antibiotics, especially when treatments are interrupted or incomplete. Standard TB treatment requires multiple antibiotics taken consistently for six months — a regimen many patients struggle to complete due to side effects, stigma or limited access to health care.\n\nRecent funding decisions have raised concerns. The US government's recent move to slash USAID funding, and other nations' cuts to foreign aid, have threatened to undermine progress in high-burden countries at a critical moment.\n\nNew molecular diagnostic tools can detect TB in hours rather than weeks, allowing for faster treatment. Meanwhile, several candidates for TB vaccines are in late-stage clinical trials. But ending TB will require multi-sector action: strengthening health care systems, addressing poverty and malnutrition, improving housing conditions to reduce transmission and ensuring universal access to diagnosis and treatment.",
  "category": "Health",
  "tags": [
    "tuberculosis",
    "public health",
    "infectious disease",
    "global health",
    "medicine",
    "healthcare",
    "WHO",
    "pandemic",
    "medical research",
    "vaccines"
  ],
  "location": "Global",
  "source": {
    "title": "Tuberculosis: An ancient killer we can't seem to defeat",
    "publication_date": 1744970670,
    "content": [
      {
        "title": "Tuberculosis: An ancient killer we can't seem to defeat – DW – 04/18/2025",
        "publication_date": "Unknown",
        "content": "We've been able to cure tuberculosis for decades. So why does the disease still kill more than 1 million people every year?\n\nAn estimated quarter of the world's population — about 2 billion people — unknowingly carries a dormanttuberculosisinfection.\n\nIt's a disease we've known how to treat since the 1950s, and yet tuberculosis (TB) continues to infect some 10 million people and kill a million more every year.\n\nTheWorld Health Organization (WHO)aims to reduce TB cases by 80% by 2030. But control efforts were dealt a blow byCOVID-19, which reversed years of progress as attention shifted to addressing the pandemic.\n\nNow TB is again the world's deadliest infectious disease.\n\nWhile TB disproportionately affects lower-income countries, wealthy nations aren't immune. The United Kingdom reported a 13% rise in TB cases in 2024, threatening its \"low TB\" status, with one-third of patients experiencing treatment delays.\n\nIn January 2025, the US recorded itslargest ever outbreak.\n\nSkeletal records from 4,000 B.C. show TB has been infecting humans for thousands of years, spreading through airborne droplets when infected people cough or speak. It's caused by Mycobacterium tuberculosis; a bacterium first identified in the 1880s by German scientist Robert Koch.\n\nBut unlike many disease-causing microbes, TB can lie dormant in a person's body for decades without causing symptoms.\n\nWhen it becomes active — often triggered by weak immunity — it attacks thelungsand can also spread throughout the body. Typical symptoms include a cough producing blood-containing mucus, fever and weight loss.\n\nTB has proven remarkably resilient and difficult to contain.\n\nWhile there are ways to diagnose and treat the disease, several critical barriers continue to prevent its elimination.\n\n\"The price of effective TB tests remains too high,\" said Jasmin Behrends, an advocacy officer at Doctors Without Borders.\n\nThe WHO estimates nearly 3 million TB cases are never diagnosed or reported every year, creating a reservoir for continued transmission. These cases are known as the \"missing millions.\"\n\n\"We need to shift from passive to proactive case finding, including intensified case finding, among those who visit health facilities,\"said Dr. Mohammed Yassin, a senior adviser on tuberculosis at the Global Fund.\n\n\"[We also need to take these] services to where people are, especially to reach those with high risk and limited access — homes, workplaces, prisons, urban slums and remote communities.\"\n\n\"Children at risk of having TB are often overlooked, either going undiagnosed or facing delays in diagnosis,\" said Behrends.\n\nTB bacteria can develop resistance toantibiotics, especially when treatments are interrupted or incomplete.\n\nStandard TB treatment requires multiple antibiotics taken consistently for six months — a regimen many patients struggle to complete due to side effects, stigma or limited access to health care.\n\nMultidrug-resistant TB requires longer, more toxic and more expensive treatment courses. The WHO estimated 400,000 new cases of drug-resistant TB in 2023 alone.\n\n\"Shorter regiments to treat resistant forms of TB have to be implemented worldwide to treat patients with less severe side effects in a much shorter time,\" said Behrends.\n\nMeanwhile, the first and only TB vaccine, known as the BCG, was developed over a century ago. While it protects children from the most severe forms of TB, it offers minimal protection to adults.\n\nBut meaningful opportunities for better vaccines have been limited by funding.\n\nWhile COVID-19 vaccines received $90 billion (€79.1 billion) in development funding, TB vaccine research has secured just $1.1 billion (€967 million) over the last 11 years.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser thatsupports HTML5 video\n\nRecent funding decisions have also raised concerns. The US government's recent move to slashUSAID funding, and other nations' cuts to foreign aid, have threatened to undermine progress in high-burden countries at a critical moment.\n\n\"[Doctors Without Borders] is gravely concerned about the recent United States funding cuts,\" said Behrends, \"We are already seeing disruptions due to shortages of medical supplies and staff not being paid.\"\n\n\"Sustained international financing is essential to the global fight against TB. Any reduction in funding — whether temporary or long term — can have real and immediate effects on people’s lives,\" said Yassin.\n\nNew molecular diagnostic tools can detect TB in hours rather than weeks, allowing for faster treatment. Meanwhile, several candidates for TB vaccines are in late-stage clinical trials.\n\nThe Tuberculosis Vaccine Accelerator Council, launched in 2023, aims to speed up development by applying lessons from the COVID-19 response.\n\nBut ending TB will require multi-sector action: strengthening health care systems, addressing poverty and malnutrition, improving housing conditions to reduce transmission and ensuring universal access to diagnosis and treatment.\n\nA UN high-level meeting on TB in 2023 renewed these commitments, but translating promises into action remains the critical challenge.\n\n\"TB is no longer a silent epidemic,\"said Yassin.\n\n\"Advocates, survivors, scientists and donors are coming together to demand change. The momentum from the 2023 UN high-level meeting on TB shows that global leaders recognize the urgency — and the opportunity — to end TB within our lifetime.\"\n\nEdited by: Matthew Ward Agius"
      },
      {
        "title": "Tuberculosis: An ancient killer we can't seem to defeat – DW – 04/18/2025",
        "author": "Unknown Author",
        "publication_date": "Unknown"
      }
    ],
    "authors": [],
    "source": "DW",
    "image_url": "https://static.dw.com/image/5382557_804.jpg",
    "url": "https://www.dw.com/en/tuberculosis-an-ancient-killer-we-cant-seem-to-defeat/a-72275982"
  },
  "markdown_content": "## The Persistent Threat of Tuberculosis\\n\\nWe've been able to cure tuberculosis for decades. So why does the disease still kill more than 1 million people every year?\\n\\nAn estimated quarter of the world's population — about 2 billion people — unknowingly carries a dormant tuberculosis infection.\\n\\nIt's a disease we've known how to treat since the 1950s, and yet tuberculosis (TB) continues to infect some 10 million people and kill a million more every year.\\n\\n## Current Challenges\\n\\nThe World Health Organization (WHO) aims to reduce TB cases by 80% by 2030. But control efforts were dealt a blow by COVID-19, which reversed years of progress as attention shifted to addressing the pandemic.\\n\\nNow TB is again the world's deadliest infectious disease.\\n\\nWhile TB disproportionately affects lower-income countries, wealthy nations aren't immune. The United Kingdom reported a 13% rise in TB cases in 2024, threatening its \"low TB\" status, with one-third of patients experiencing treatment delays.\\n\\n## Historical Context and Disease Characteristics\\n\\nSkeletal records from 4,000 B.C. show TB has been infecting humans for thousands of years, spreading through airborne droplets when infected people cough or speak. Unlike many disease-causing microbes, TB can lie dormant in a person's body for decades without causing symptoms.\\n\\nThe WHO estimates nearly 3 million TB cases are never diagnosed or reported every year, creating a reservoir for continued transmission. These cases are known as the \"missing millions.\"\\n\\n## Treatment Challenges\\n\\nTB bacteria can develop resistance to antibiotics, especially when treatments are interrupted or incomplete. Standard TB treatment requires multiple antibiotics taken consistently for six months — a regimen many patients struggle to complete due to side effects, stigma or limited access to health care.\\n\\n## Funding and Future Prospects\\n\\nRecent funding decisions have raised concerns. The US government's recent move to slash USAID funding, and other nations' cuts to foreign aid, have threatened to undermine progress in high-burden countries at a critical moment.\\n\\nNew molecular diagnostic tools can detect TB in hours rather than weeks, allowing for faster treatment. Meanwhile, several candidates for TB vaccines are in late-stage clinical trials. But ending TB will require multi-sector action: strengthening health care systems, addressing poverty and malnutrition, improving housing conditions to reduce transmission and ensuring universal access to diagnosis and treatment."
}