{
  "title": "16-Million-Year-Old Creature Discovered Encased in Amber Stuns Scientists",
  "publication_date": "2025-04-17T12:45:00-04:00",
  "summary": "Scientists from NJIT discovered a new extinct species of Caribbean \"dirt ant\" preserved in 16-million-year-old Dominican amber. Named Basiceros enana, this tiny predator measures just 5mm and reveals surprising evolutionary insights, including that modern relatives are twice its size, contrary to previous theories about size evolution in the species.",
  "content": "A fossilized ant encased in 16-million-year-old amber has revealed a now-extinct predator that once thrived in the Caribbean—flipping scientists' expectations about its size, evolution, and survival.\n\nResearchers from the New Jersey Institute of Technology (NJIT) have uncovered the first fossil of a Caribbean \"dirt ant\", preserved in 16-million-year-old Dominican amber. The ancient ant, now identified as a new extinct species named Basiceros enana, is smaller than any living relative of its genus and offers critical insight into the evolution, migration, and extinction of insect lineages in the region.\n\nMeasuring just over 5 millimeters, Basiceros enana uses specialized hairs on their bodies to bind particles of soil and debris, a trait known as cryptsis. Thanks to advanced Micro-CT scanning and 3D modeling, the team discovered mandibles with 12 triangular teeth, a unique trapezoidal head, and two distinct layers of dirt-binding hairs.\n\nOne of the study's most surprising findings is the reversal of size expectations. While previous theories suggested dirt ants were ancestrally large and shrank over time, Basiceros enana reveals the opposite: this ancient species was significantly smaller, with modern descendants nearly twice its size.\n\nThe discovery provides evidence that the Caribbean once hosted species now found only in Central and South America. The presence of Basiceros in Dominican amber suggests ancient land bridges may have allowed them to migrate into the islands. The study points to possible reasons, such as niche collapse, environmental change, or competition, for their local extinction during the Miocene epoch.",
  "category": "Science",
  "tags": [
    "paleontology",
    "amber",
    "fossils",
    "insects",
    "evolution",
    "archaeology",
    "biodiversity",
    "Caribbean"
  ],
  "location": "Dominican Republic",
  "source": {
    "title": "16-Million-Year-Old Creature Discovered Encased in Amber Stuns Scientists",
    "publication_date": 1744888500,
    "content": [
      {
        "title": "16-Million-Year-Old Creature Discovered Encased in Amber Stuns Scientists",
        "publication_date": "2025-04-17T12:45:00-04:00",
        "content": "A fossilized ant encased in 16-million-year-old amber has revealed a now-extinct predator that once thrived in the Caribbean—flipping scientists’ expectations about its size, evolution, and survival.\n\nA remarkable discovery has given scientists a clearer view into the distant past of Earth’s biodiversity. Researchers from the New Jersey Institute of Technology (NJIT) have uncovered the first fossil of a Caribbean “dirt ant”, preserved in16-million-year-old Dominican amber. The ancient ant, now identified as a new extinct species namedBasiceros enana, is smaller than any living relative of its genus and offers critical insight into the evolution, migration, and extinction of insect lineages in the region. The findings were published in thejournalProceedings of the Royal Society B.\n\nMeasuring just over5 millimeters,Basiceros enanamay be tiny, but it carries huge evolutionary significance. Dirt ants—so named for theirremarkable camouflage—usespecialized hairson their bodies to bind particles of soil and debris, a trait known ascrypsis. These same adaptations are seen in this fossil, indicating that such survival strategies were already in placemillions of years ago.\n\nThanks to advancedMicro-CT scanningand 3D modeling, the team could examine the fossil in fine detail, revealingmandibles with 12 triangular teeth, a uniquetrapezoidal head, and two distinct layers of dirt-binding hairs. These features suggest it was apredatory species—possibly one of many that once roamed the ancient Caribbean forests.\n\nOne of the study’s most surprising findings is thereversal of size expectations. While previous theories suggested dirt ants were ancestrally large and shrank over time,Basiceros enanareveals the opposite: this ancient species wassignificantly smaller, with modern descendants nearlytwice its size.\n\n“This flips that on its head,” saidGianpiero Fiorentino, lead author of the study. “It really illustrates how important fossils can be to understanding the evolution of a lineage.” The rapid size increase over 20 million years challenges assumptions about the group’s evolutionary pressures and raises new questions about what drove their growth and geographical spread.\n\nThe discovery also provides compelling evidence that theCaribbean once hosted species now found only in Central and South America. “A fossil like this underscores how the distribution of living species can belie the complex evolutionary history of life on our planet,” saidPhil Barden, senior author and NJIT professor.\n\nThe presence ofBasicerosin Dominican amber suggests ancient land bridges may have allowed them to migrate into the islands. But while modern dirt ants have survived elsewhere, this Caribbean lineage did not. The study points to possible reasons, such asniche collapse, environmental change, orcompetition, for their local extinction during theMiocene epoch.\n\n“Over a third of ant genera have gone extinct on the island of modern-day Dominican Republic since the formation of Dominican amber,” Fiorentino noted. Understanding such patterns could offer lessons forpreserving modern biodiversityin the face of climate change and human activity.\n\nComment\n\nSave my name, email, and website in this browser for the next time I comment.\n\n© 2024 | Indian Defence Review  | All rights reserved"
      },
      {
        "title": "16-Million-Year-Old Creature Discovered Encased in Amber Stuns Scientists",
        "author": "Unknown Author",
        "publication_date": "2025-04-17T12:45:00-04:00"
      }
    ],
    "authors": [
      "Lydia Amazouz"
    ],
    "source": "Indian Defence Review",
    "image_url": "https://indiandefencereview.com/wp-content/uploads/2025/04/16-million-year-old-creature-discovered-encased-in-amber-stuns-scientists.jpg",
    "url": "https://indiandefencereview.com/16-million-year-old-creature-encased-amber/"
  },
  "markdown_content": "## New Ancient Species Discovery\\nA fossilized ant encased in 16-million-year-old amber has revealed a now-extinct predator that once thrived in the Caribbean—flipping scientists' expectations about its size, evolution, and survival.\\n\\nResearchers from the New Jersey Institute of Technology (NJIT) have uncovered the first fossil of a Caribbean \"dirt ant\", preserved in 16-million-year-old Dominican amber. The ancient ant, now identified as a new extinct species named *Basiceros enana*, is smaller than any living relative of its genus and offers critical insight into the evolution, migration, and extinction of insect lineages in the region.\\n\\n## Physical Characteristics\\nMeasuring just over 5 millimeters, *Basiceros enana* uses specialized hairs on their bodies to bind particles of soil and debris, a trait known as cryptsis. Thanks to advanced Micro-CT scanning and 3D modeling, the team discovered:\\n\\n* Mandibles with 12 triangular teeth\\n* A unique trapezoidal head\\n* Two distinct layers of dirt-binding hairs\\n\\n## Evolutionary Implications\\nOne of the study's most surprising findings is the reversal of size expectations. While previous theories suggested dirt ants were ancestrally large and shrank over time, *Basiceros enana* reveals the opposite: this ancient species was significantly smaller, with modern descendants nearly twice its size.\\n\\n## Historical Distribution\\nThe discovery provides evidence that the Caribbean once hosted species now found only in Central and South America. The presence of *Basiceros* in Dominican amber suggests ancient land bridges may have allowed them to migrate into the islands. The study points to possible reasons for their local extinction during the Miocene epoch:\\n\\n* Niche collapse\\n* Environmental change\\n* Competition"
}