{
  "title": "Search is over for woman, 2 young children near Quebec-U.S. border",
  "publication_date": "2024-01-18T00:00:00Z",
  "summary": "Quebec provincial police ended their search for a woman and two young children believed to have crossed the U.S.-Canada border illegally near Trout River, Quebec. The search began after three people were arrested for illegal entry, revealing during interviews that a woman and children were missing. Officials believe the missing group may have left the area by car.",
  "content": "After nearly a full day, a search and rescue operation is over for a woman and two young children who are believed to have crossed the border from the United States into Canada overnight.\n\nQuebec provincial police, who took over the search from the RCMP Thursday, say they believe the missing trio may have left the area by car. They say an investigation is underway.\n\nRCMP said they launched the search around midnight Thursday in the area surrounding Trout River, Que., in the Montérégie region, after two men and a woman were arrested Wednesday night for illegally entering the country.\n\nRCMP spokesperson Martina Pillarova said it was only during interviews with those who were arrested that officers learned of the missing woman and children. The ages of the children have not been confirmed, but the Sûreté du Québec (SQ) told CBC they are believed to be as young as three years old.\n\nThe incident occurs amid increasing illegal border crossings following U.S. policy changes affecting temporary status holders from various countries. The Trump administration's immigration policies and recent cancellations of Temporary Protected Status for hundreds of thousands have created uncertainty, leading more people to seek asylum in Canada.\n\nData shows asylum claims at the Saint-Bernard-de-Lacolle border crossing increased from 560 in January to 1,411 as of April 13, though these numbers don't include those whose claims were rejected.",
  "category": "World",
  "tags": [
    "immigration",
    "border crossing",
    "refugees",
    "Canada",
    "United States",
    "search and rescue",
    "asylum seekers"
  ],
  "location": "Trout River, Quebec",
  "source": {
    "title": "Search is over for woman, 2 young children near Quebec-U.S. border",
    "publication_date": 1744907786,
    "content": [
      {
        "title": "Search is over for woman, 2 young children near Quebec-U.S. border | CBC News",
        "publication_date": "Unknown",
        "content": "After nearly a full day, a search and rescue operation is over for a woman and two young children who are believed to have crossed the border from the United States into Canada overnight.\n\nQuebec provincial police, who took over the search from the RCMP Thursday, say they believe the missing trio may have left the area by car. They say an investigation is underway,\n\nRCMP said they launched the search around midnight Thursday in the area surrounding Trout River, Que., in the Montérégie region, after two men and a woman were arrested Wednesday night for illegally entering the country.\n\nRCMP spokesperson Martina Pillarova said it was only during interviews with those who were arrested that officers learned of the missing woman and children.\n\nThe ages of the children have not been confirmed, but the Sûreté du Québec (SQ) told CBC they are believed to be as young as three years old.\n\nPillarova said medical emergency services were also on standby as there were concerns for their safety.\n\n\"They might be injured or dehydrated,\" Pillarova said, more than 10 hours after the search began.\n\nThere is an official border crossing at Trout River that links the municipality of Elgin, Que., to Constable, N.Y., which is open from 6 a.m. to 6 p.m. most days.\n\nElgin's general manager Guylaine Cloutier said that illegal crossings have increased since U.S. President Donald Trump's second term began, but noted it's not a new issue.\n\n\"It's always existed,\" she said, adding that although it's worrisome, there's not much the municipality can do to help.\n\n\"We don't have the capacity or resources,\" she said.\n\nThe Trump administration's crackdown on immigration has coincided with a steadily increasing number of asylum claims by would-be refugees in Quebec.\n\nU.S. Homeland Security said last month it was revoking the temporary status of 532,000 people from Cuba, Haiti, Nicaragua and Venezuela who flew to the country at their own expense with a financial sponsor. It ends April 24.\n\nThe Trump administration has also announced an end to Temporary Protected Status for 600,000 Venezuelans and about 500,000 Haitians — set to expire in August — though a federal judge temporarily put that on hold.\n\nFrantz André, a spokesperson for the Action Committee for People Without Status, says the cancellations of these programs have created a wave of fear and uncertainty. He's in contact with people on both sides of the border, including a Haitian man who attempted to cross into Canada Wednesday.\n\n\"People are basically being [told], 'Go back home because otherwise we'll deport you.' So they're worried, they're leaving everything behind, they have like family, they don't have time to sell, they actually give away anything they have, including their clothes,\" said André.\n\nData obtained by Radio-Canada shows that the number of claims processed at the popular Saint-Bernard-de-Lacolle border crossing went from 560 in January to 1,411 as of April 13.\n\nAndré says those statistics, however, don't reflect the number of people whose claims were not processed and who were sent back instead.\n\nThe Canada-U.S. Safe Third Country Agreement requires people to claim asylum in the first safe country they reach — meaning they can't travel to the U.S., for example, and then claim asylum in Canada.\n\nThere are exceptions, however: would-be refugees can cross the border and claim asylum in Canada if they have a family member in the country or if they are an unaccompanied minor. Another exception exists for anyone who crosses illegally into Canada and hides out for two weeks before making their claim.\n\nAndré argues the U.S. can no longer be considered a safe country for migrants, citing what he describes as its disregard for due process.\n\n\"When you're sent back, there's a good chance they will detain you, put you in a federal prison and deport [you], even though there is a [different] decision from the judge,\" he said.\n\nAmerican policies and their impact on Canada have been front and centre on the federal campaign trail, and Wednesday's French-language leaders' debate was no different.\n\nTheleaders weighed in on immigration, and asylum seekers, in particular.\n\nConservative Leader Pierre Poilievre said he would block individuals coming from the U.S. and seeking asylum in Canada.\n\nLiberal Leader Mark Carney said there are limits to what the country can handle.\n\n\"We have to be human, but we have to be realistic. Canada can't accept everyone,\" he said, noting most asylum seekers would likely be turned back to the U.S. given the Safe Third Country Agreement.\n\nMeanwhile, NDP Leader Jagmeet Singh proposed doing away with the Safe Third Country Agreement.\n\nJournalist\n\nAnnabelle Olivier is a digital journalist at CBC Montreal. She previously worked at Global News as an online producer. You can reach her at anne.isabelle.olivier@cbc.ca.\n\nWith files from Benjamin Shingler, The Canadian Press and Radio-Canada\n\nAudience Relations, CBCP.O. Box 500 Station AToronto, ONCanada, M5W 1E6\n\nToll-free (Canada only):1-866-306-4636\n\nIt is a priority for CBC to create products that are accessible to all in Canada including people with visual, hearing, motor and cognitive challenges.\n\nClosed Captioning and Described Video is available for many CBC shows offered onCBC Gem."
      },
      {
        "title": "Search is over for woman, 2 young children near Quebec-U.S. border | CBC News",
        "author": "Unknown Author",
        "publication_date": "Unknown"
      }
    ],
    "authors": [
      "Annabelle Olivier"
    ],
    "source": "CBC",
    "image_url": "https://i.cbc.ca/1.7512829.1744899940!/fileImage/httpImage/image.jpeg_gen/derivatives/16x9_940/quebec-u-s-border-crossing.jpeg",
    "url": "https://www.cbc.ca/news/canada/montreal/migrants-quebec-usa-border-1.7512807"
  },
  "markdown_content": "## Initial Incident\\nAfter nearly a full day, a search and rescue operation is over for a woman and two young children who are believed to have crossed the border from the United States into Canada overnight.\\n\\nQuebec provincial police, who took over the search from the RCMP Thursday, say they believe the missing trio may have left the area by car. They say an investigation is underway.\\n\\n## Search Operation Details\\nRCMP said they launched the search around midnight Thursday in the area surrounding Trout River, Que., in the Montérégie region, after two men and a woman were arrested Wednesday night for illegally entering the country.\\n\\n> RCMP spokesperson Martina Pillarova said it was only during interviews with those who were arrested that officers learned of the missing woman and children.\\n\\nThe ages of the children have not been confirmed, but the Sûreté du Québec (SQ) told CBC they are believed to be as young as three years old.\\n\\n## Broader Context\\nThe incident occurs amid increasing illegal border crossings following U.S. policy changes affecting temporary status holders from various countries. The Trump administration's immigration policies and recent cancellations of Temporary Protected Status for hundreds of thousands have created uncertainty, leading more people to seek asylum in Canada.\\n\\nData shows asylum claims at the Saint-Bernard-de-Lacolle border crossing increased from:\\n* 560 in January\\n* 1,411 as of April 13 (not including rejected claims)"
}