{
  "title": "Novel RNA blood test can make early detection of Parkinson's disease",
  "publication_date": "2025-04-18T00:00:00Z",
  "summary": "Researchers at Hebrew University of Jerusalem developed a novel blood test for early detection of Parkinson's disease using RNA fragments. The test measures the ratio between PD-specific tRFs and mitochondrial tRFs, achieving 86% diagnostic accuracy. This non-invasive, rapid and affordable test could revolutionize early diagnosis before symptoms appear, enabling earlier intervention and better patient outcomes.",
  "content": "Diagnosis of neurodegenerative disease is currently often made too late in the disease progression for effective treatment to be started, leaving management of the disease in a similar situation to where we were with cancer therapies in the early 1970s. Now, a simple and cost-effective blood test has been developed which is capable of detecting Parkinson's disease (PD) long before the emergence of symptoms.\n\nToday, diagnosis of neurodegenerative diseases is definitively identified when the relevant neurons have already died and as such is too late to receive effective treatment. A research team from the Hebrew University of Jerusalem has developed a novel blood test, to address this problem, which has the potential to revolutionise early diagnosis of PD, paving the way for screening programmes and earlier intervention to improve patient outcomes.\n\nThe test measures RNA fragments in the blood, to detect the repetitive RNA sequences that accumulate in Parkinson's patients, and also a parallel decline in mitochondrial RNA, which is known to deteriorate with disease progression. The ratio that can be measured between these biomarkers makes the test very accurate, as well as non-invasive, rapid and affordable as a diagnostic tool in the clinic. Early treatments could offer hope to change the course of the disease.\n\nLed by Nimrod Madrer under Professor Hermona Soreq's supervision at The Hebrew University, the study uses its novel approach to analyse transfer RNA fragments (tRFs) to detect PD at an earlier stage. The test achieved a diagnostic accuracy of 0.86 in trials involving multiple international cohorts, significantly outperforming traditional clinical scoring methods.\n\nThe test uses a dual quantitative polymerase chain reaction assay to measure the ratio between the repeated short motif and the MT-tRFs, making it both cost-effective and accessible for wide healthcare use. The study also found that levels of RGTTCRA-tRF decrease following deep brain stimulation, linking these RNA fragments to both PD mechanisms and treatment responses.",
  "category": "Health",
  "tags": [
    "medical research",
    "Parkinson's disease",
    "diagnostics",
    "neurology",
    "RNA",
    "blood test",
    "medical breakthrough"
  ],
  "location": "Jerusalem, Israel",
  "source": {
    "title": "Novel RNA blood test can make early detection of Parkinson’s disease",
    "publication_date": 1744968737,
    "content": [
      {
        "title": "Novel RNA blood test can make early detection of Parkinson’s disease",
        "publication_date": "Unknown",
        "content": "Apr 18 2025\n\nDiagnosis of neurodegenerative disease is currently often made too late in the disease progression for effective treatment to be started, leaving management of the disease in a similar situation to where we were with cancer therapies in the early 1970s. Now, a simple and cost-effective blood test has been developed which is capable of detecting Parkinson’s disease (PD) long before the emergence of symptoms.\n\nToday, diagnosis of neurodegenerative diseases is definitively identified when the relevant neurons have already died and as such is too late to receive effective treatment. A research team from the Hebrew University of Jerusalem has developed a novel blood test, to address this problem, which has the potential to revolutionise early diagnosis of PD, paving the way for screening programmes and earlier intervention to improve patient outcomes.\n\nThe test measures RNA fragments in the blood, to detect the repetitive RNA sequences that accumulate in Parkinson’s patients, and also a parallel decline in mitochondrial RNA, which is known to deteriorate with disease progression. The ratio that can be measured between these biomarkers makes the test very accurate. As well as non-invasive, rapid and affordable as a diagnostic tool in the clinic. Early treatments could offer hope to change the course of the disease.\n\nMotor circuits in brain can be repaired with newly grown neurons and so reverse damage caused by Huntington’s diseaseVIDEO: The study has revealed that the adult brain can generate new neurons that integrate into key motor circuits – an insight that challenges long-held beliefs about adult neurogenesis. The r...Read More\n\nLed by Nimrod Madrer, a doctoral student under the supervision of Professor Hermona Soreq at The Edmond and Lily Safra Center for Brain Sciences and the Alexander Silberman Institute of Life Sciences, at the Hebrew University, the study uses its novel approach to analyse transfer RNA fragments (tRFs) in order to detect PD at an earlier stage. Madrer and Soreq also collaborated with Dr. Iddo Paldor, Shaare Zedek Medical Center, and Dr. Eyal Soreq, of both the University of Surrey and Imperial College, London.\n\nPreviously overlooked in PD research, tRFs are small RNA molecules linked to neurodegeneration but are now shown to have the potential to reveal the early changes to the brain in PD. Two key biomarkers were identified, one which expressed an increase in PD-specific tRFs carrying a conserved sequence motif – RGTTCRA-tRFs – and a decrease in mitochondrial tRFs (MT-tRFs). Measurement of the ratio between these two biomarkers gives the new test which can now differentiate between pre-symptomatic Parkinson’s patients from control subjects. Accuracy surpasses that of existing clinical diagnostic tools, where in trials involving samples from multiple international cohorts, including theParkinson’s Progression Markers Initiative, the test achieved a diagnostic accuracy of 0.86, significantly outperforming traditional clinical scoring methods.\n\n“This discovery represents a major advance in our understanding of Parkinson’s disease and offers a simple, minimally invasive blood test as a tool for early diagnosis,” said Professor Soreq.\n\n“By focusing on tRFs, we’ve opened a window into the molecular changes that occur in the earliest stages of the disease.”\n\nThe test uses a dual quantitative polymerase chain reaction assay to measure the ratio between the repeated short motif and the MT-tRFs. This makes it both cost-effective and accessible to use in a wide range of healthcare settings. The study also found that levels of RGTTCRA-tRF are shown to decrease following deep brain stimulation, which further links these fragments of RNA to both PF mechanisms but also treatment responses.\n\n“This test has the potential to alleviate the uncertainty faced by patients and clinicians, offering a reliable and rapid method to identify the disease in its earliest stages,” said Madrer, noting that PD is often diagnosed once irreversible damage to the brain has already occurred.\n\nThe findings have been published under US Provisional Patent Applications, and large scale diagnostic tests provided broader clinical validation.\n\nResearchers\n\nNimrod Madrer1,2, Shani Vaknine-Treidel1,2, Tamara Zorbaz,1,2Yonat Tzur1,2, Estelle R. Bennett1,2, Paz Drori2,Nitzan Suissa5, David S. Greenberg1,2, Eitan Lerner,2,3, Eyal Soreq4,6, Iddo Paldor2,5, Hermona Soreq1,2\n\nInstitutions\n\n1.The Edmond and Lily Safra Center for Brain Sciences, The Hebrew University of Jerusalem\n\n2.Department of Biological Chemistry, The Alexander Silberman Institute of Life Sciences, Faculty of Mathematics and Science, The Hebrew University of Jerusalem\n\n3.The Center for Nanoscience and Nanotechnology, The Hebrew University of Jerusalem\n\n4.UK Dementia Research Institute Care Research and Technology Centre (UK DRI CR&T) at Imperial College London and the University of Surrey\n\n5.The Neurosurgery department, Shaare Zedek Medical center, Jerusalem\n\n6.Department of Brain Sciences, Faculty of Medicine, Imperial College London\n\nFor further reading please visit:10.1038/s43587-025-00851-z\n\nNot stopping the US’ measles outbreak in its tracks could have dire global repercussions\n\n\n\n\n\nBy mid-April 2025, the measles outbreak in the United State...\n\nApr 17 2025\n\nStudy suggest there are currently almost 300 genetic disorders which can be treated in utero or in the first week of life\n\n\n\n\n\nA collaboration drawing rese...\n\nApr 15 2025\n\nHPGDS enzyme plays key role in resistance of immunotherapy in various cancers \n\n\n\n\n\nUp to 65% of patients with melanoma do not respond to treatment with i...\n\nApr 14 2025\n\nMajor study shows that adults with respiratory syncytial virus-associated acute respiratory infection face a 2.7-fold higher risk of death within a year...\n\nApr 11 2025\n\nApril 2025\n\nChromatography Articles\n\n\n\n- Effects of small deviations in flow rate on GPC/SEC results\n\n\n\nMass Spectrometry & Spectroscopy Articles\n\n\n\n- Waiting for the present to catch up to the future: A bette...\n\nFORUMESURE\n\nApr 22 2025Hammamet, Tunisia\n\nKorea Lab 2025\n\nApr 22 2025Kintex, South Korea\n\nAnalytica Anacon India & IndiaLabExpo\n\nApr 23 2025Mumbai, India\n\nAnalitika Expo 2024\n\nApr 23 2025Moscow, Russia\n\nExpomed Eurasia\n\nApr 24 2025Istanbul, Turkey\n\nInternational Labmate LimitedOak Court Business CentreSandridge Park, Porters WoodSt AlbansHertfordshireAL3 6PHUnited Kingdom\n\nT+44 (0)1727 858 840F+44 (0)1727 840 310Einfo@labmate-online.com\n\nCopyright © 2025 Labmate Online. All rights reserved."
      },
      {
        "title": "Novel RNA blood test can make early detection of Parkinson’s disease",
        "author": "International Labmate",
        "publication_date": "Unknown"
      }
    ],
    "authors": [],
    "source": "Labmate Online",
    "image_url": "https://www.labmate-online.com/assets/file_store/pr_files/64464/thumbnails/images/391w_Parkinsons-disease-symptoms.jpg",
    "url": "https://www.labmate-online.com/news/laboratory-research-news/126/breaking-news/parkinsons-blood-test/64464"
  },
  "markdown_content": "## Background\\nDiagnosis of neurodegenerative disease is currently often made too late in the disease progression for effective treatment to be started, leaving management of the disease in a similar situation to where we were with cancer therapies in the early 1970s. Now, a simple and cost-effective blood test has been developed which is capable of detecting Parkinson's disease (PD) long before the emergence of symptoms.\\n\\n## Current Diagnostic Challenge\\nToday, diagnosis of neurodegenerative diseases is definitively identified when the relevant neurons have already died and as such is too late to receive effective treatment. A research team from the Hebrew University of Jerusalem has developed a novel blood test, to address this problem, which has the potential to revolutionise early diagnosis of PD, paving the way for screening programmes and earlier intervention to improve patient outcomes.\\n\\n## New Testing Method\\nThe test measures RNA fragments in the blood, to detect the repetitive RNA sequences that accumulate in Parkinson's patients, and also a parallel decline in mitochondrial RNA, which is known to deteriorate with disease progression. The ratio that can be measured between these biomarkers makes the test very accurate, as well as non-invasive, rapid and affordable as a diagnostic tool in the clinic. Early treatments could offer hope to change the course of the disease.\\n\\n## Research Details\\nLed by Nimrod Madrer under Professor Hermona Soreq's supervision at The Hebrew University, the study uses its novel approach to analyse transfer RNA fragments (tRFs) to detect PD at an earlier stage. The test achieved a diagnostic accuracy of 0.86 in trials involving multiple international cohorts, significantly outperforming traditional clinical scoring methods.\\n\\n## Technical Specifications\\nThe test uses a dual quantitative polymerase chain reaction assay to measure the ratio between the repeated short motif and the MT-tRFs, making it both cost-effective and accessible for wide healthcare use. The study also found that levels of RGTTCRA-tRF decrease following deep brain stimulation, linking these RNA fragments to both PD mechanisms and treatment responses."
}