{
  "title": "The Blood Test Revolution Driving These Three Stocks",
  "publication_date": "2025-04-17T20:15:06+00:00",
  "summary": "A revolution in oncology blood testing is driving growth for biotech companies Guardant Health, Natera, and Exact Sciences. These companies are developing blood tests that can detect cancer relapses months earlier than traditional imaging methods by identifying tumor DNA in blood. The minimal residual disease (MRD) test market could reach $6.7 billion by early 2030s, driven by increasing cancer diagnoses and survivors.",
  "content": "A looming revolution in oncology could help the 18 million cancer survivors in the U.S. and bolster biotech stocks like Guardant Health, Natera and Exact Sciences.\n\nCancer rates are on the rise, particularly in young people. These companies are blazing trails in the use of blood tests to detect cancer relapses months sooner than traditional technology by looking for tumor DNA in the blood.\n\nThe MRD test market could be worth between $4.45 billion and $6.7 billion in the early 2030s, up from $2.2 billion in 2023. By 2040, the National Cancer Institute expects there will be 26 million cancer survivors in the U.S.\n\nThese blood tests can detect a relapse an average of 15 months before imaging scans. Guardant's Reveal detects minimal residual disease in colorectal, breast and lung cancers. Natera's Signatera can detect recurrent cancer around nine months before standard scans, while Exact Sciences' Oncodetect showed detection about 10.4 months earlier than imaging.\n\nThe tests serve multiple purposes: monitoring for relapse, determining surgery success, and tracking treatment effectiveness. However, challenges remain, including profitability concerns and technical limitations with certain cancer types.\n\nDespite these challenges, the technology continues to improve. The market potential is significant, driven by growing cancer rates and the need for better monitoring tools. As one expert noted, \"It's huge and growing... we're only scratching the surface.\"",
  "category": "Business",
  "tags": [
    "biotech",
    "healthcare",
    "stocks",
    "cancer",
    "medical technology",
    "blood testing",
    "oncology"
  ],
  "location": "United States",
  "source": {
    "title": "The Blood Test Revolution Driving These Three Stocks",
    "publication_date": 1744901100,
    "content": [
      {
        "title": "The Blood Test Revolution Driving These Three Stocks",
        "publication_date": "2025-04-17T20:15:06+00:00",
        "content": "TRENDING:The Stocks Leading The Blood Test Revolution\n\nCompanies like Guardant Health and Exact Sciences are blazing new trails in the use of blood screening tech for cancer tests. (Madua/Shutterstock/Elizabeth Gessel)\n\nA looming revolution in oncology could help the 18 million cancer survivors in the U.S. and bolster biotech stocks likeGuardant Health(GH),Natera(NTRA) andExact Sciences(EXAS).\n\nAnd all it takes is a little blood.\n\nCancer rates are on the rise, particularly in young people. And when it comes to cancer, it's a no brainer that the earlier a patient undergoes treatment the better the chance they have of surviving. Guardant, Natera and Exact are blazing trails in the use of blood tests to detect cancer relapses months sooner than traditional technology. They do this by looking for tumor DNA in the blood.\n\nEven a low level of tumor DNA in the blood is dangerous, says Richard Chen, chief medical officer forPersonalis(PSNL), a small biotech company that sells a minimal residual disease, or MRD, test called NeXT Personal.\n\n\"It means that the cancer is there, it's festering and there's a good chance it's going to expand and recur for the patient,\" he told Investor's Business Daily. \"Yes, I think it is a five-alarm fire in the sense that if you don't do anything about it and leave it alone, (immune system) surveillance is not necessarily going to take care of it.\"\n\nThe market ismassive and growing. TheMRD test marketcould be worth between $4.45 billion and $6.7 billion in the early 2030s, according to market estimates. That's up from $2.2 billion in 2023, according toGrand View Research. What's driving the opportunity? A sharp increase in the number of cancer diagnoses and, in turn, survivors. By 2040, the National Cancer Institute expects there will be 26 millioncancer survivors in the U.S.\n\nCancer emerges from cellular mutations. MRD tests seek to find those mutations as quickly as possible.\n\nAfter a patient is diagnosed with cancer, the most common route is to attack it with surgery. Guardant Health, Exact Sciences and Natera can run that sample through their systems and come up with a set of mutations — or biomarkers — consistent with that cancer, but not the patient's own DNA.\n\nGuardant sells Reveal, while Natera has its Signatera test. Exact is angling to launch its rival, Oncodetect, in the second quarter. These blood tests screen for a small handful of cancers today. But the companies are vying to prove their merit in a growing number of cancers. Notably, fellow biotech companyVeracyte(VCYT) is planning to launch an MRD test for muscle-invasive bladder cancer in the first half of 2026.\n\nTraditionally, doctorsmonitor for cancer recurrencethrough a variety of imaging tests. If a patient had breast cancer, they might undergo routine mammograms. Lung cancer patients will often receive semi-regular CT scans to look for new tumors. Other patients might undergo PET scans.\n\n\"If you're in remission from your cancer, obviously the No. 1 concern that you have is your cancer is going to come back,\" Mike Brophy, chief financial officer of Natera, told IBD. \"There's already a whole architecture of care for you to monitor that.\"\n\nBut cancer can be unpredictable.\n\n\"The majority of breast cancer survivors who've had their cancer return, it's not going to return to the breast,\" Brophy said. \"It's probably going to return to the liver or the lungs. And you're not going to catch that if you're doing radiology — an image of the breast.\"\n\nDepending on the cancer type, blood tests can detect a relapse an average of 15 months before imagining scans,Guardant HealthChief Executive Helmy Eltoukhy told IBD.\n\nGuardant's Reveal detects minimal residual disease associated with early-stage colorectal, breast and lung cancers. This group accounts for 40% of all cancer survivors, Eltoukhy estimates. Medicare pays for the cost of colon cancer monitoring. Guardant is working to receive reimbursement for breast and lung cancer patients.\n\nAccording to data released in late 2023, Guardant Reveal has detected a breast cancer relapse up to 28.6 months before it would show up with imaging, but with a median lead time of 7.9 months. The latter time also detected a relapse with high specificity, meaning it's more likely to rule out patients who don't have cancer.\n\nNatera's Brophy says Signatera can detect recurrent cancer around nine months before standard scans.\n\nNeXT from Personalis has a six- to 11-month lead time in early-stage lung cancer and can detect breast cancer relapse a median of 15 months ahead of traditional imaging. Chen, the company's CMO, describes NeXT as an ultrasensitive test. That means it's 10 to 100 times more sensitive, analytically, than the first generation of blood tests from companies like Guardant Health and Natera, he said.\n\nIn a recent study called Alpha-Correct,Exact Sciencesfollowed colorectal cancer patients for five years. Oncodetect was able to detect cancer recurrence about 10.4 months earlier than imaging, Chief Science Officer Jorge Garces told IBD.\n\n\"That is critical,\" he said. \"Weeks and months are critical in terms of being able to manage the disease.\"\n\nBut relapse monitoring isn't the only use for MRD testing.\n\nThese blood tests can also determine the success of a surgery and how to proceed from there.\n\nWhile a patient is recovering from surgery at home, companies like Guardant Health and Natera build their bespoke test. Then, after a month or so, patients get a blood draw. That blood carries the answer to the most common question for cancer patients following surgery: Did they get it all?\n\nTake colorectal cancer. Roughly two-thirds of patients undergo surgery and that's it. They're cured. The remaining third have micro metastases — meaning the cancer has spread to other areas of the body. But the tumors aren't visible yet.\n\n\"Postsurgery, both the two-thirds of people who are cured by surgery and the one-third that need to follow up with chemo, they present the same way,\"Natera's Brophy said. \"It's hard to tell who is who, even though doctors and patients know full well a ton of people are going to get the chemo and don't need it.\"\n\nIt's a better-safe-than-sorry mentality. But these blood tests could change that.\n\nNatera has published data comparing patients who received chemotherapy after having their tumor surgically removed. Those who tested positive for circulating tumor DNA had a statistically significant benefit from chemo. Those who tested negative experienced no benefits from chemo.\n\nChemotherapy is expensive and often causes painful side effects, Brophy said.\n\n\"Now, you have this ability to triage these patients after surgery to see who really needs chemotherapy and who doesn't,\" he said.\n\nThe third use case is in monitoring patients who are actively receiving treatment.\n\nSome patients don't automatically undergo surgery. In breast cancer, for example, somewhere around half of patients first receive progressive rounds of chemotherapy in the hopes of shrinking the tumor. This will eventually allow them to receive a lumpectomy instead of a full mastectomy — removing a lump is generally preferable to removing the entire breast.\n\nBut when it comes to imaging, cancer often responds to aggressive treatment by appearing bigger.\n\nThe phenomenon is called pseudo-progression. The tumor isn't getting bigger because the cancer is worsening, says Personalis' Chen. It's enlarging because immune cells are going into the tumor to fight it. This is often the case when patients receive immuno-oncology drugs that help uncover camouflaged cancer cells.\n\n\"The blood-based tests don't have that issue,\" Susan Tousi, chief executive of DELFI Diagnostics, said in an interview. DELFI makes blood tests that screen people for cancer, a space closely tied to MRD testing. \"I think there are some benefits that allow for earlier detection and more robust detection of treatment response.\"\n\nThere arechallenges facing Guardant Health, Exact Sciences and Natera, however.\n\nAnd it already hasn't been easy for the trio.\n\nGuardant stock had an impressive run from October to January, surging almost 105%. Since then, shares have pulled back somewhat. They're still nowhere near their record high above 181 in early 2021. But Guardant stock has climbed more than 47% this year, as of the close on Thursday, outperforming Investor's Business Daily's Medical-Services industry group, which has risen a more moderate 2.5%. The group ranks 13th out of 197 groups IBD tracks.\n\nGuardant Health shares rank No. 21 on theIBD 50list of elite growth stocks.\n\nNatera belongs to the Medical-Research Equipment/Services industry group. Veracyte ranks first, leading Natera as the second top seed. Natera shares mostly fell from late 2021 to early 2022. But shares more than quadrupled through January of this year. On a year-to-date basis, Natera shares have fallen about 6.5%. The industry group, which ranks a poor No. 162, has tumbled a more precipitous 21%.\n\nExact Sciences stock has mostly fallen over the last few years, peaking in January 2021 above 159. Today, shares of the MRD testing company trade around 42. Exact shares dropped dramatically last November after the company missed third-quarter sales expectations and enacted an \"alarming\"guidance cut. This January, shares took a hit on competitive concerns facing itsstool-based colorectal cancer test, Cologuard.\n\nIt's important to note that all three companies work in tangential testing markets. Guardant is well known for its Shield test, which uses blood to screen for colorectal cancer in asymptomatic people. Exact sells Cologuard and is developing a multicancer early detect test called CancerGuard. Natera has numerous tests for cancer, women's health and organ health.\n\nNotably, none of these companies are profitable — which isn't exactly a rarity for companies in the biopharma space. But it's also not preferable for savvy investors. According to FactSet, analysts don't expect Exact Sciences to notch its first profits until 2026. Natera is expected to follow in 2027. But analysts don't expect earnings, on a strict, as-reported basis, for Guardant until 2030.\n\nGuardant Health estimates 12 million cancer survivors are more than five years out from their surgery. About 3 million of them don't have tissue samples available on which to build a personalized blood test.\n\nFor that reason, Natera just announced its new tissue-free MRD test. This test would scan for common mutations found in specific cancer types. So, it's not bespoke to a patient's individual cancer. The idea is to help patients who had surgery long ago, or those who can't undergo surgery.\n\nIt's less exact than Signatera, Natera's Brophy said. The tissue-free blood test catches about 86% of the cancers that Signatera finds.\n\nOther challenges include tumors that don't spill as much DNA into the bloodstream. Lung cancer has been a difficult target. These tumors are known as low-shedders. There are also cancers that have fewer mutations. Personalis' Chen says this is where the ultrasensitive approach pays off.\n\nNeXT screens for up to 1,800 mutations associated with cancer, compared with first-generation blood tests which look for 16 to 50 mutations, he said.\n\nBut Eltoukhy, Guardant Health's CEO, says the technology is only getting better.\n\n\"As the technology gets more sensitive, you get better at all of them,\" he said. \"You'll get really, really good at the high-shedding ones and, then, better at the low-shedding ones. You'll still have that differential, but you'll get better at all of them over time.\"\n\nThere's a huge market for blood tests to monitor for cancer relapse, says Eltoukhy. Though there are tools in place to monitor cancer survivors, it can be tricky to navigate the Byzantine health care system for which tool to use and when.\n\n\"There are some diseases where they may scan every six months, every three months in the first year, first two years. Others where it may be annual. It's been a sort of mishmash of different available tools, whatever seems to work best for that specific cancer type,\" he said. \"But the follow-on hasn't been, I would say, as set in stone and standardized as maybe treatment guidelines are for metastatic patients.\"\n\nInvestors should take into account the newness of the technology, combined with the growing rates of cancer diagnoses.\n\n\"It's huge and growing,\" Personalis' Chen said of the MRD testing market. \"I think we're only scratching the surface. It's still early days for MRD. It's a new technology. People are still getting used to what it can do.\"\n\nFollow Allison Gatlin on X/Twitter at@AGatlin_IBD.\n\nYOU MAY ALSO LIKE:\n\nWhy IBD 50's Top Seed, Hims & Hers, Just Crashed On Its Upbeat Earnings\n\nTempus AI Reverses 192% Run. Why At Least One Analyst Remains A Believer.\n\nFind The Best Long-Term Investments With IBD Long-Term Leaders\n\nRun Custom Stock Screens With MarketSurge\n\nLearn How To Time The Market With IBD's ETF Market Strategy\n\n4/14/2025Here are today’s top growth stocks that have just been added to the IBD stock lists, including the IBD 50,...\n\n4/14/2025Here are today’s top growth stocks that have just been...\n\nCompanies like Guardant Health and Exact Sciences are blazing new trails in the use of blood screening tech for cancer tests. (Madua/Shutterstock/Elizabeth Gessel)\n\nGet instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20!\n\nGet market updates, educational videos, webinars, and stock analysis.\n\nLearn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content.\n\nInformation in Investor’s Business Daily is for informational and educational purposes only and should not be construed as an offer, recommendation, solicitation, or rating to buy or sell securities. The information has been obtained from sources we believe to be reliable, but we make no guarantee as to its accuracy, timeliness, or suitability, including with respect to information that appears in closed captioning. Historical investment performances are no indication or guarantee of future success or performance. Authors/presenters may own the stocks they discuss. We make no representations or warranties regarding the advisability of investing in any particular securities or utilizing any specific investment strategies. Information is subject to change without notice. For information on use of our services, please see ourTerms of Use.\n\n*Real-time prices by Nasdaq Last Sale. Real-time quote and/or trade prices are not sourced from all markets. Ownership data provided by LSEG and Estimate data provided by FactSet.\n\nIBD, IBD Digital, IBD Live, IBD Weekly, Investor's Business Daily, Leaderboard, MarketDiem, MarketSurge and other marks are trademarks owned by Investor's Business Daily, LLC.\n\n©2025 Investor’s Business Daily, LLC. All Rights Reserved."
      },
      {
        "title": "The Blood Test Revolution Driving These Three Stocks",
        "author": "ALLISON GATLIN",
        "publication_date": "2025-04-17T20:15:06+00:00"
      }
    ],
    "authors": [
      "Allison Gatlin"
    ],
    "source": "Investor's Business Daily",
    "image_url": "https://www.investors.com/wp-content/uploads/2025/04/A1MAIN_blood_041925_Shutter.jpg",
    "url": "https://www.investors.com/news/technology/guardant-health-natera-exact-sciences-blood-tests-mrd-cancer-testing/"
  },
  "markdown_content": "## The Rise of Cancer Blood Testing\\n\\nA looming revolution in oncology could help the 18 million cancer survivors in the U.S. and bolster biotech stocks like Guardant Health, Natera and Exact Sciences.\\n\\nCancer rates are on the rise, particularly in young people. These companies are blazing trails in the use of blood tests to detect cancer relapses months sooner than traditional technology by looking for tumor DNA in the blood.\\n\\n## Market Potential\\n\\nThe MRD test market could be worth between $4.45 billion and $6.7 billion in the early 2030s, up from $2.2 billion in 2023. By 2040, the National Cancer Institute expects there will be 26 million cancer survivors in the U.S.\\n\\n## Technology Advances\\n\\nThese blood tests can detect a relapse an average of 15 months before imaging scans. Notable developments include:\\n\\n* Guardant's Reveal detects minimal residual disease in colorectal, breast and lung cancers\\n* Natera's Signatera can detect recurrent cancer around nine months before standard scans\\n* Exact Sciences' Oncodetect showed detection about 10.4 months earlier than imaging\\n\\n## Applications and Challenges\\n\\nThe tests serve multiple purposes:\\n- Monitoring for relapse\\n- Determining surgery success\\n- Tracking treatment effectiveness\\n\\nHowever, challenges remain, including profitability concerns and technical limitations with certain cancer types.\\n\\nDespite these challenges, the technology continues to improve. The market potential is significant, driven by growing cancer rates and the need for better monitoring tools.\\n\\n> \"It's huge and growing... we're only scratching the surface.\""
}