{
  "title": "India Ranks 156th Globally in Academic Freedom Index, Shows Significant Decline",
  "publication_date": "2024-03-19T00:00:00Z",
  "summary": "India's position on the Academic Freedom Index has deteriorated significantly, ranking 156th out of 179 countries in the 2025 update. The country's score dropped from 0.38 in 2022 to 0.16, placing it in the bottom 10-20% bracket globally. The report by V-Dem Institute identifies India among 34 countries experiencing substantial decline in academic freedom.",
  "content": "India has placed 156th among 179 countries in the 2025 Academic Freedom Index (AFI), according to the latest report by the V-Dem Institute. The country's score has declined from 0.38 in 2022 to 0.16, positioning it in the bottom 10-20% bracket globally.\n\nThe AFI evaluates countries based on multiple factors including freedom to research and teach, freedom of academic exchange and dissemination, institutional autonomy, campus integrity, and freedom of academic and cultural expression.\n\nThe V-Dem Institute's report indicates that electoral success of anti-pluralist parties is \"a potential driver of academic freedom decline.\" The report further states that \"drawing on data over a period of 50 years, we show that academic freedom is at risk when anti-pluralist parties reach government.\"\n\nIndia has been identified among 34 countries and territories that have experienced a statistically significant and substantial decline in academic freedom over the past decade.\n\nIn regional comparison, India performs only marginally better than China, which sits in the bottom 10% bracket. While Bangladesh shares India's bracket, other neighboring countries show better performance, with Pakistan, Nepal, and Bhutan in the top 30-40% bracket and Sri Lanka in the top 40-50%.",
  "category": "World",
  "tags": [
    "education",
    "academic freedom",
    "India",
    "global rankings",
    "democracy",
    "institutional autonomy",
    "research freedom"
  ],
  "location": "India",
  "source": {
    "title": "India in Bottom 10-20% Bracket on Academic Freedom Index, Ranks 156th Globally",
    "url": "https://m.thewire.in/article/education/india-in-bottom-10-20-bracket-on-academic-freedom-index-ranks-156th-globally/amp",
    "created_utc": 1744969932.0,
    "subreddit": "india",
    "media": [
      "https://external-preview.redd.it/nvBDFWSShJkL3wInFsnqsJxCeIqo6RER7ihW7rOH9rU.jpg?auto=webp&s=bba7dbeaa70d8f09655c3274e681dd72bb45fc35"
    ],
    "content": "In the 2025 update to the Academic Freedom Index, India ranked 156th of the 179 countries assessed in the report. Its score fell from 0.38 in 2022 to 0.16, putting it in the bottom 10-20% bracket.\n\nAFI, published by the V-Dem Institute, measures countries on the following factors: freedom to research and teach; freedom of academic exchange and dissemination; institutional autonomy; campus integrity; and freedom of academic and cultural expression.\n\nIn its latest report, the V-Dem Institute said that electoral success of anti-pluralist parties is “a potential driver of academic freedom decline”. “Drawing on data over a period of 50 years, we show that academic freedom is at risk when anti-pluralist parties reach government,” the report said.\n\nThe report identifies 34 countries and territories that experienced a “statistically significant and substantially meaningful decline in academic freedom compared to ten years ago”. India is among them.\n\nAmong its neighbours, India was among the worst performing countries measuring only above China in the bottom 10% bracket. While Bangladesh was in the same bracket as India, Pakistan, Nepal and Bhutan fell in the top 30-40% bracket and Sri Lanka in the top 40-50%."
  },
  "markdown_content": "## Global Rankings\\nIndia has placed 156th among 179 countries in the 2025 Academic Freedom Index (AFI), according to the latest report by the V-Dem Institute. The country's score has declined from 0.38 in 2022 to 0.16, positioning it in the bottom 10-20% bracket globally.\\n\\n## Assessment Criteria\\nThe AFI evaluates countries based on multiple factors including:\\n* Freedom to research and teach\\n* Freedom of academic exchange and dissemination\\n* Institutional autonomy\\n* Campus integrity\\n* Freedom of academic and cultural expression\\n\\n## Key Findings\\n> Drawing on data over a period of 50 years, we show that academic freedom is at risk when anti-pluralist parties reach government.\\n\\nThe V-Dem Institute's report indicates that electoral success of anti-pluralist parties is \"a potential driver of academic freedom decline.\"\\n\\nIndia has been identified among 34 countries and territories that have experienced a statistically significant and substantial decline in academic freedom over the past decade.\\n\\n## Regional Comparison\\nIn regional comparison, India performs only marginally better than China, which sits in the bottom 10% bracket. While Bangladesh shares India's bracket, other neighboring countries show better performance:\\n* Pakistan, Nepal, and Bhutan in the top 30-40% bracket\\n* Sri Lanka in the top 40-50%"
}