{
  "title": "Double whammy: Bengaluru airport cab crunch deepens as BluSmart, Refex pull out",
  "publication_date": "2024-03-17T00:00:00Z",
  "summary": "Passengers at Bengaluru's Kempegowda International Airport face increased transportation challenges as two electric cab operators, BluSmart and Refex eVeelz, cease operations. BluSmart has stopped accepting new bookings following a SEBI probe into Gensol Engineering, while Refex is phasing out its airport-based EV taxi services to focus on enterprise clients.",
  "content": "Passengers using Kempegowda International Airport (KIA) in Bengaluru, already grappling with a shortage of Ola and Uber cabs, are now facing a double-whammy as two electric cab operators—BluSmart and Refex eVeelz—have ceased operations.\n\nBluSmart, a ride-hailing startup linked to Gensol Engineering, has abruptly stopped accepting new ride bookings across major parts of Delhi-NCR, Mumbai, and Bengaluru. This move follows a probe by the Securities and Exchange Board of India (SEBI) into Gensol Engineering, raising serious questions about BluSmart's viability.\n\nRefex Green Mobility Ltd (RGML), a subsidiary of Refex Industries, has confirmed that it is streamlining its operations in Bengaluru by phasing out its airport-based EV taxi services. These services were run via Refex EV Fleet Services.\n\nKempegowda International Airport handled 41.88 million travellers in the last financial year, up from 37.53 million the previous year—an 11.6 percent increase. Despite this growth, the availability of airport cabs continues to be a challenge, with frequent complaints of long waits and inadequate fleets at the designated Ola-Uber pick-up zones.\n\nSources said the exit of both Refex and BluSmart is likely to compound the shortage. BIAL had previously ended partnerships with earlier operators like Meru and Mega in favour of Refex. Now, with both Refex and BluSmart halting operations, it's causing significant inconvenience to passengers.\n\nPassengers can still book rides through Ola, Uber, Karnataka State Tourism Development Corporation (KSTDC), WTi rental cabs, as well as BMTC's Vayu Vajra and KSRTC's inter-city Flybus services.",
  "category": "Business",
  "tags": [
    "transportation",
    "electric vehicles",
    "airport services",
    "startups",
    "ride-hailing",
    "Bengaluru"
  ],
  "location": "Bengaluru, India",
  "source": {
    "title": "Happy birthday Chiyaan Vikram: Do you know what his real name is?",
    "publication_date": 1744837202,
    "content": [
      {
        "title": "Double whammy: Bengaluru airport cab crunch deepens as BluSmart, Refex pull out",
        "publication_date": "Unknown",
        "content": "Passengers using Kempegowda International Airport (KIA) in Bengaluru, already grappling with a shortage of Ola and Uber cabs, are now facing a double-whammy as two electric cab operators—BluSmart and Refex eVeelz—have ceased operations.\n\nBluSmart, a ride-hailing startup linked to Gensol Engineering, has abruptly stopped accepting new ride bookings across major parts of Delhi-NCR, Mumbai, and Bengaluru. This move follows a probe by the Securities and Exchange Board of India (SEBI) into Gensol Engineering, raising serious questions about BluSmart’s viability.\n\nAlso read:Gensol crisis: BluSmart suspends cab bookings via app in parts of NCR, Mumbai and Bengaluru\n\nMeanwhile, Refex Green Mobility Ltd (RGML), a subsidiary of Refex Industries, has confirmed that it is streamlining its operations in Bengaluru by phasing out its airport-based EV taxi services. These services were run via Refex EV Fleet Services. “The move aims to focus on scaling electric mobility solutions for enterprise and institutional clients through long-term partnerships and stable demand,” the company said.\n\nInterestingly, both Refex and BluSmart have a linkage. Earlier this year, Refex Green Mobility had announced a Rs 315 crore deal to acquire 2,997 electric vehicles from Gensol Engineering, with plans to lease them to BluSmart. However, Refex later withdrew the proposal, citing “evolving commitments” on both sides.\n\nAlso read:Refex Green withdraws plan to takeover Gensol's 3,000 EVs, cites 'challenges' to conclude deal\n\nTravellers hit\n\nKempegowda International Airport handled 41.88 million travellers in the last financial year, up from 37.53 million the previous year—an 11.6 percent increase. Despite this growth, the availability of airport cabs continues to be a challenge, with frequent complaints of long waits and inadequate fleets at the designated Ola-Uber pick-up zones.\n\nBangalore International Airport Ltd (BIAL), which operates KIA, was unavailable to comment.\n\nAlso read:BluSmart takes on Uber, Ola, launches cab pickup zone at Bengaluru airport\n\nSources said the exit of both Refex and BluSmart is likely to compound the shortage. “BIAL tied up with Refex and commenced services in June 2024. They had also introduced pink taxis driven by women, exclusively for female passengers. BIAL had ended partnerships with earlier operators like Meru and Mega in favour of Refex. Now, with both Refex and BluSmart halting operations, it’s causing inconvenience to passengers,” a source said.\n\nAnother source added that airport taxis operated through BIAL’s official 'BLR Pulse' mobile application were mostly linked to Refex, which had a 100 percent electric fleet. \"Many passengers who couldn't find cabs via Ola and Uber relied on BluSmart and Refex, and are now the most affected. These services were also environmentally friendly,\" the source added.\n\nIn March 2023, BluSmart Mobility launched a dedicated cab pickup zone at Bengaluru airport, following Ola and Uber. Other aggregators like Rapido, Namma Yatri, QuickRide and Shoffr do not have a dedicated pickup zone at the airport. However, dedicated airport taxi services such as Refex and KSTDC are allowed to pick up passengers directly in front of the terminals.\n\nHowever, a BIAL official said that passengers can continue to book rides through Ola, Uber, Karnataka State Tourism Development Corporation (KSTDC), WTi rental cabs, as well as BMTC’s Vayu Vajra and KSRTC’s inter-city Flybus services.\n\nIn a statement, Refex said: “Refex continues to offer high-quality mobility services through its integrated B2B and B2B2C EV platform, featuring company-owned EVs, trained driver partners, and a tech-driven operations framework. Since its launch in March 2023 with 24 vehicles, Refex’s Green Mobility vertical has grown to nearly 1,300 EVs. We serve Bengaluru, Chennai, Hyderabad, and Mumbai across use cases such as employee transport, corporate rentals, airport transfers, and partnerships with leading ride-hailing platforms.”\n\nAlso read:Bengaluru airport launches electric taxis for passengers\n\nDiscover the latestBusiness News,Budget 2025 News,Sensex, andNiftyupdates. ObtainPersonal Financeinsights, tax queries, and expert opinions onMoneycontrolor download theMoneycontrol Appto stay updated!\n\nStock Market HolidayInfosys LayoffsGST on UPI Payments 2000US China Trade WarIndian RupeeWipro HiringShine Tom ChackoUBSE UK Result 2025Good Friday ImagesIPL Points Table 2025\n\nBusinessMarketsStocksIndia NewsCity NewsEconomyMutual FundsPersonal FinanceIPO NewsStartups\n\nHomeCurrenciesCommoditiesPre-MarketIPOGlobal MarketBonds\n\nHomeLoans up to 50 LakhsCredit Cards Lifetime FreeFinance TrackerNewFixed DepositsFixed Deposit ComparisonFixed Income\n\nHomeMC 30Top Ranked FundsETFsMutual Fund Screener\n\nIncome Tax CalculatorEMI CalculatorRetirement PlanningGratuity Calculator\n\nStock Markets\n\nNews18FirstpostCNBC TV18News18 HindiCricketnextOverdriveTopper Learning\n\nAbout UsContact UsAdvisory AlertAdvertise with UsSupportDisclaimerPrivacy PolicyCookie PolicyTerms & ConditionsFinancial Terms (Glossary)SitemapInvestors\n\nCopyright © Network18 Media & Investments Limited. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form or medium without express written permission of moneycontrol.com is prohibited.\n\nYou are already a Moneycontrol Pro user."
      },
      {
        "title": "Double whammy: Bengaluru airport cab crunch deepens as BluSmart, Refex pull out",
        "author": "Unknown Author",
        "publication_date": "Unknown"
      }
    ],
    "authors": [],
    "source": "Moneycontrol",
    "image_url": "https://images.moneycontrol.com/static-mcnews/2025/04/20250416174714_Chiyaan-Vikram.jpg?impolicy=website&width=1600&height=900",
    "url": "https://www.moneycontrol.com/entertainment/happy-birthday-chiyaan-vikram-do-you-know-what-his-real-name-is-article-12996830.html"
  },
  "markdown_content": "## Service Disruption\\nPassengers using Kempegowda International Airport (KIA) in Bengaluru, already grappling with a shortage of Ola and Uber cabs, are now facing a double-whammy as two electric cab operators—BluSmart and Refex eVeelz—have ceased operations.\\n\\n## Operator Details\\nBluSmart, a ride-hailing startup linked to Gensol Engineering, has abruptly stopped accepting new ride bookings across major parts of Delhi-NCR, Mumbai, and Bengaluru. This move follows a probe by the Securities and Exchange Board of India (SEBI) into Gensol Engineering, raising serious questions about BluSmart's viability.\\n\\nRefex Green Mobility Ltd (RGML), a subsidiary of Refex Industries, has confirmed that it is streamlining its operations in Bengaluru by phasing out its airport-based EV taxi services. These services were run via Refex EV Fleet Services.\\n\\n## Airport Traffic\\nKempegowda International Airport handled 41.88 million travellers in the last financial year, up from 37.53 million the previous year—an 11.6 percent increase. Despite this growth, the availability of airport cabs continues to be a challenge, with frequent complaints of long waits and inadequate fleets at the designated Ola-Uber pick-up zones.\\n\\n## Impact\\nSources said the exit of both Refex and BluSmart is likely to compound the shortage. BIAL had previously ended partnerships with earlier operators like Meru and Mega in favour of Refex. Now, with both Refex and BluSmart halting operations, it's causing significant inconvenience to passengers.\\n\\n## Available Alternatives\\nPassengers can still book rides through:\\n* Ola\\n* Uber\\n* Karnataka State Tourism Development Corporation (KSTDC)\\n* WTi rental cabs\\n* BMTC's Vayu Vajra\\n* KSRTC's inter-city Flybus services"
}