{
  "title": "Combination of Low-Cost Drugs Could Save Lives After Heart Attack",
  "publication_date": "2025-04-01T00:00:00Z",
  "summary": "Swedish research shows that combining ezetimibe with statin therapy within 12 weeks after a heart attack significantly reduces cardiovascular complications and deaths. The study analyzed over 35,000 patients and found that early combination therapy led to better outcomes and higher achievement of LDL cholesterol targets compared to delayed or no ezetimibe treatment.",
  "content": "New research from Sweden suggests that starting a second cholesterol-lowering drug soon after a heart attack may help save lives.\n\nAccording to the study, published in the Journal of the American College of Cardiology, people who received ezetimibe with their statin therapy within 12 weeks of a heart attack had fewer heart-related complications and deaths than those who waited longer or never added ezetimibe at all.\n\nThe researchers analyzed data from more than 35,000 patients hospitalized for heart attacks between 2015 and 2022, using the SWEDEHEART registry in Sweden. Most patients were prescribed high-intensity statins at discharge, with some beginning ezetimibe within the first 12 weeks after discharge.\n\nResults showed that patients who started ezetimibe early in combination with statins had a significantly lower risk of major adverse cardiovascular events (MACE), including death, another heart attack, or stroke. One-year incidence rates of MACE were 1.79 per 100 patient-years in the early ezetimibe group, compared with 2.58 in the late group and 4.03 in those without ezetimibe.\n\nThe study underscores that a stepwise approach inevitably delays optimal cholesterol lowering and is associated with avoidable harm. Approximately 75-80% of post-heart attack patients fail to reach LDL goals with statin therapy alone; initiating combination therapy early can improve outcomes and reduce future cardiovascular events.\n\nExperts recommend that care pathways for heart attack patients should be updated to implement early combination therapy with statins and ezetimibe as standard care, potentially even before hospital discharge.",
  "category": "Health",
  "tags": [
    "heart attack",
    "cardiovascular health",
    "medical research",
    "cholesterol",
    "pharmaceuticals",
    "healthcare",
    "medical treatments"
  ],
  "location": "Sweden",
  "source": {
    "title": "Combination of Low-Cost Drugs Could Save Lives After Heart Attack",
    "publication_date": 1744973491,
    "content": [
      {
        "title": "Combination of Low-Cost Drugs Could Save Lives After Heart Attack",
        "publication_date": "Unknown",
        "content": "Bezzy communities provide meaningful connections with others living with chronic conditions. Join Bezzy on the web or mobile app.\n\nCan't get enough? Connect with us for all things health.\n\nNew research from Sweden suggests that starting a second cholesterol-lowering drug soon after a heart attack may help save lives.\n\nAccording to the study, published in the April 2025 issue of theJournal of the American College of Cardiology, people who receivedezetimibe (brand name Zetia)with their statin therapy within 12 weeks of a heart attack had fewer heart-related complications and deaths than those who waited longer or never added ezetimibe at all.\n\nTheNational Library of Medicineexplains that ezetimibe helps reduce the amount of low-density lipoprotein (LDL) cholesterol in your blood by preventing cholesterol from being absorbed in the small intestine.\n\nLDL cholesterolis the so-called “bad” cholesterol associated with clogged arteries and an increased risk of cardiovascular diseases such asheart attackandstroke.\n\nEzetimibe is sometimes prescribed for people who can’t tolerate statins. It may also be used as an add-on treatment when statins do not sufficiently lower cholesterol.\n\nThis medication works differently fromstatins, which exert their cholesterol-lowering effects by slowing down the liver’s production of the waxy substance.\n\nTo arrive at their conclusion, the researchers analyzed data from more than 35,000 patients hospitalized forheart attacks (myocardial infarction)between 2015 and 2022, using the comprehensive SWEDEHEART registry in Sweden.\n\nMost patients were prescribed high-intensity statins at discharge, but a subset also began taking a second medication, ezetimibe, within the first 12 weeks after discharge.\n\nThe study categorized patients into three groups: those who started ezetimibe early (within 12 weeks), those who started late (13 weeks to 16 months after discharge), and those who never received ezetimibe during this period.\n\nImportantly, the analysis used advanced statistical methods — specifically, a clone-censor-weight framework — to emulate a randomized clinical trial and minimize biases\n\nResults showed that patients who started ezetimibe early in combination with statins had a significantly lower risk of major adverse cardiovascular events (MACE), which include death, another heart attack, or stroke, compared to those who delayed ezetimibe or never took it.\n\nOne-year incidence rates of MACE were 1.79 per 100 patient-years in the early ezetimibe group, compared with 2.58 in the late group and 4.03 in those without ezetimibe.\n\nAt three years, the hazard ratio for MACE was 1.14 for late versus early treatment (not statistically significant) but was 1.29 for no ezetimibe versus early treatment, indicating substantially higher risk without ezetimibe.\n\nCardiovascular death was also significantly higher in the late and no ezetimibe groups compared to early treatment.\n\nAdditionally, early combination therapy led to a greater proportion of patients achieving guideline-recommended LDL cholesterol targets (<1.4 mmol/L or <55 mg/dL) within one year.\n\nThe study underscores that a stepwise approach — starting with statins and adding ezetimibe only if LDL cholesterol goals are not met — inevitably delays optimal cholesterol lowering and is associated with avoidable harm.\n\nAs the authors note, approximately 75–80% of post-heart attack patients fail to reach LDL goals with statin therapy alone; initiating combination therapy early can improve outcomes and reduce future cardiovascular events.\n\nTo maximize protection, the researchers advocate that care pathways for heart attack patients should be updated to implement early combination therapy with statins and ezetimibe as standard care, potentially even before hospital discharge.\n\nArun Manmadhan, MD, assistant professor of cardiology at Columbia University Irving Medical Center, who was not involved with the study, said the findings align with a broader body of research showing that sustained, low LDL cholesterol levels are associated with fewer heart attacks and strokes.\n\n“This is even more important in people who have already experienced one of these events,” he said, “because lowering the cholesterol levels, in addition to optimizing other cardiac risk factors, is one of the most effective and proven ways to prevent a second event.”\n\nManmadhan said that, in his opinion, this study adds to the evidence that patients who have had a heart attack or stroke should have their cholesterol levels aggressively managed, both through lifestyle and medications.\n\n“This study suggests that time is also an important factor,” he added. “[The] earlier and faster cholesterol levels are aggressively controlled to recommended levels after a heart attack, the better it is for preventing future cardiovascular events.”\n\nMarkyia Nichols, MD, MPH, RDN, a CDC-certified lifestyle coach and chief medical officer at Ciba Health, said patients should know that “cholesterol isn’t the enemy.”\n\n“It’s a response,” she explained. “Cholesterol is essential for life. It builds hormones, stabilizes cells, and repairs tissue. If cholesterol is rising, it’s critical to ask what the body is trying to repair or protect against.”\n\nAccording to Nichols, inflammation is the real problem, not cholesterol. A diet high in sugar, processed seed oils, and ultra-processed foods, insulin resistance, metabolic dysfunction, chronic stress, and exposure to toxins can all factor into creating inflammation.\n\n“Once the heart lining is damaged, the body sends cholesterol as a patch,” she said. “Cholesterol doesn’t cause the ‘fire.’ It acts more like the ‘firefighters.'”\n\nNichols added that, digging deeper, LDL only becomes dangerous when it’s oxidized due to poor nutrition.\n\nCircling back to the study, she told Healthline that while adding ezetimibe to statins post-early heart attack may lower cholesterol, it’s not addressing the root causes of the problem. Patients also need to focus on nutrition.\n\n“Ask for labwork that tests levels of magnesium, omega-3s, vitamin D, and vitamin K2,” she advised. “You can’t rebuild a healthy heart without healthy raw materials.”\n\nShe also suggests looking to see whether your markers of inflammation, such as C-reactive protein, homocysteine, and insulin, are high.\n\nFurther, look for any sources of inflammation you might have, like a poor diet, stress, toxins, or an unhealthy gut.\n\nNichols concluded by saying that you may need to see a board-certified doctor trained in root-cause medicine to determine what’s causing your inflammation.\n\nHowever, addressing this can help you heal the underlying causes of your high cholesterol.\n\nShare this article\n\nA new study suggests that certain cardiovascular risk factors could significantly impact females more than males. Taking biological sex into account…\n\nA new study found an increased risk of cardiovascular events in people with irregular sleep patterns, even when they got the recommended amount of…\n\nA new American Heart Association statement emphasizes the link between heart disease and cognitive decline. Prioritizing your heart health from…\n\nPets often bring us joy, but they may be also be protecting us against cardiovascular events like heart attack and stroke. Learn what the research…\n\nNew research suggests common ADHD medications are linked to small increases in measures of cardiac health like blood pressure and pulse. Experts say…\n\nNew research shows that \"weekend warriors\" who exercise just one or two days per week have a lower risk of death than regular exercisers. Experts…\n\nA retrospective study found that cannabis users were six times as likely to have a heart attack compared to non-users, while a large meta-analysis of…\n\nSome research has explored the relationship between intermittent fasting, heart health, and heart disease. Learn more here.\n\nHere are some do's and don'ts to pay attention to as you learn how to effectively manage your diabetes with insulin.\n\nInsomnia makes it difficult for you to fall asleep, stay asleep, or both. Get information on risk factors, symptoms, tests, treatments, and home…\n\nOUR BRANDS"
      },
      {
        "title": "Combination of Low-Cost Drugs Could Save Lives After Heart Attack",
        "author": "Unknown Author",
        "publication_date": "Unknown"
      }
    ],
    "authors": [
      "Nancy Schimelpfening"
    ],
    "source": "Healthline",
    "image_url": "https://media.post.rvohealth.io/wp-content/uploads/2025/04/surgery-prepping-1296x728-header-1296x729.jpg",
    "url": "https://www.healthline.com/health-news/combination-low-cost-drugs-heart-attack-prevention"
  },
  "markdown_content": "## Study Findings\\n\\nNew research from Sweden suggests that starting a second cholesterol-lowering drug soon after a heart attack may help save lives.\\n\\nAccording to the study, published in the Journal of the American College of Cardiology, people who received ezetimibe with their statin therapy within 12 weeks of a heart attack had fewer heart-related complications and deaths than those who waited longer or never added ezetimibe at all.\\n\\n## Research Details\\n\\nThe researchers analyzed data from more than 35,000 patients hospitalized for heart attacks between 2015 and 2022, using the SWEDEHEART registry in Sweden. Most patients were prescribed high-intensity statins at discharge, with some beginning ezetimibe within the first 12 weeks after discharge.\\n\\n## Key Results\\n\\nResults showed that patients who started ezetimibe early in combination with statins had a significantly lower risk of major adverse cardiovascular events (MACE), including death, another heart attack, or stroke. One-year incidence rates of MACE were:\\n\\n* 1.79 per 100 patient-years in the early ezetimibe group\\n* 2.58 in the late group\\n* 4.03 in those without ezetimibe\\n\\n## Clinical Implications\\n\\nThe study underscores that a stepwise approach inevitably delays optimal cholesterol lowering and is associated with avoidable harm. Approximately 75-80% of post-heart attack patients fail to reach LDL goals with statin therapy alone; initiating combination therapy early can improve outcomes and reduce future cardiovascular events.\\n\\nExperts recommend that care pathways for heart attack patients should be updated to implement early combination therapy with statins and ezetimibe as standard care, potentially even before hospital discharge."
}