{
  "title": "Illustrators launch fightback against AI dolls with #StarterPackNoAI trend",
  "publication_date": "2025-04-17T07:45:00+01:00",
  "summary": "Illustrators are pushing back against AI-generated doll images flooding social media with a new movement tagged #StarterPackNoAI. Artists are creating hand-drawn alternatives to celebrate human creativity and protest against AI's environmental impact, copyright issues, and devaluation of artistic skills. The trend has gained momentum with hundreds of artists sharing unique interpretations that showcase individual style and personality, unlike the uniform AI-generated images.",
  "content": "As AI-generated dolls flood social media, illustrators are reclaiming creative spaces with hand-drawn alternatives that celebrate human artistry. The trend began when people discovered they could generate plastic-looking, packaged versions of themselves using ChatGPT's image generator, quickly saturating platforms like LinkedIn, Instagram, and Facebook.\n\nMany illustrators and creative professionals have expressed concerns about AI image generation's environmental impact, copyright issues, and devaluation of human artistic skills. In response, they launched the #StarterPackNoAI movement, creating unique hand-drawn interpretations of themselves as packaged dolls.\n\nUnlike the uniformity of AI-generated images, each #StarterPackNoAI creation showcases the artist's unique style, personality, and creative vision. Artists like Lizzie Knott emphasize the importance of amplifying human work, while others like Rosie Wilson point to the emotional dimension missing in AI creations.\n\nThe movement has fostered a sense of community among artists facing an uncertain future with AI image generators. Many participants view their work as both creative expression and protest against the perceived theft of artistic techniques. The trend has also sparked discussions about AI's environmental impact, with hand-drawn alternatives being seen as more sustainable.\n\nArtists like Laura Soto Salazar emphasize that while AI might be valuable for certain applications, it cannot replace art born from lived experience, emotion, and human struggle. The movement continues to grow, demonstrating the irreplaceable value of human creativity in the age of generative AI.",
  "category": "Technology",
  "tags": [
    "artificial intelligence",
    "art",
    "social media",
    "illustration",
    "digital art",
    "creative industry",
    "environmental impact",
    "protest movement"
  ],
  "location": "unknown",
  "source": {
    "title": "Illustrators launch fightback against AI dolls with #StarterPackNoAI trend",
    "publication_date": 1744852500,
    "content": [
      {
        "title": "Illustrators launch fightback against AI dolls with #StarterPackNoAI trend",
        "publication_date": "2025-04-17T07:45:00+01:00",
        "content": "As AI-generated dolls flood social media, illustrators are reclaiming our creative spaces with hand-drawn alternatives that celebrate human artistry instead.\n\nAs AI-generated dolls flood social media, illustrators are reclaiming our creative spaces with hand-drawn alternatives that celebrate human artistry instead.\n\nIllustration bySunny Wu\n\nIf you've glanced at social media recently, you've probably seen a bizarre trend of people making images of action figures and dolls of themselves using ChatGPT's image generator. These digital creations—which depict you as a plastic-packaged toy, complete with accessories—have gone viral across platforms, with brands and marketers eagerly jumping on the bandwagon.\n\nBut not everyone is a fan of AI. Consequently, a counter-movement has emerged from the creative community, hashtagged #StarterPackNoAI, that involves artists creating their own hand-drawn interpretations to champion human creativity.\n\nWe chatted with some of them to learn what inspired them to join the movement and what it says about the current state of the creative industry. We share some of the best insights below, while you can read the full discussions onLinkedIn,Threadsand our own free-to-join networking platform,The Studio.\n\nThe original AI doll trend gained traction when people discovered they could upload selfies to ChatGPT and generate plastic-looking, packaged versions of themselves. The results—typically resembling action figures in blister packs or Barbie-style boxes—quickly saturated platforms such as LinkedIn before spreading to Instagram, Facebook and beyond.\n\nWhile many find the novelty entertaining, many illustrators and creative professionals aren't happy about the environmental impact of AI image generation, copyright issues and the devaluing of human artistic skills.\n\nIllustrator and graphic designerLizzie Knottshares her motivation for joining the #StarterPackNoAI movement. \"I find it SO important to amplify the work of real-life humans, as opposed to tapping into AI and the harmful energy it generates,\" she reasons. \"It's been really disappointing seeing which companies are using AI to create these starter packs when it took me less energy than AI uses to create something unique and personal.\"\n\nIllustration byJemma Bannocks. \"I’m primarily a photographer and I’m seeing the negative impact that AI is having on media literacy,\" she says. \"This also extends into photography. I’m also disheartened to see AI being “allowed” in photography exhibitions and prizes. Which is why I wanted to join in. Illustrating is a creative outlet for me that’s more lighthearted than my photography practice, so it felt right to put it in that medium. It’s incredibly upsetting to see AI being used to cut costs and push out creatives.\"\n\nIllustration byAdrianne Walujo. \"\"To me, people are crazy about AI art as it looks like a new, shiny toy that everyone wants to try,\" says Adrianne. \"But that’s it. However, human art is the only kind of art that speaks to the heart, it moves people to pick up their pens and we spent hours to create these works that we posted. AI art is meant for consumption, but human art inspires to create.\"\n\nIllustration byCaroline Murphy. \"I wanted to create my own version of the doll starter pack because generative AI is so awful for the environment,\" says Caroline. \"Not to mention everyone’s dolls all looked the same with no room for individuality or creativity! It has been so lovely to see artists make their own version of the trend and I had to be part of it.\"\n\nThe illustrator-led response has quickly gained momentum, with hundreds of artists sharing their hand-drawn interpretations. Unlike the uniformity of AI-generated images, which quickly get boring to look at, each #StarterPackNoAI creation showcases the artist's unique style, personality, and creative vision.\n\nFor many artists, the trend represents more than just creative expression—it's about highlighting the value of human artistry in an increasingly AI-driven world. Illustrator and designerRosie Wilsonpoints to the emotional dimension of this work. \"The AI figurines can feel a little soulless, whereas all the illustrated, handmade versions are full of character, life, and a genuine way to see into someone's personality,\" she explains. \"Even if you can't draw, a hand-drawn stick man with arrows still feels way more fun!\"\n\nThis sentiment is echoed by illustrator and picture book makerFrancesca Grech. \"I think what makes the handmade ones stand out from the AI ones is the personality you can clearly see in every artwork created,\" she observes. \"I mean, the AI ones just look the same; where's the fun in that? It's so easy to get in touch with an artist—collaborate and work with them to create something unique!\"\n\nThe movement has fostered a sense of community among artists facing an uncertain future with AI image generators. IllustratorPenny Fournierdescribes it as \"a really sweet trend that highlights everyone's individuality and quirks. It's too bad that people, and especially brands, are turning to AI to emulate this; they're turning a bonding moment into a publicity stunt. As artists, it's important to continue creating and fostering community, even when the overuse of AI makes it challenging.\"\n\nIllustration byTim Easley. \"I'm not actually mad at the ChatGPT versions,\" says Tim. \"But I really love seeing the different interpretations of the same idea in so many styles and flavours by other artists. It's a great reminder that there's so much talent out there and that everyone has their unique way of interpreting an idea!\"\n\nIllustration byTete Garcia. 'After seeing one too many impersonal AI Starter Packs on my feed, I started to get very annoyed by it,\" says Tete. \"I decided to have a go at my own Starter Pack, after seeing some from fellow illustrators, and now they are full of style, personality, and a whole lot of human touch; tears included.\"\n\nIllustration byClara Dupré. \"The smooth image of GPT dolls doesn't begin to describe the many personalities that make up our wonderful planet,\" says Clara. \"It's so nice to discover what makes us different through the unique styles of all the artists.\"\n\nFellow illustratorHolly Farndellhas found the trend inspirational. \"Seeing the creative community bond over something that does and will affect us all is really heartwarming,\" she enthuses. \"There are so many different styles and interpretations, so much genuine craft, and so much consideration over what would make up people's 'starter pack': their favourite outfits, food and medium to work in. Just one image taught me so much about people I've followed for years and what makes them, them.\"\n\nIn contrast, illustrator and animatorGraeme Dalyexpresses frustration with the uniformity of AI-generated images: \"It's so odd when you look the trend up on Instagram and see thousands of these little figurines stuck in plastic that all look the same. Nobody else is like you on this planet, so why would you want to be amongst this sea of all the same output?\"\n\nFor some illustrators, creating their own starter pack serves as a form of protest against the perceived theft of artistic techniques. As illustrator and surface pattern designerCarrie Cantwellexplains: \"The viral AI trends are cheapening art. First, we had the Ghibli one—which was just outright theft and totally wrong—then I got whiplash with the action figure one. It all made me feel so uneasy. Like many AI fads on social media, it's just another example of everyone submitting a photo, hitting a button and magically ending up with 'art'.\"\n\nCreative designer and illustratorCourtney Summer Myersoffers perhaps the most succinct perspective on the situation: \"If you can't create something yourself, then you should pay someone fairly to do it for you. If you can't do that, then don't do it at all.\"\n\nIllustration byHello Vonnie\n\nIllustration byGaetan Sahsah. \"It was amazing to see so many illustrators jump in and show just how much more creative, playful, and unique we are compared to a generic AI prompt that anyone can copy-paste,\" says Gaetan. \"It sparked something real in me—like, ‘Damn, this is cool. I want to make one too!’ And honestly, that’s the exact reason I am an illustrator in the first place—seeing cool drawings just makes me want to draw!\"\n\nThe #StarterPackNoAI trend has also sparked conversations about the environmental impact of AI image generation. With growing awareness that AI systems like ChatGPT consume enormous amounts of energy, participants see hand-drawn alternatives as more sustainable.\n\nVisual communication and interactive design student.Alice Jones Fjordsidehighlights how the two approaches differ in impact: \"The first [AI-generated image] you see is fun, but after that, it's just not that interesting. In contrast, I've found it really fun to see every single handmade illustration in the trend. Even when the characters have accessories meant to reflect the 'doll's' personality, most of the AI-generated ones feel pretty devoid of actual personality. And this is where actual illustrations and illustrators shine; their work is always infused with a bit of the creator's own personality.\"\n\nAs the #StarterPackNoAI movement continues to grow, it represents a creative and constructive response to the challenges facing artists in the age of generative AI. Rather than simply criticising the technology, illustrators are demonstrating the irreplaceable value of human creativity through their work—showing that while AI may imitate, it cannot replicate the distinctive touch of an artist's hand or the authentic expression of human experience.\n\nIllustration byMerle Goll\n\nIllustration byShenequa Johnson\n\nGraphic designer and content creatorCallum McHughperhaps captures the sentiment best: \"This is so great to see,\" he enthuses. \"The plastic AI figures truly was a low point, so to see this reaction from artists is VERY healing.\"\n\nFinally, designer and illustratorLaura Soto Salazarsums it up perfectly: \"I created this illustration as my way of reclaiming space, a direct response to what I see as a dangerous erosion of human creativity and the serious environmental cost of large-scale AI systems. Systems that were built by absorbing the life's work of real artists, writers, photographers who spent years developing their voice, their style and they were never asked, compensated or credited. The result? The machine spits out content, but not art. A mass-produced, sterile, hollow echo. No story in its bones. No hands that shook while making it. Just the surface, with the soul stripped out.\"\n\nIllustration byLaura Soto Salazar.\n\nShe adds, \"I believe AI can be incredible if used to save lives, clean the oceans or help us with tasks that drain us of our humanity. But when it’s used to replace art born of lived experience, emotion, struggle, joy… it crosses a line. What makes human-made art irreplaceable is exactly what I've poured into this work: vulnerability, grief, humour and the raw process of healing.\n\n\"Right now, I am going through a complicated situation (to say the least), including losing my health, my job and nearly my life. So I needed to laugh, to create and to show up for myself. This piece is about survival and no algorithm can fake that. So hey, support human-made art. Because robots don’t have rent, or brain scans.\" Amen to that.\n\nGet the best of Creative Boom delivered to your inbox weekly\n\nCreative Boom empowers and uplifts the creative community. Since 2009, we've been delivering the best in creativity through news, inspiration, insights, and advice to help you stand out and succeed in a competitive industry.\n\nCreative Boom™ © 2025 Creative Boom Ltd. Registered in England and Wales #07437294."
      },
      {
        "title": "Illustrators launch fightback against AI dolls with #StarterPackNoAI trend",
        "author": "Unknown Author",
        "publication_date": "2025-04-17T07:45:00+01:00"
      }
    ],
    "authors": [
      "Tom May"
    ],
    "source": "Creative Boom",
    "image_url": "https://www.creativeboom.com/upload/articles/3b/3baafceb44e4f49cdf49902a478fd4a8d7720d29_1280.jpg",
    "url": "https://www.creativeboom.com/inspiration/illustrators-spearhead-fightback-against-ai-dolls-with-starterpacknoai-trend/"
  },
  "markdown_content": "## The Rise of Human Art in Response to AI\\nAs AI-generated dolls flood social media, illustrators are reclaiming creative spaces with hand-drawn alternatives that celebrate human artistry. The trend began when people discovered they could generate plastic-looking, packaged versions of themselves using ChatGPT's image generator, quickly saturating platforms like LinkedIn, Instagram, and Facebook.\\n\\n## Artist Concerns and Response\\nMany illustrators and creative professionals have expressed concerns about AI image generation's environmental impact, copyright issues, and devaluation of human artistic skills. In response, they launched the #StarterPackNoAI movement, creating unique hand-drawn interpretations of themselves as packaged dolls.\\n\\nUnlike the uniformity of AI-generated images, each #StarterPackNoAI creation showcases the artist's unique style, personality, and creative vision. Artists like Lizzie Knott emphasize the importance of amplifying human work, while others like Rosie Wilson point to the emotional dimension missing in AI creations.\\n\\n## Community Impact\\nThe movement has fostered a sense of community among artists facing an uncertain future with AI image generators. Many participants view their work as both creative expression and protest against the perceived theft of artistic techniques. The trend has also sparked discussions about AI's environmental impact, with hand-drawn alternatives being seen as more sustainable.\\n\\n> While AI might be valuable for certain applications, it cannot replace art born from lived experience, emotion, and human struggle.\\n- Laura Soto Salazar\\n\\nThe movement continues to grow, demonstrating the irreplaceable value of human creativity in the age of generative AI."
}