{
  "title": "Canada announces new countermeasures in response to tariffs from the United States of America",
  "publication_date": "2025-01-31T12:30:00Z",
  "summary": "Prime Minister Mark Carney announced new countermeasures in response to unwarranted US tariffs on automobiles, steel, and aluminum. The Canadian government pledges to fight these tariffs, protect workers, and defend the economy. All revenue from countermeasures will directly support auto workers.",
  "content": "Prime Minister of Canada announced yesterday that the United States administration has implemented a series of unwarranted and unjustified tariffs that will fundamentally change the international trading system. While some important elements of the Canada U.S. trade relationship remain preserved, new tariffs on automobiles have now entered into force, adding to previously announced tariffs on steel and aluminum.\n\nThe U.S. tariffs are expected to harm American workers and businesses, with impacts extending to all Canadians. The Government of Canada maintains its clear position to fight these tariffs, protect workers, and build the strongest economy in the G7.\n\nPrime Minister Mark Carney announced that every dollar raised from these countermeasures will directly support auto workers. These measures supplement previously announced support for Canadian workers and businesses.\n\nCarney stated, \"The global economy is fundamentally different today than yesterday. We must respond with purpose and force and take every step to protect Canadian workers and businesses against the unjust tariffs imposed by the United States, including on automobiles. We will never cease to defend the interests of Canadians, safeguard our workers and businesses, and continue our pursuit to build the strongest economy in the G7.\"",
  "category": "Business",
  "tags": [
    "trade",
    "tariffs",
    "international relations",
    "automotive industry",
    "economy",
    "Canada-US relations",
    "steel",
    "aluminum"
  ],
  "location": "Canada",
  "source": {
    "title": "Canada announces new countermeasures in response to tariffs from the United States of America",
    "publication_date": 1743643800,
    "content": [
      {
        "title": "Canada announces new countermeasures in response to tariffs from the United States of America",
        "publication_date": "Unknown",
        "content": "Prime Minister of Canada\n\nYesterday, the United States administration announced a series of unwarranted and unjustified tariffs that will fundamentally change the international trading system. While some important elements of the Canada U.S. trade relationship have been preserved, new tariffs on automobiles have now entered into force. These are on top of the previously announced tariffs, including those on steel and aluminum, which remain in place.\n\nThe U.S. tariffs will do harm to American workers and businesses, but Canada will also be impacted, with every Canadian feeling the effects. The Government of Canada’s position has always been clear: we will fight these tariffs, protect our workers, and build the strongest economy in the G7.\n\nThe Prime Minister of Canada, Mark Carney, today announced new countermeasures to protect Canadian workers and businesses and defend Canada’s economy. These countermeasures include:\n\nMost importantly, every single dollar raised from these tariffs will go directly to support our auto workers.\n\nThese measures build on the Government of Canada’s previously announced supports to Canadian workers and business, including:\n\nIn a crisis like this, it’s important to come together and act with strength, purpose, and force – and that's exactly what we’re doing.\n\n“The global economy is fundamentally different today than yesterday. We must respond with purpose and force and take every step to protect Canadian workers and businesses against the unjust tariffs imposed by the United States, including on automobiles. We will never cease to defend the interests of Canadians, safeguard our workers and businesses, and continue our pursuit to build the strongest economy in the G7.”\n\nThe Rt. Hon. Mark Carney, Prime Minister of Canada\n\nPrime Minister of Canada@CanadianPM"
      },
      {
        "title": "Canada announces new countermeasures in response to tariffs from the United States of America",
        "author": "Unknown Author",
        "publication_date": "Unknown"
      }
    ],
    "authors": [],
    "source": "Prime Minister of Canada",
    "image_url": "https://www.pm.gc.ca/sites/pm/files/media/override_sharing/priority_override/2025-04/NR_PM_TariffResponse_250403_A_EN.png",
    "url": "https://www.pm.gc.ca/en/news/news-releases/2025/04/03/canada-announces-new-countermeasures-response-tariffs-from-united-states"
  },
  "markdown_content": "## Trade Dispute Escalation\\n\\nPrime Minister of Canada announced yesterday that the United States administration has implemented a series of unwarranted and unjustified tariffs that will fundamentally change the international trading system. While some important elements of the Canada U.S. trade relationship remain preserved, new tariffs on automobiles have now entered into force, adding to previously announced tariffs on steel and aluminum.\\n\\nThe U.S. tariffs are expected to harm American workers and businesses, with impacts extending to all Canadians. The Government of Canada maintains its clear position to fight these tariffs, protect workers, and build the strongest economy in the G7.\\n\\n## Government Response\\n\\nPrime Minister Mark Carney announced that every dollar raised from these countermeasures will directly support auto workers. These measures supplement previously announced support for Canadian workers and businesses.\\n\\n> \"The global economy is fundamentally different today than yesterday. We must respond with purpose and force and take every step to protect Canadian workers and businesses against the unjust tariffs imposed by the United States, including on automobiles. We will never cease to defend the interests of Canadians, safeguard our workers and businesses, and continue our pursuit to build the strongest economy in the G7.\""
}