{
  "title": "TCS under probe for firing Americans, retaining H-1B workers in US",
  "publication_date": "2024-04-17T00:00:00Z",
  "summary": "The U.S. Equal Employment Opportunity Commission is investigating TCS following complaints alleging discrimination against American workers. Former employees claim they were unfairly targeted in layoffs while Indian H-1B visa holders were retained. The investigation began during Biden's presidency and continues under Trump. TCS denies all allegations of discrimination.",
  "content": "The U.S. Equal Employment Opportunity Commission (EEOC) is investigating Tata Consultancy Services (TCS) following over two dozen complaints filed since late 2023, according to Bloomberg.\n\nMany complainants, reportedly over the age of 40 and from non-South Asian backgrounds, allege they were unfairly targeted in layoffs, while Indian employees — particularly those on H-1B visas — were retained.\n\nTCS has denied all allegations, stating that claims of unlawful discrimination are meritless and misleading. The company emphasizes its commitment to equal opportunity and integrity in U.S. operations.\n\nThe complaints reference statements by TCS's global HR head, Milind Lakkad, who indicated plans to reduce U.S. workforce share from 70% to 50% in favor of Indian hires. Representative Seth Moulton has urged formal EEOC investigation, citing possible misuse of visa programs.\n\nThe case parallels a 2020 EEOC investigation of Cognizant, which resulted in a 2023 verdict confirming discrimination against over 2,000 American employees. Work visa programs like H-1B and L-1A are facing increased scrutiny amid allegations of system abuse by outsourcing firms.\n\nTCS, India's largest IT services provider, employs over 600,000 people worldwide and serves major U.S. clients across various industries.",
  "category": "Business",
  "tags": [
    "workplace discrimination",
    "H-1B visa",
    "outsourcing",
    "IT industry",
    "employment law",
    "immigration",
    "corporate investigation"
  ],
  "location": "United States",
  "source": {
    "title": "TCS under probe for firing Americans, retaining H-1B workers in US..",
    "publication_date": 1744882802,
    "content": [
      {
        "title": "TCS under probe for firing Americans, retaining H-1B workers in US",
        "publication_date": "Unknown",
        "content": "The U.S. Equal Employment Opportunity Commission (EEOC) is investigating Tata Consultancy Services (TCS) following over two dozen complaints filed since late 2023, according to Bloomberg.\n\nMany complainants, reportedly over the age of 40 and from non-South Asian backgrounds, allege they were unfairly targeted in layoffs, while Indian employees — particularly those on H-1B visas — were retained.\n\nTCS has denied all allegations. “Claims that TCS engages in unlawful discrimination are meritless and misleading,” a company spokesperson said, emphasizing the firm’s commitment to equal opportunity and integrity in its U.S. operations.\n\nThe EEOC declined to comment on the ongoing investigation due to confidentiality rules. However, Bloomberg reports that the probe began during President Biden’s tenure and has continued into President Trump’s current administration.\n\nThe complaints echo a 2020 EEOC case against Cognizant, another outsourcing firm, where the agency found systemic bias against non-Indian workers. That case culminated in a 2023 jury verdict confirming intentional discrimination against over 2,000 American employees. Cognizant denied wrongdoing and plans to appeal.\n\nThe TCS case appears to follow a similar trajectory, with former employees referencing internal comments by Milind Lakkad, the company’s global HR head, who told Indian media that TCS aimed to reduce its U.S. workforce share from 70% to 50% in favor of Indian hires.\n\nIn April 2024, U.S. Representative Seth Moulton (D-MA) urged the EEOC to formally investigate, citing complaints from constituents and possible misuse of U.S. visa programs. “TCS’s actions may reflect a pattern-or-practice of discrimination against American workers,” Moulton wrote.\n\nWork visa programs such as H-1B and L-1A are under growing scrutiny. A 2023 Bloomberg investigation found that outsourcing firms have used their vast overseas workforces to flood the annual H-1B visa lottery, limiting access for smaller companies and U.S. job seekers. TCS has also been accused of misusing the L-1A visa to bypass H-1B caps—allegations the company denies.\n\nAndrea R. Lucas, appointed EEOC acting chair by President Trump in January, has pledged stricter enforcement against what she calls “unlawful bias against American workers.” In February, she emphasized that such practices undermine U.S. labor protections and immigration policy.\n\nThe controversy isn’t limited to the U.S. In the UK, three former TCS employees have filed employment tribunal claims alleging age and nationality discrimination during a 2023 redundancy process. TCS has denied those allegations as well.\n\nTCS, India’s largest IT services provider and part of the Tata Group, employs over 600,000 people worldwide and serves major U.S. clients across industries, including airlines, automakers, and financial institutions.\n\nEmail us at[email protected]"
      },
      {
        "title": "TCS under probe for firing Americans, retaining H-1B workers in US",
        "author": "Unknown Author",
        "publication_date": "Unknown"
      }
    ],
    "authors": [],
    "source": "Greatandhra.com",
    "image_url": "https://mc-webpcache.readwhere.in/mcms.php?size=medium&in=https://mcmscache.epapr.in/post_images/website_49/post_45791385/thumb.jpg",
    "url": "https://www.greatandhra.com/politics/india-news/tcs-under-probe-for-firing-americans-retaining-h-1b-workers-in-us-145561"
  },
  "markdown_content": "## Investigation Details\\nThe U.S. Equal Employment Opportunity Commission (EEOC) is investigating Tata Consultancy Services (TCS) following over two dozen complaints filed since late 2023, according to Bloomberg.\\n\\nMany complainants, reportedly over the age of 40 and from non-South Asian backgrounds, allege they were unfairly targeted in layoffs, while Indian employees — particularly those on H-1B visas — were retained.\\n\\n## Company Response\\n> TCS has denied all allegations, stating that claims of unlawful discrimination are meritless and misleading. The company emphasizes its commitment to equal opportunity and integrity in U.S. operations.\\n\\n## Background and Context\\nThe complaints reference statements by TCS's global HR head, Milind Lakkad, who indicated plans to reduce U.S. workforce share from 70% to 50% in favor of Indian hires. Representative Seth Moulton has urged formal EEOC investigation, citing possible misuse of visa programs.\\n\\nThe case parallels a 2020 EEOC investigation of Cognizant, which resulted in a 2023 verdict confirming discrimination against over 2,000 American employees. Work visa programs like H-1B and L-1A are facing increased scrutiny amid allegations of system abuse by outsourcing firms.\\n\\n## Company Profile\\nTCS, India's largest IT services provider, employs over 600,000 people worldwide and serves major U.S. clients across various industries."
}