{
  "title": "India to discourage foreign trade settlement in Chinese yuan",
  "publication_date": "2023-03-13T00:00:00Z",
  "summary": "India has instructed banks and traders to avoid using Chinese yuan for Russian import payments due to ongoing political tensions. The government's directive reflects India's cautious approach to financial dealings involving China.",
  "content": "NEW DELHI (Reuters) - Indian government officials have instructed banks and traders to avoid using Chinese yuan for settling payments with Russia, according to three government officials and two banking sources familiar with the matter.\n\nThe directive comes amid long-running political differences between India and China, suggesting growing caution in financial dealings between the two Asian powers. The government's move aims to reduce India's financial exposure to Chinese currency while maintaining its trade relationships with Russia.\n\nThis development could significantly impact the evolving trade dynamics between India, Russia, and China, particularly in the context of international sanctions and alternative payment mechanisms.",
  "category": "Business",
  "tags": [
    "international trade",
    "banking",
    "currency",
    "India",
    "China",
    "Russia",
    "foreign policy",
    "economy"
  ],
  "location": "New Delhi, India",
  "source": {
    "title": "Exclusive: India to discourage foreign trade settlement in Chinese yuan - sources",
    "publication_date": 1678695351,
    "content": "NEW DELHI, March 13 (Reuters) - India has asked banks and traders to avoid using Chinese yuan to pay for Russian imports, three government officials involved in policy making and two banking sources said, because of long-running political differences... [3061 chars]",
    "source": "Reuters",
    "authors": [],
    "image_url": "https://www.reuters.com/resizer/vvMnpyyl1mJCsB6m6DzU_rwnqrY=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/HWQREBC7Z5IJFCKDIVLQQAKKXI.jpg",
    "url": "https://www.reuters.com/markets/asia/india-discourage-foreign-trade-settlement-chinese-yuan-sources-2023-03-13/"
  },
  "markdown_content": "## Government Directive\\n\\nIndian government officials have instructed banks and traders to avoid using Chinese yuan for settling payments with Russia, according to three government officials and two banking sources familiar with the matter.\\n\\n## Background and Implications\\n\\nThe directive comes amid long-running political differences between India and China, suggesting growing caution in financial dealings between the two Asian powers. The government's move aims to reduce India's financial exposure to Chinese currency while maintaining its trade relationships with Russia.\\n\\nThis development could significantly impact the evolving trade dynamics between India, Russia, and China, particularly in the context of international sanctions and alternative payment mechanisms."
}