{
  "title": "Ola: The rise and wobble of India's EV pioneer Ola",
  "publication_date": "2024-03-18T00:00:00Z",
  "summary": "Ola, once India's startup sensation, is facing multiple challenges in its EV business. Despite raising $734m in an IPO, Ola Electric has lost 70% of its value in seven months. The company faces declining sales, safety concerns, regulatory scrutiny, and mounting losses. Customer complaints about scooter fires and breakdowns, along with service issues, have damaged its reputation. The company is currently restructuring operations and cutting jobs to reduce costs.",
  "content": "It was once the Indian start-up world's shining star, but Ola is now battling a multitude of crises.\n\nFounded in 2010, it quickly became a household name, expanding from ride-hailing to electric vehicles and battery cells, challenging Uber along the way. The company jumped on the AI bandwagon in 2023 with Krutrim, India's first AI company valued at over $1bn.\n\nMarquee global investors such as Japan's SoftBank, US-based Tiger Global and Singapore's Temasek bankrolled this expansion. Last year, Ola's electric vehicles (EV) arm raised close to $734m in a blockbuster initial public offering, India's biggest in 2024.\n\nBut this ambitious rise has been accompanied by a series of controversies, particularly at its EV arm. Ola Electric has lost close to 70% of its value in the seven months since the IPO was launched. It is facing competition from more established two-wheeler giants, along with mounting regulatory scrutiny.\n\nSales of Ola's scooters are down to less than half from April last year and the company's losses have widened. Customers have posted videos on social media of Ola scooters going up in flames or breaking down mid-ride.\n\nThe company has been cutting jobs, restructuring operations and automating functions in a bid to reduce costs and trim losses. Several safety-related incidents and service issues have raised questions about product quality and customer support.\n\nTo push sales, Ola has offered deep discounts, launching newer models at cheaper price points. But losses have widened to $65m in the October-December quarter from $43.6m a year ago.",
  "category": "Business",
  "tags": [
    "startups",
    "electric vehicles",
    "India",
    "business",
    "technology",
    "automotive industry",
    "IPO"
  ],
  "location": "India",
  "source": {
    "title": "PM Modi speaks to Elon Musk days before Vance's India visit",
    "publication_date": 1744958570,
    "content": [
      {
        "title": "Ola: The rise and wobble of India's EV pioneer Ola",
        "publication_date": "Unknown",
        "content": "It was once the Indian start-up world's shining star, but Ola is now battling a multitude of crises.\n\nFounded in 2010, it quickly became a household name, expanding from ride-hailing to electric vehicles and battery cells, challenging Uber along the way.\n\nThe company jumped on the AI bandwagon in 2023 with Krutrim, India's first AI company valued at over $1bn.\n\nMarquee global investors such as Japan's SoftBank, US-based Tiger Global and Singapore's Temasek bankrolled this expansion. Last year, Ola's electric vehicles (EV) arm raised close to $734m (£567m) in a blockbuster initial public offering (IPO), India's biggest in 2024.\n\nBut this ambitious rise has been accompanied by a series of controversies lately, particularly at its EV arm.\n\nOla Electric has lost close to 70% of its value in the seven months since the IPO was launched. It is facing competition from more established two-wheeler giants, along with mounting regulatory scrutiny.\n\nSales of Ola's scooters are down to less than half from April last year and the company's losses have widened. Customers have posted videos on social media of Ola scooters going up in flames or breaking down mid-ride.\n\nThere's a government inquiry under way at hundreds of newly-opened Ola showrooms regarding licences and registrations. One of its vendors also filed an insolvency plea against the company, which Ola said in a statement to stock exchanges that it had settled.\n\nThe BBC has learnt from former employees and industry sources that delayed payments have led to many major suppliers and logistics partners ending ties with them.\n\nOla has been cutting jobs, restructuring operations and automating functions in a bid to reduce costs and trim losses. Media reports say it has undertaken a second round of layoffs since November, with over 1,000 roles axed.\n\nThe BBC sent detailed questions to Ola about these issues. The company shared links to some of its earlier press statements, not responding specifically to all the queries.\n\nSo, what's gone wrong?\n\nOla CEO Bhavish Aggarwal positioned the company as Tesla's two-wheeler equivalent, solving the emissions problem for the price-sensitive Indian market.\n\nHe poured in millions of marketing dollars, opening Ola showrooms across India, even delivering scooters at the doorstep of people who'd made online bookings.\n\nBut Ola has struggled to read the market well, says Rohit Paradkar, an analyst with the auto magazine Overdrive.\n\nIts scooter is modelled on the AppScooter from Etergo, a Dutch start-up that Ola Electric acquired in 2020.\n\nSeveral former employees told the BBC that Ola's first EV scooter was launched without many changes to Etergo's version. A former employee who worked in the compliance department told the BBC that clearances were rushed through to meet unrealistic launch deadlines.\n\nIn response to queries, Ola referred to an October 2023blog postwhere it addressed the \"myth\" that the vehicle had \"not been engineered and tested for India\". It said it had \"fully re-engineered\" Etergo's scooter and tested it for \"Indian conditions\".\n\n\"The whole vehicle has been tested at three levels [for India] - digital simulations, component tests and vehicular lab tests, and vehicular field tests,\" it said in the post.\n\nBut several safety-related incidents reported by customers have raised questions.\n\nSome scooters began catching fire which, auto experts say, was likely due to short-circuits or faulty battery management system.\n\nOla recalled more than 1,400 first-generation scooters in 2022 to investigate the fires, but the report was not publicly released. It had then said the battery systems were compliant for Indian and European standards but didn't explain what caused the fires.\n\nSome riders also reported the front suspension - which holds the wheel in place - breaking mid-ride, causing injuries.\n\nIn early 2023, after such an accident, Ola called it a rare case, noting there were only a few such issues among 150,000 scooters.\n\nThe front fork arm, they said, had a significant safety margin for accidents and was designed to handle 80% more load than what it would typically experience during daily use.\n\nMeanwhile, Ola's rivals - mostly established automakers - have rolled out electric scooters smoothly, adding to the pressure on the company.\n\nTheir entry shook the market. Ola's share had plunged from 52% to 19% by December, then recovered to 25% in January.\n\nOla aims to sell 50,000 units monthly to turn profitable, but analysts doubt the target, despite the company saying recent restructuring has helped it achieve $10m monthly savings and faster deliveries.\n\nGovernment data shows that less than 10,000 scooters were sold in February, but Ola claims 25,000, blaming registration delays due to vendor contract changes. The federal transport ministry has issued notices over the discrepancy. Ola said it had registered over 23,000 scooters sold in March and held a 30% market share for the fiscal year.\n\nBut competing scooters with fewer features are now outselling Ola simply because they come from trusted, well-established brands, said Jay Kale, executive vice-president and auto analyst at Elara Capital.\n\nTo push sales, Ola has offered deep discounts, launching newer models at cheaper price points. But losses have widened to $65m in the October-December quarter from $43.6m a year ago.\n\nBesides product issues, the reliability of its customer service has been another major issue, says Kale.\n\nWhen angry customers flooded social media and consumer helplines with complaints about the fires and front suspension, their service requests were reportedly unanswered for days.\n\nAt one point, thousands of complaints were piling up monthly, a former employee at Ola told the BBC. India's consumer rights agency, the Central Consumer Protection Authority (CCPA), also sent a notice to Ola after it got 10,000 complaints over the period of a year.\n\nBut since Ola had eschewed the established dealer route in a bid to sell directly to buyers and had just a few service centres, aggrieved consumers had few places to turn to.\n\nLate last year, Ola wrote to the CCPA that it had a \"robust mechanism to address complaints\", and that most raised with the regulator had been satisfactorily resolved.\n\nAggarwal was initially dismissive of the problems on social media but later announced that Ola would be opening nearly 4,000 stores with service facilities, following a heated public exchange on X with a stand-up comedian who took up the customers' cause.\n\nA majority of these new centres, however, came under the government's scanner for lacking relevant licences to store and sell vehicles.\n\nOn 21 March, Ola confirmed investigations in four states and said it was responding to authorities.\n\nThe sharp turn in Ola's fortunes is making investors - especially those who bought in at high IPO valuations - nervous.\n\nOla has been a key player in India's push to cut carbon emissions and expand manufacturing.\n\nIt benefits from two separate state subsidies, one to make scooters and the second to set up its own 20 gigawatt EV battery plant. But Reuters hasreportedthat the costly gigafactory project is delayed and has missed a key milestone, potentially leading to penalties.\n\nCritics say Ola's troubles emanate from typical culture issues that plague many start-ups - including CEO-driven decision-making, constant pivots and unrealistic, high-pressure deadlines.\n\n\"Software mindsets don't work with hardware products, which need time to build,\" said Deepesh Rathore, who used to head product strategy at Ola Electric and now runs consultancy firm Insight EV.\n\nSome top executives across the wider company have quit recently, including a former Ola Cab CEO who quit within months. Key leaders in tech, marketing, sales and business also left last year.\n\nExperts say the exits have also affected Ola's efforts to fix product and service issues.\n\nFollow BBC News India onInstagram,YouTube,XandFacebook.\n\nRakhaldas Banerjee is credited with discovering Mohenjo-daro, but his legacy is tainted by controversy.\n\nChina sits at the heart of Apple's supply chain - and has benefited hugely from it. Can they break up?\n\nModi said he discussed with Musk India's potential to collaborate with the US on technology.\n\nHarpreet Singh is wanted by Indian authorities for his alleged role in terror attacks in Punjab state.\n\nLed by Jensen Huang, dubbed the 'Taylor Swift of tech', the chip giant has become pivotal in the race for AI supremacy.\n\nCopyright 2025 BBC. All rights reserved.TheBBCisnot responsible for the content of external sites.Read about our approach to external linking."
      },
      {
        "title": "Ola: The rise and wobble of India's EV pioneer Ola",
        "author": "Unknown Author",
        "publication_date": "Unknown"
      }
    ],
    "authors": [],
    "source": "BBC",
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/ab15/live/399adf50-1c39-11f0-857e-c31f6e495ac8.jpg",
    "url": "https://www.bbc.com/news/articles/c8073ggz1eeo"
  },
  "markdown_content": "## Rise and Fall of an Indian Startup Giant\\n\\nIt was once the Indian start-up world's shining star, but Ola is now battling a multitude of crises.\\n\\nFounded in 2010, it quickly became a household name, expanding from ride-hailing to electric vehicles and battery cells, challenging Uber along the way. The company jumped on the AI bandwagon in 2023 with Krutrim, India's first AI company valued at over $1bn.\\n\\nMarquee global investors such as Japan's SoftBank, US-based Tiger Global and Singapore's Temasek bankrolled this expansion. Last year, Ola's electric vehicles (EV) arm raised close to $734m in a blockbuster initial public offering, India's biggest in 2024.\\n\\n## Current Challenges\\n\\nBut this ambitious rise has been accompanied by a series of controversies, particularly at its EV arm. Ola Electric has lost close to 70% of its value in the seven months since the IPO was launched. It is facing competition from more established two-wheeler giants, along with mounting regulatory scrutiny.\\n\\n## Product and Safety Issues\\n\\n* Sales of Ola's scooters are down to less than half from April last year\\n* The company's losses have widened\\n* Customers have posted videos on social media of Ola scooters going up in flames or breaking down mid-ride\\n\\n## Response and Financial Impact\\n\\nThe company has been cutting jobs, restructuring operations and automating functions in a bid to reduce costs and trim losses. Several safety-related incidents and service issues have raised questions about product quality and customer support.\\n\\nTo push sales, Ola has offered deep discounts, launching newer models at cheaper price points. But losses have widened to $65m in the October-December quarter from $43.6m a year ago."
}