{
  "title": "Intercaste Couple Forcibly Separated by Family and Police in Chennai",
  "publication_date": "2025-02-16T06:25:23Z",
  "summary": "A newly married intercaste couple in Chennai faces separation after the bride's wealthy family allegedly used police influence to separate them. The 27-year-old IT professional seeks legal help after his wife was taken by her family, while he faces police intimidation and lacks financial resources to pursue legal action.",
  "content": "A concerning case of alleged police misconduct and family interference has emerged in Chennai, involving a newly married intercaste couple who were forcibly separated three months after their marriage.\n\nThe husband, a 27-year-old IT professional, reported being approached by police officers in Walajah who requested the couple to visit the Chennai police station under the pretense of document verification. Upon arrival, the couple was separated. The husband claims he was stripped of his belongings and threatened, while his wife, a physiotherapist of the same age, was taken away by her family despite her protests.\n\n\"Bro, I'm in a big problem,\" the distressed husband told a fellow bus passenger while seeking help. He revealed that his wife is reportedly pregnant, though her family remains unaware of this fact.\n\nThe situation appears to have been orchestrated by the bride's wealthy father, who allegedly used his influence with local law enforcement to intervene. The father had previously opposed the marriage, preferring his daughter to marry a wealthy doctor instead.\n\nThe husband now faces additional pressure from police to address alleged issues involving a former relationship, while simultaneously seeking legal representation to reunite with his wife. He expresses serious concerns about the possibility of his wife being coerced into another marriage during their separation.",
  "category": "World",
  "tags": [
    "human rights",
    "police misconduct",
    "intercaste marriage",
    "family conflict",
    "forced separation",
    "legal rights",
    "India"
  ],
  "location": "Chennai, India",
  "source": {
    "title": "Need urgent legal help for a couple separated by family and police - Chennai",
    "url": "https://www.reddit.com/r/india/comments/1k1x153/need_urgent_legal_help_for_a_couple_separated_by/",
    "created_utc": 1744952723.0,
    "subreddit": "india",
    "media": [],
    "content": "Yesterday, I was traveling by bus from Chennai when I met a guy who seemed visibly nervous. He had a small piece of paper with some phone numbers and was asking fellow passengers for their phones to make a call. After a while, he asked to borrow my phone twice. I didn’t think much of it and was happy to help.\n\nLater, when we reached a stop, he turned to me and said, “Bro, I’m in a big problem.” He then asked if I’d join him for a cup of tea. That’s when he opened up and shared his story with me.\n\nHe recently got married—just three months ago—to his girlfriend. Both are 27 years old and from different castes. His family opposed the marriage, and her family, especially her father (who is quite wealthy), wanted her to marry a rich doctor. She is a physiotherapist, and he works in IT.\n\nThey were living in Walajah, away from Chennai, until recently. Her father managed to use his influence—possibly by bribing police—and sent two policemen to their place, saying they just needed to visit the Chennai police station to sign some documents. Since they are adults and married with consent, they didn’t expect anything serious.\n\nBut once they reached the police station, they were separated. The guy was humiliated, his phone, wallet, and photos were taken, and he was threatened to return to his hometown. None of his family or friends are supporting him. His wife was taken away by her family, despite crying and protesting. (He also mentioned she is pregnant, but her family doesn’t know yet.)\n\nNow, he’s completely hopeless. He has little to no money. The police have asked him to come again to Chennai with all the documents related to their marriage and also to resolve some minor issue involving his ex-girlfriend (he claims it’s nothing serious, just something the police dug up).\n\nHe fears that if his wife stays at her parents’ house for two months, they might forcefully marry her off to someone else or brainwash her.\n\nHe wants to hire a good lawyer to help them reunite, but he has no idea how to go about it.\n\nCan someone please help or guide me on what can be done legally so that:\n\n1. They can meet or talk again.\n2. She is not forcibly married off.\n3. They are protected from harassment by police or her family.\n4. He can take legal action to live with his wife peacefully.\nAny help or legal advice would be deeply appreciated."
  },
  "markdown_content": "## Background\\nA concerning case of alleged police misconduct and family interference has emerged in Chennai, involving a newly married intercaste couple who were forcibly separated three months after their marriage.\\n\\n## Incident Details\\nThe husband, a 27-year-old IT professional, reported being approached by police officers in Walajah who requested the couple to visit the Chennai police station under the pretense of document verification. Upon arrival, the couple was separated. The husband claims he was stripped of his belongings and threatened, while his wife, a physiotherapist of the same age, was taken away by her family despite her protests.\\n\\n## Eyewitness Account\\n> \"Bro, I'm in a big problem,\" the distressed husband told a fellow bus passenger while seeking help. He revealed that his wife is reportedly pregnant, though her family remains unaware of this fact.\\n\\n## Family Interference\\nThe situation appears to have been orchestrated by the bride's wealthy father, who allegedly used his influence with local law enforcement to intervene. The father had previously opposed the marriage, preferring his daughter to marry a wealthy doctor instead.\\n\\n## Current Situation\\nThe husband now faces additional pressure from police to address alleged issues involving a former relationship, while simultaneously seeking legal representation to reunite with his wife. He expresses serious concerns about the possibility of his wife being coerced into another marriage during their separation."
}