{
  "title": "Kazakhstan plans to send delegation to United States for trade talks",
  "publication_date": "2024-04-17T00:00:00Z",
  "summary": "Kazakhstan is preparing to send a delegation to Washington for trade talks amid US tariff concerns. Deputy Trade Minister Zhanel Kushukova announced the country's non-confrontational approach, avoiding retaliatory measures. Kazakhstan's trade with the US reached $3.4 billion in 2024, with discussions expected to cover tariffs and rare earth minerals trade.",
  "content": "Kazakhstan is adopting a non-confrontational stance as it finesses trade relations with the United States, seeking engagement rather than retaliation over the imposition of US tariffs.\n\nDeputy Trade Minister Zhanel Kushukova told journalists on April 17 that the government intended to send a delegation to Washington to hold talks on a variety of trade issues, including tariffs. The Trump administration initially hit Kazakh goods with a 27-percent tariff rate, but subsequently scaled the rate back provisionally to 10 percent, with a 90-day pause on tariff imposition.\n\nKazakh officials are embracing a do-no-harm approach in response to US policymaking. Kushkova emphasized that Kazakhstan had no intention of imposing reciprocal tariffs on US goods, citing the country's membership in the Russia-led Eurasian Economic Union (EAEU) as a factor.\n\nKazakhstan in 2024 had the highest overall trade turnover with the United States of all Central Asian states, totaling $3.4 billion, with more than two-thirds comprising US-bound Kazakh exports, mainly carbon resources and other commodities.\n\nThe planned delegation would discuss various issues beyond tariffs, including potential trade deals concerning Kazakhstan's abundant reserves of rare earths, particularly following China's ban on rare earth exports.\n\nRecent data shows that Russia is having increased difficulty using Kazakhstan as a sanctions-busting trade route, with the number of Russian companies operating in Kazakhstan declining from a peak of 19,735 in early 2024 to 18,366 as of April 1.",
  "category": "Business",
  "tags": [
    "international trade",
    "diplomacy",
    "tariffs",
    "Kazakhstan",
    "United States",
    "rare earth minerals",
    "sanctions",
    "Russia",
    "EAEU"
  ],
  "location": "Kazakhstan",
  "source": {
    "title": "Kazakhstan plans to send delegation to United States for trade talks",
    "publication_date": 1744969657,
    "content": [
      {
        "title": "Kazakhstan plans to send delegation to United States for trade talks",
        "publication_date": "Unknown",
        "content": "Kazakhstan is adopting a non-confrontational stance as it finesses trade relations with the United States, seeking engagement rather than retaliation overthe impositionof US tariffs.\n\nDeputy Trade Minister Zhanel Kushukova told journalists on April 17 that the government intended to send a delegation to Washington to hold talks on a variety of trade issues, including tariffs. The Trump administration initially hit Kazakh goods with a27-percent tariff rate, but subsequently scaled the rate back provisionally to 10 percent. In addition, the Trump administration has placed a 90-day pause on the imposition of tariffs.\n\n“All countries are now interested in holding consultations with the USA about duties, and we are no exception,” the InBusiness.kz news agencyquotedKushkova as saying. “We are currently working on this issue within the government and are preparing for consultations.” She provided no timeframe for when the Kazakh delegation would depart for the United States.\n\nAs the tariff and other trade issues play out, Kazakh officials are embracing a do-no-harm approach in response to the constant zigs and zags of US policymaking. Kushkova emphasized that Kazakhstan had no intention of imposing reciprocal tariffs on US goods, citing the country’s membership in the Russia-led Eurasian Economic Union (EAEU) trade bloc as a factor in Astana’s policy of restraint.\n\n“A single customs tariff applies to five [EAEU member] states. That is, if any duties are to be changed on imported goods, then it can only be by a decision of the five,” Kushkovasaid. “But today, such an issue is not even considered.” Russia, the EAEU’s dominant member, has so far beenexemptedfrom US tariffs, even though it is subjected to extensivesanctionsimposed by the US and European Union.\n\nKazakhstan in 2024 had the highest overall trade turnover with the United States of all Central Asian states, totaling $3.4 billion, of which more than two-thirds comprised US-bound Kazakh exports, mainly carbon resources and other commodities. Kazakh officials have noted that energy and other raw-material exports would be exempt from tariffs under the present US framework.\n\nThe planned Kazakh delegation would have plenty to discuss with US officials in Washington beyond tariffs. Since taking power, the Trump administration has repeatedlyexpressed interestto striking trade deals concerning Kazakhstan’sabundant reservesof rare earths. US interest in securing an increase in Kazakh mineral supplies is only intensifying in the wake of aChinese banon rare earth exports.\n\nThe top US diplomat in Kazakhstan, Deborah Robinson, earlier in AprilreaffirmedUS support “for private and public sector cooperation in the critical minerals sector.”\n\nMeanwhile, data published by Kazakhstan’s State Statistics Agency provides fresh evidence that Russia is having an increasingly difficult time using the Central Asian nation as a back door for sanctions-busting trade.\n\nKazakh authorities insist that they are enforcing US and EU sanctions. Nevertheless, the countryhas long been suspectedas anenablerofillicit transitin dual-use technology and goods that can help maintain Russia’s war effort in Ukraine. Avarietyof Kazakh-basedentitieshave beenaddedto the US sanctions list since the start of the Russia-Ukraine war in 2022.\n\nOf late, however, Russian business representatives in Kazakhstan have complained about tightening financial regulations that hinder their ability to operate, according to reportsdistributedby state-controlled Russian media.\n\nThe data published by QazStat supports the notion that Kazakhstan’s is becoming a less hospitable environment for sanctions-busting activity. The number of Russian companies operating in Kazakhstan has been gradually declining for a year now, following a long period of explosive growth, the official statistics show.\n\nIn January 2022, the month before the outbreak of the Russia-Ukraine war, roughly 7,900 Russian entities operated in Kazakhstan. By the end of that year, the number nearly doubled to 15,700.\n\nThe number of actively operating Russian entities in Kazakhstan peaked during the first quarter of 2024, totaling19,735. Since then, the numbers have declined by a few hundred each quarter, and stood at18,366as of April 1 of this year, a 7 percent drop over the four-quarter period.\n\nSign upfor Eurasianet's free weekly newsletter.Support Eurasianet:Help keep our journalism open to all, and influenced by none."
      },
      {
        "title": "Kazakhstan plans to send delegation to United States for trade talks",
        "author": "Unknown Author",
        "publication_date": "Unknown"
      }
    ],
    "authors": [],
    "source": "Eurasianet",
    "image_url": "https://eurasianet.org/sites/default/files/styles/article/public/2025-04/d79c0f8e382be52aa3192e3ac4fe6720_1280x720%20%281%29.jpg?h=ed376f01&itok=0KSusqOr",
    "url": "https://eurasianet.org/kazakhstan-plans-to-send-delegation-to-united-states-for-trade-talks"
  },
  "markdown_content": "## Trade Relations Update\\n\\nKazakhstan is adopting a non-confrontational stance as it finesses trade relations with the United States, seeking engagement rather than retaliation over the imposition of US tariffs.\\n\\n> \"The government intended to send a delegation to Washington to hold talks on a variety of trade issues, including tariffs,\" Deputy Trade Minister Zhanel Kushukova told journalists on April 17.\\n\\nThe Trump administration initially hit Kazakh goods with a 27-percent tariff rate, but subsequently scaled the rate back provisionally to 10 percent, with a 90-day pause on tariff imposition.\\n\\n## Kazakhstan's Approach\\n\\nKazakh officials are embracing a do-no-harm approach in response to US policymaking. Kushkova emphasized that Kazakhstan had no intention of imposing reciprocal tariffs on US goods, citing the country's membership in the Russia-led Eurasian Economic Union (EAEU) as a factor.\\n\\n## Trade Statistics\\n\\n* Kazakhstan in 2024 had the highest overall trade turnover with the United States of all Central Asian states, totaling $3.4 billion\\n* More than two-thirds comprising US-bound Kazakh exports, mainly carbon resources and other commodities\\n\\nThe planned delegation would discuss various issues beyond tariffs, including potential trade deals concerning Kazakhstan's abundant reserves of rare earths, particularly following China's ban on rare earth exports.\\n\\n## Russian Trade Impact\\n\\nRecent data shows that Russia is having increased difficulty using Kazakhstan as a sanctions-busting trade route, with the number of Russian companies operating in Kazakhstan declining from a peak of 19,735 in early 2024 to 18,366 as of April 1."
}