{
  "title": "Thug Life: Kamal Haasan apologises to fans for not collaborating with Mani Ratnam earlier",
  "publication_date": "2025-04-18T14:12:13+05:30",
  "summary": "Legendary actor Kamal Haasan apologized to fans for the 37-year gap between collaborations with director Mani Ratnam. The duo, who last worked together in the 1987 film Nayakan, are now reuniting for Thug Life, set to release on June 5. During a music launch event in Chennai, Haasan expressed regret for the long wait.",
  "content": "Ace director Mani Ratnam and Indian star Kamal Haasan are reuniting on screen after 37 years, following their 1987 collaboration Nayakan. Their new film Thug Life is scheduled for release on June 5. At a recent event in Chennai where the film's song 'Jinguchaa' was launched, Kamal Haasan addressed the long gap between their collaborations.\n\nHaasan acknowledged that while nothing has changed between him and Ratnam over the years, they should have worked together sooner. He explained they were searching for better scripts, and it took this long to find the right project. He credited the audience's desire to see them work together as the driving force behind their reunion.\n\nThe actor revealed his nickname for Ratnam - 'Anju ara' (meaning 5.30 am), owing to the director's early arrival on set each day. Haasan also drew parallels between Ratnam's working style and that of his mentor K Balachander.\n\nThug Life features an ensemble cast including Trisha, Silambarasan, Joju George, Ashok Selvan, Nasser, and Abhirami. The film boasts music by AR Rahman, cinematography by Ravi K Chandran, and editing by A Sreekar Prasad. It is a joint production of Raaj Kamal Films International, Madras Talkies, and Red Giant Movies.",
  "category": "Entertainment",
  "tags": [
    "Kamal Haasan",
    "Mani Ratnam",
    "Indian cinema",
    "Tamil films",
    "Thug Life",
    "collaboration",
    "AR Rahman",
    "Bollywood"
  ],
  "location": "Chennai, India",
  "source": {
    "title": "How would humanity respond if an asteroid headed for Earth? NASA answers",
    "publication_date": 1744950546,
    "content": [
      {
        "title": "Thug Life: Kamal Haasan apologises to fans for not collaborating with Mani Ratnam earlier",
        "publication_date": "2025-04-18T14:12:13+05:30",
        "content": "Subscribe Now! Get features like\n\nAce directorMani Ratnamand Indian starKamal Haasanreuniting together on screen after a whopping 37 years is headline indeed. After the stunning Nayakan in 1987, the two stalwarts are back together for Thug Life which is all set to release on June 5. On Friday, the Thug Life team launched a single from the film called Jinguchaa was released at an event in Chennai. (Also read:Kamal Haasan reveals the similarity between Mani Ratnam's Thug Life and Nayakan)\n\nSpeaking at the event, Kamal Haasan opened up about why the two never got to work together again after Nayakan and even apologised. “Nothing has changed between Mani Ratnam and me even after all these years. It's our fault for waiting for so long to come together. We were in search of better scripts and it took this long for us to collaborate. We are now working together again because of you, the audience - who want us to work together again. We should have collaborated earlier. I’m sorry.”\n\nKamal Haasan, who has co-written Thug Life with Mani Ratnam, also added that he was reminded of working with renowned director K Balachander, who is his mentor and guru, when he worked with Mani Ratnam. “I am reminded of K Balachander when I see Mani Ratnam’s style of working. He knows what a huge compliment this is. This is our mutual respect. I even have a nickname for Mani Ratnam! ‘Anju ara’ Mani Ratnam (meaning 5.30 am Mani Ratnam) because of how early he was every single day during the shoot,” he said.\n\nOn Trisha and AbhiramiKamal Haasan who is known for his romances on screen also spoke about the two ladies in the film – Trisha and Abhirami – saying, “The two ladies don’t say ‘I love you’ to me – instead it is Joju George who does! He said ‘I Love you sir’ every day on set and I consoled myself with that,” he smiled jokingly.Thug Life also features Trisha, Silambarasan, Joju George, Ashok Selvan, Nasser, Abhirami and others. The music for the film is by maestro AR Rahman while the cinematographer is Ravi K Chandran and editor is A Sreekar Prasad. The film is jointly produced by Raaj Kamal Films International, Madras Talkies and Red Giant Movies.\n\nKamal Haasan who is known for his romances on screen also spoke about the two ladies in the film – Trisha and Abhirami – saying, “The two ladies don’t say ‘I love you’ to me – instead it is Joju George who does! He said ‘I Love you sir’ every day on set and I consoled myself with that,” he smiled jokingly.\n\nThug Life also features Trisha, Silambarasan, Joju George, Ashok Selvan, Nasser, Abhirami and others. The music for the film is by maestro AR Rahman while the cinematographer is Ravi K Chandran and editor is A Sreekar Prasad. The film is jointly produced by Raaj Kamal Films International, Madras Talkies and Red Giant Movies."
      },
      {
        "title": "Thug Life: Kamal Haasan apologises to fans for not collaborating with Mani Ratnam earlier",
        "author": "Unknown Author",
        "publication_date": "2025-04-18T14:12:13+05:30"
      }
    ],
    "authors": [],
    "source": "Hindustan Times",
    "image_url": "https://www.hindustantimes.com/ht-img/img/2025/04/18/550x309/Newly-Discovered-Asteroid-2_1744970233736_1744970254120.jpg",
    "url": "https://www.hindustantimes.com/world-news/us-news/how-would-humanity-respond-if-an-asteroid-headed-for-earth-nasa-answers-101744970177152.html"
  },
  "markdown_content": "The legendary filmmaker Mani Ratnam and veteran actor Kamal Haasan are set to reunite after a 37-year hiatus since their iconic 1987 film \"Nayakan.\" Their latest collaboration \"Thug Life\" is slated for a June 5 release.\\n\\n## Public Event Details\\nAt a recent song launch event in Chennai showcasing \"Jinguchaa,\" Haasan addressed the extended gap in their partnership.\\n\\n> \"Nothing has changed between us over the years, though we should have worked together sooner,\" Haasan acknowledged, explaining that their search for better scripts led to the lengthy interval before finding the right project.\\n\\n## Behind-the-Scenes Insights\\nHaasan shared a personal anecdote, revealing his nickname for Ratnam:\\n> \"Anju ara\" (meaning 5.30 am)\\n\\nThe moniker stems from the director's consistent early morning presence on set. Haasan also noted similarities between Ratnam's directorial approach and that of his mentor K Balachander.\\n\\n## Production Details\\nThe film features an impressive ensemble cast including:\\n* Trisha\\n* Silambarasan\\n* Joju George\\n* Ashok Selvan\\n* Nasser\\n* Abhirami\\n\\nTechnical collaborators include:\\n* Music: AR Rahman\\n* Cinematography: Ravi K Chandran\\n* Editing: A Sreekar Prasad\\n\\nThe project is a joint venture between Raaj Kamal Films International, Madras Talkies, and Red Giant Movies."
}