{
  "title": "Supreme Court Questions Religious Composition of Waqf Board",
  "publication_date": "2025-04-16T16:47:23+05:30",
  "summary": "The Supreme Court challenged the constitutional validity of the Waqf (Amendment) Act, 2025, questioning why non-Muslims could serve on Waqf boards if Muslims aren't allowed on Hindu endowment boards. Chief Justice Khanna led discussions on religious composition requirements and provided interim relief regarding property declarations.",
  "content": "The Supreme Court on Wednesday questioned the religious composition of Waqf board during a hearing on the constitutional validity of the Waqf (Amendment) Act, 2025. The inclusion of non-Muslim members in the Waqf board emerged as a major point of contention.\n\nChief Justice of India Sanjiv Khanna directly challenged Solicitor General Tushar Mehta, asking whether Muslims would be allowed to be part of Hindu endowment boards in return. The Chief Justice noted that according to the Act, eight members of the board are Muslims, with potentially only two non-Muslims.\n\nWhen the Solicitor General suggested that the bench itself couldn't hear the case by the same logic, it drew sharp criticism from the Chief Justice, who emphasized that judges lose their religious identity on the bench and treat all sides equally.\n\nThe Court provided interim relief, stating that properties declared as Waqf by courts should not be de-notified during proceedings. It also stayed provisions preventing properties from being treated as Waqf while under investigation by the District Collector. The Court clarified that all Waqf board members must be Muslim, except for ex-officio members.\n\nThe three-judge bench, comprising CJI Khanna, Justice Sanjay Kumar, and Justice KV Viswanathan, will continue the hearing tomorrow at 2 pm.",
  "category": "World",
  "tags": [
    "legal",
    "religion",
    "supreme court",
    "waqf board",
    "india",
    "constitutional law",
    "religious freedom"
  ],
  "location": "India",
  "source": {
    "title": "Parvathy to Samantha, celebs wish Nazriya Nazim healing after emotional post",
    "publication_date": 1744858208,
    "content": [
      {
        "title": "Will you allow Muslims on Hindu boards? Supreme Court questions Waqf composition",
        "publication_date": "2025-04-16T16:47:23+05:30",
        "content": "Listen to Story\n\nThe Supreme Court on Wednesday questioned the religious composition of Waqf board during a hearing on the constitutional validity of the Waqf (Amendment) Act, 2025. Theinclusion of non-Muslim members in the Waqf boardis one of the main points of contention, with petitioners arguing that the move dilutes the freedom of Muslims to manage their own religion.\n\nChief Justice of India Sanjiv Khanna asked Solicitor General Tushar Mehta, “Are you saying that from now on you will allow Muslims to be part of Hindu endowment boards? Say it openly.”\n\nThe remark came as the bench questioned why non-Muslims could not be part of Waqf advisory panels if the reverse was also not allowed.\n\nThe Chief Justice pointed out that as per the Act, eight members of the board are Muslims, and possibly only two are not. “Why not have Muslims also on the advisory board of Hindu endowments then?” he said.\n\nThe Solicitor General then suggested that by the same logic “this bench also cannot hear the case”.\n\nThe remark drew a fiery response from the Supreme Court bench.\n\n\"What! When we sit over here. We lose our religion. For us both sides are the same. How can you compare it with the judges?\" the Chief Justice said.\n\nJustice Viswanathan also noted that there were practical issues such as ingress and outgress in mosques, which is why familiarity with the premises might be relevant. The SG responded that such checks could be conducted by the Charity Commissioner.\n\nThe three-judge bench comprising CJI Khanna, Justice Sanjay Kumar, and Justice KV Viswanathan will continue the hearing tomorrow.ABOUT WAQF HEARING IN COURT\n\nThe Supreme Court on Wednesdayheard a batch of petitionschallenging the constitutional validity of the Waqf (Amendment) Act. The bench, led by Chief Justice Sanjiv Khanna, flagged concerns over the practicality of undoing waqf by user, especially for centuries-old masjids without registered sale deeds. The Court also questioned the composition of Waqf boards, which would include non-Muslim members following the amendment of Act.\n\nProviding interim relief, the Court said that properties declared as Waqf by courts should not be de-notified during the proceedings. It also stayed the provision that would prevent properties from being treated as Waqf while under investigation by the District Collector. The Court clarified that all Waqf board members must be Muslim, except ex-officio members. The hearing will continue tomorrow at 2 pm.Published By:Anuja JhaPublished On:Apr 16, 2025Tune InMust Watch"
      },
      {
        "title": "Will you allow Muslims on Hindu boards? Supreme Court questions Waqf composition",
        "author": "Unknown Author",
        "publication_date": "2025-04-16T16:47:23+05:30"
      }
    ],
    "authors": [],
    "source": "India Today",
    "image_url": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202504/nazriya-post-17322349-16x9_0.jpg?VersionId=Vx6NVVYqClh_eImJDvFZBhmMkc.BGSqL?size=1280:720",
    "url": "https://www.indiatoday.in/movies/regional-cinema/story/parvathy-samantha-nazriya-nazim-social-media-absence-emotional-well-being-2710339-2025-04-17"
  },
  "markdown_content": "## Court Proceedings\\nThe Supreme Court on Wednesday questioned the religious composition of Waqf board during a hearing on the constitutional validity of the Waqf (Amendment) Act, 2025. The inclusion of non-Muslim members in the Waqf board emerged as a major point of contention.\\n\\n## Key Exchange\\nChief Justice of India Sanjiv Khanna directly challenged Solicitor General Tushar Mehta, asking whether Muslims would be allowed to be part of Hindu endowment boards in return. The Chief Justice noted that according to the Act, eight members of the board are Muslims, with potentially only two non-Muslims.\\n\\nWhen the Solicitor General suggested that the bench itself couldn't hear the case by the same logic, it drew sharp criticism from the Chief Justice, who emphasized that \"judges lose their religious identity on the bench and treat all sides equally.\"\\n\\n## Interim Orders\\n* Properties declared as Waqf by courts should not be de-notified during proceedings\\n* Stayed provisions preventing properties from being treated as Waqf while under investigation by the District Collector\\n* Court clarified that all Waqf board members must be Muslim, except for ex-officio members\\n\\n## Next Hearing\\nThe three-judge bench, comprising CJI Khanna, Justice Sanjay Kumar, and Justice KV Viswanathan, will continue the hearing tomorrow at 2 pm."
}