{
  "title": "NASA developing 1st-ever space-based quantum sensor for gravity measurements",
  "publication_date": "2024-04-15T00:00:00Z",
  "summary": "NASA is developing an advanced quantum sensor called the Quantum Gravity Gradiometer Pathfinder for low Earth orbit that can detect minute changes in Earth's gravity. The compact device uses clouds of atoms cooled to near absolute zero to measure gravitational changes with extreme precision, potentially enabling mapping of underground features like aquifers and mineral deposits.",
  "content": "Scientists are developing an advanced quantum sensor for low Earth orbit that can detect the tiniest tremors in Earth's gravity. These barely perceptible shifts — caused by moving water, tectonic activity or shifting rock — offer clues about what lies beneath the planet's surface.\n\nThe new device could allow the mapping of underground features like aquifers and mineral deposits — crucial data for navigation, resource management and national security, its developers say.\n\nQuantum sensors, like the Quantum Gravity Gradiometer Pathfinder (QGGPf) instrument developed by JPL, private companies and academic institutions, use clouds of atoms dropped in freefall and cooled to near absolute zero. As they fall, lasers act like mirrors and splitters, separating the atoms and then bringing them back together. The way the atoms interfere when they recombine reveals how much they were accelerated by gravity, allowing scientists to measure the tiniest changes in gravity with extreme precision.\n\nBecause it uses atoms instead of bulky mechanical parts, the QGGPf sensor is surprisingly compact — about the size of a small washing machine — and weighs just 275 pounds (125 kilograms). That makes it much smaller and lighter than traditional space-based gravity instruments.\n\nNASA plans to give the new sensor an in-space test near the end of the decade. The technology demonstration mission will put a suite of cutting-edge tools to the test, pushing the limits of how light and atoms interact at the smallest scales.",
  "category": "Science",
  "tags": [
    "NASA",
    "quantum technology",
    "gravity",
    "space science",
    "sensors",
    "JPL",
    "Earth observation"
  ],
  "location": "Southern California",
  "source": {
    "title": "NASA developing 1st-ever space-based quantum sensor for gravity measurements",
    "publication_date": 1744907400,
    "content": [
      {
        "title": "NASA developing 1st-ever space-based quantum sensor for gravity measurements",
        "publication_date": "2025-04-17T22:00:00+00:00",
        "content": "\"We could determine the mass of the Himalayas using atoms.\"\n\nWhen you purchase through links on our site, we may earn an affiliate commission.Here’s how it works.\n\nScientists are developing an advanced quantum sensor for low Earth orbit that can detect the tiniest tremors in Earth's gravity.\n\nThese barely perceptible shifts — caused by moving water,tectonic activityor shifting rock — offer clues about what lies beneath the planet's surface.\n\nThe new device could allow the mapping of underground features like aquifers and mineral deposits — crucial data for navigation, resource management andnational security, its developers say.\n\n\"We could determine the mass of the Himalayas using atoms,\" Jason Hyon, chief technologist for Earth Science at NASA'sJet Propulsion Laboratoryin Southern California and director of JPL's Quantum Space Innovation Center, said in anApril 15 statement.\n\nRelated:How a quantum sensor on the ISS could revolutionize space exploration\n\nQuantum sensors, like the Quantum Gravity Gradiometer Pathfinder (QGGPf) instrument developed by JPL, private companies and academic institutions, use clouds of atoms dropped in freefall and cooled to nearabsolute zero.\n\nAs they fall, lasers act like mirrors and splitters, separating the atoms and then bringing them back together. The way the atoms interfere when they recombine reveals how much they were accelerated bygravity, allowing scientists to measure the tiniest changes in gravity with extreme precision.\n\nBreaking space news, the latest updates on rocket launches, skywatching events and more!\n\nThese cutting-edge tools, based on a technique called atom interferometry, are far more sensitive than traditional instruments — and they're still improving. Researchers are now refining the technology to make it even more accurate and durable.\n\n\"With atoms, I can guarantee that every measurement will be the same. We are less sensitive to environmental effects,\" Sheng-wey Chiow, an experimental physicist at JPL, said in the same statement.\n\n—New quantum computer smashes 'quantum supremacy' record by a factor of 100 — and it consumes 30,000 times less power\n\n—World's 1st fault-tolerant quantum computer launching this year ahead of a 10,000-qubit machine in 2026\n\n—'World's purest silicon' could lead to 1st million-qubit quantum computing chips\n\nBecause it uses atoms instead of bulky mechanical parts, the QGGPf sensor is surprisingly compact — about the size of a small washing machine — and weighs just 275 pounds (125 kilograms). That makes it much smaller and lighter than traditional space-based gravity instruments, which is a big advantage for space missions, where size, weight and launch costs are tightly constrained.\n\nNASA plans to give the new sensor an in-space test near the end of the decade. The technology demonstration mission will put a suite of cutting-edge tools to the test, pushing the limits of how light and atoms interact at the smallest scales.\n\n\"No one has tried to fly one of these instruments yet,\" said Ben Stray, a postdoctoral researcher at JPL. \"We need to fly it so that we can figure out how well it will operate, and that will allow us to not only advance the quantum gravity gradiometer, but also quantum technology in general.\"\n\nJoin our Space Forumsto keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at:community@space.com.\n\nA chemist turned science writer, Victoria Corless completed her Ph.D. in organic synthesis at the University of Toronto and, ever the cliché, realized lab work was not something she wanted to do for the rest of her days. After dabbling in science writing and a brief stint as a medical writer, Victoria joined Wiley’s Advanced Science Newswhere she works as an editor and writer. On the side, she freelances for various outlets, including Research2Reality and Chemistry World.\n\nPlease logout and then login again, you will then be prompted to enter your display name.\n\nSpace is part of Future US Inc, an international media group and leading digital publisher.Visit our corporate site.\n\n©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036."
      },
      {
        "title": "NASA developing 1st-ever space-based quantum sensor for gravity measurements",
        "author": "Unknown Author",
        "publication_date": "2025-04-17T22:00:00+00:00"
      }
    ],
    "authors": [
      "Victoria Corless"
    ],
    "source": "Space",
    "image_url": "https://cdn.mos.cms.futurecdn.net/WLYRwQGJVw8Wh9AtimHdGZ-1200-80.jpg",
    "url": "https://www.space.com/space-exploration/tech/nasa-developing-1st-ever-space-based-quantum-sensor-for-gravity-measurements"
  },
  "markdown_content": "## New Quantum Gravity Sensor Development\\n\\nScientists are developing an advanced quantum sensor for low Earth orbit that can detect the tiniest tremors in Earth's gravity. These barely perceptible shifts — caused by moving water, tectonic activity or shifting rock — offer clues about what lies beneath the planet's surface.\\n\\nThe new device could allow the mapping of underground features like aquifers and mineral deposits — crucial data for navigation, resource management and national security, its developers say.\\n\\n## Technical Details\\n\\nQuantum sensors, like the Quantum Gravity Gradiometer Pathfinder (QGGPf) instrument developed by JPL, private companies and academic institutions, use clouds of atoms dropped in freefall and cooled to near absolute zero. As they fall, lasers act like mirrors and splitters, separating the atoms and then bringing them back together. The way the atoms interfere when they recombine reveals how much they were accelerated by gravity, allowing scientists to measure the tiniest changes in gravity with extreme precision.\\n\\n## Design Specifications\\n\\n* Size comparable to a small washing machine\\n* Weight: 275 pounds (125 kilograms)\\n* Significantly smaller and lighter than traditional space-based gravity instruments\\n* Uses atoms instead of bulky mechanical parts\\n\\n## Future Plans\\n\\nNASA plans to give the new sensor an in-space test near the end of the decade. The technology demonstration mission will put a suite of cutting-edge tools to the test, pushing the limits of how light and atoms interact at the smallest scales."
}