{
  "title": "DUSU President Protests by Smearing Cow Dung on College Principal's Office Walls",
  "publication_date": "2025-04-15T23:52:25+05:30",
  "summary": "Delhi University Students' Union president Ronak Khatri smeared cow dung on Lakshmibai College principal Pratyush Vatsala's office walls in protest of her earlier application of cow dung on classroom walls. The principal claimed the initial cow dung application was part of a research project studying indigenous cooling methods, but Khatri argued this was done without student consent and raised concerns about basic facilities lacking in the college.",
  "content": "A controversy erupted at Delhi University's Lakshmibai College when Delhi University Students' Union (DUSU) president Ronak Khatri smeared cow dung on Principal Pratyush Vatsala's office walls in protest of her earlier actions.\n\nThe incident came after a viral video showed Principal Vatsala coating classroom walls with cow dung as part of what she described as a faculty-led research project on indigenous cooling methods. During a confrontation, Khatri told PTI, \"No consent was taken from students for such an initiative. If you want to do research, do it at your home.\"\n\nKhatri highlighted various infrastructure issues at the college, including lack of drinking water, absence of sanitary pad vending machines, and non-functional washrooms. He alleged that the principal had violated safety regulations, noting that the classroom in question had only one exit instead of the mandatory two.\n\nDefending her actions, Principal Vatsala explained to PTI that the cow dung plastering was part of an ongoing study examining heat-reducing properties of natural materials. \"It is under process. I will be able to share details of the full research after a week,\" she stated. She clarified that the experiment was limited to portacabins in the canteen block's second floor, used for some classes due to infrastructure constraints.\n\nThe administration maintained that the method is part of scientific inquiry into sustainable practices amid rising temperatures in the capital.",
  "category": "Education",
  "tags": [
    "education",
    "protest",
    "university",
    "Delhi University",
    "infrastructure",
    "research",
    "controversy"
  ],
  "location": "Delhi, India",
  "source": {
    "title": "DUSU President Ronak Khatri smeared cow dung on Lakshmibai College principal Pratyush Vatsala's office in protest against her applying it on classroom walls for a research project on cooling methods.",
    "url": "https://news.abplive.com/cities/dusu-president-smears-cow-dung-on-principal-office-wall-in-protest-against-viral-cooling-experiment-at-lakshmibai-college-watch-video-1765504",
    "created_utc": 1744961258.0,
    "subreddit": "india",
    "media": [
      "https://external-preview.redd.it/EnVl-KRXJhzajdMyfsXAkrv1stq3mrQc_9I6ZOb7sv0.jpg?auto=webp&s=38dd41d728e92bd3230c9fe4922648f969323848"
    ],
    "content": [
      {
        "title": "WATCH: DUSU President Smears Cow Dung On Principal’s Office Wall In Protest Against Viral Video",
        "publication_date": "2025-04-15T23:52:25+05:30",
        "content": "A controversy at Delhi University’s Lakshmibai College escalated on Tuesday after Delhi University Students’ Union (DUSU) president Ronak Khatri smeared cow dung on the office walls of the college principal, Pratyush Vatsala, in protest against her viral video applying cow dung on classroom walls as part of an alleged research experiment.\n\nIn a video that circulated widely on social media, Principal Vatsala was seen coating the classroom walls with cow dung, claiming the initiative was part of a faculty-led research project exploring indigenous and sustainable cooling methods.\n\nDuring an argument with a faculty member inside the principal’s office, Khatri told PTI, “No consent was taken from students for such an initiative. If you want to do research, do it at your home.”\n\nVIDEO | Delhi University Students Union (DUSU) president Ronak Khatri smears cow dung on the walls of the principal’s office at Lakshmibai College.(Full video available on PTI Videos -https://t.co/n147TvrpG7)pic.twitter.com/by5B6msIAl\n\nIn a video posted on his X account, the DUSU president highlighted his discussions with students. The video purportedly showed a lack of drinking water, no sanitary pad vending machines, no running water in washrooms, and infrastructural issues within classrooms.\n\nआज लक्ष्मीबाई कॉलेज में विभिन्न मुद्दों को लेकर छात्र शक्ति से मिलने और उनकी समस्याएं जानने का अवसर मिला। हम सभी ने मिलकर इन समस्याओं के समाधान पर भी चर्चा की।साथ ही, जब प्राचार्या मैडम के कार्यालय गए, तो वह नहीं मिलीं। लेकिन उनके कक्ष में छात्र शक्ति के साथ मिलकर गोबर लेप कर…pic.twitter.com/mouw5Tn0Pt\n\nAlso, when we went to the Principal Madam's office, she was not available. But we took her campaign forward by applying cow dung in her room along with the student power.\n\nJai Hind!\n\nPreviously, he further took to X (formerly Twitter), referencing the viral video and stating sarcastically, “We have full faith that madam will now get the AC removed from her room and hand it over to students, and run the college in this modern and natural cool environment smeared with cow dung.”\n\nकुछ दिन पहले आप सभी ने लक्ष्मीबाई कॉलेज की प्राचार्या का वो ऐतिहासिक वीडियो देखा होगा, जिसमें वो कक्षा में गोबर लीपती नज़र आई थीं!अब इस क्रांतिकारी पहल को आगे बढ़ाते हुए, मैं अपने साथियों के साथ गोबर लेकर मैडम के ऑफिस जाऊँगा और उनके प्राचार्य कक्ष को लीपने में पूरी मदद करूँगा।…pic.twitter.com/kdz4giCHnq\n\n“Is this the same condition in her own room? I went to check there, but this wasn’t the case. When she came to know that I was coming to her, she did not meet me in her room. Students told me that she left 15 minutes before I came there. She considers this college her experiment lab, so I did the same in her room,” Ronak Khatri told news agency ANI.\n\n#WATCH| DUSU president Ronak Khatri says, \"...Is this the same condition in her own room? I went to check there, but this wasn't the case. When she came to know that I was coming to her, she did not meet me in her room. Students told me that she left 15 minutes before I came…https://t.co/51aZ9UxIlBpic.twitter.com/8Nxqb4MmoL\n\nHe alleged that applying cow dung to classrooms without students’ permission was a violation. “How could they apply cow dung to a classroom without students’ permission?” he asked. Raising safety concerns, he added, “When I reached that classroom, I found that there was just one entry and exit. There should have been two. It is mandatory for portacabins, as per UGC rules. This lays the ground for FIR, my legal team is ready to take action.”\n\n“The students have complained one after another… Students of that college are distressed… I want to convey a message to the Ministry of Education that in these times, there is a dire need for there to be ACs in classrooms, these are mandatory for portacabins. The quicker the Government understands this, students will be able to study better,” Khatri said, announcing plans to file an FIR and take the matter to the High Court, alleging that the principal had violated rules.\n\nDefending her action, Principal Vatsala told PTI on April 13 that the cow dung plastering was part of an ongoing study to examine heat-reducing properties of natural materials. “It is under process. I will be able to share details of the full research after a week,” she said. She added that misinformation was being spread, stating, “There’s no harm in touching natural mud.”\n\nSpeaking to ANI, the principal said, “Yes, discussions were held with students… I wasn’t here. Someone texted me on WhatsApp that Ronak Khatri was coming to me but I had a pre-scheduled programme… I wasn’t here when he reached… Sometimes, students do something out of zeal. I will speak with my staff first and then make a decision if required… Let’s see…”\n\n#WATCH| Principal of Delhi University’s Lakshmibai College, Pratyush Vatsala says, \"Yes, discussions were held with students...I wasn't here. Someone texted me on WhatsApp that Ronak Khatri was coming to me but I had a pre-scheduled program...I wasn't here when he…https://t.co/51aZ9UxIlBpic.twitter.com/QyZXV1rGdb\n\nVatsala clarified that the experiment was limited to portacabins located in the canteen block’s second floor, which are used for holding a few classes due to infrastructure constraints. “Those rooms look a little neglected. There are fans. We were sitting with EVS faculty to find out some local solutions… So, we started a study to control heat stress. Researches have been done on cow dung earlier as well. So, in that background, since there was no plaster in portacabins and it is located on the second floor, we thought of preparing something with cow dung by mixing it with mud to see the cooling effect,” she said.\n\n#WATCH| Principal of Delhi University’s Lakshmibai College, Pratyush Vatsala says, \"Those are portacabins in the canteen block, on the second floor...A few classes are held there as last option. Infrastructure has also come up in last 10 years. Still, the number of students is…https://t.co/qT2oZlhD3Zpic.twitter.com/ISuVzdVrnZ\n\nShe added, “As far as my video is concerned, it was a holiday… To ensure that the children did not get disturbed in the middle of their classes, we did it in those days. I thought I, too, should join in… So I went ahead. I shared it with our internal faculty group. I wrote that these are some ‘desi’ efforts to ensure that there is some comfort in those rooms. I can’t say who shared it from the faculty group and with what intention.”\n\nAccording to PTI, the administration maintained that the method is part of scientific inquiry into sustainable practices amid rising temperatures in the capital.\n\nWe use cookies to improve your experience, analyze traffic, and personalize content. By clicking \"Allow\", you agree to our use of cookies."
      },
      {
        "title": "WATCH: DUSU President Smears Cow Dung On Principal’s Office Wall In Protest Against Viral Video",
        "author": "ABP Live News",
        "publication_date": "2025-04-15T23:52:25+05:30"
      }
    ]
  },
  "markdown_content": "## Incident Details\\nA controversy erupted at Delhi University's Lakshmibai College when Delhi University Students' Union (DUSU) president Ronak Khatri smeared cow dung on Principal Pratyush Vatsala's office walls in protest of her earlier actions.\\n\\nThe incident came after a viral video showed Principal Vatsala coating classroom walls with cow dung as part of what she described as a faculty-led research project on indigenous cooling methods.\\n\\n## Student Response\\n> \"No consent was taken from students for such an initiative. If you want to do research, do it at your home,\" Khatri told PTI.\\n\\nKhatri highlighted various infrastructure issues at the college:\\n* Lack of drinking water\\n* Absence of sanitary pad vending machines\\n* Non-functional washrooms\\n\\nHe alleged that the principal had violated safety regulations, noting that the classroom in question had only one exit instead of the mandatory two.\\n\\n## Principal's Defense\\n> \"It is under process. I will be able to share details of the full research after a week,\" Principal Vatsala stated to PTI.\\n\\nDefending her actions, Principal Vatsala explained that the cow dung plastering was part of an ongoing study examining heat-reducing properties of natural materials. She clarified that the experiment was limited to portacabins in the canteen block's second floor, used for some classes due to infrastructure constraints.\\n\\nThe administration maintained that the method is part of scientific inquiry into sustainable practices amid rising temperatures in the capital."
}