{
  "title": "Indian economy expanded by 8.4% in final three months of 2023",
  "publication_date": "2024-03-01T00:00:00Z",
  "summary": "India's economy showed remarkable growth in Q4 2023, with GDP rising 8.4% year-over-year, driven primarily by strong manufacturing performance according to official government data.",
  "content": "A boom in manufacturing helped propel India's economy to significant growth in the October to December quarter of 2023, with annual GDP expanding 8.4% compared to the same period in 2022, according to official government figures.\n\nThe impressive growth rate underscores India's position as one of the world's fastest-growing major economies, outpacing other large nations. Manufacturing played a key role in this expansion, demonstrating the country's increasing industrial capacity.\n\nThe GDP figures exceeded most economists' expectations and suggest strong domestic demand and industrial activity despite global economic headwinds.",
  "category": "Business",
  "tags": [
    "economy",
    "india",
    "gdp",
    "manufacturing",
    "economic growth",
    "business"
  ],
  "location": "India",
  "source": {
    "title": "Indian economy expanded by 8.4% in final three months of 2023",
    "publication_date": 1709274420,
    "content": "A boom in manufacturing helped India's economy surge in the October to December quarter of 2023 with annual GDP up 8.4% compared with the same period in 2022, official government figures show. File photo by Jeff Kowalsky/UPI\nMarch 1 (UPI) -- A boom i... [2481 chars]",
    "source": "UPI News",
    "authors": [],
    "image_url": "https://cdnph.upi.com/sv/ph/og/i/5661709284745/2024/1/17092932262891/v1.5/Indian-economy-expanded-by-84-in-final-three-months-of-2023.jpg",
    "url": "https://www.upi.com/Top_News/World-News/2024/03/01/India-Q4-economic-growth-jumps-84/5661709284745/"
  },
  "markdown_content": "## Economic Performance\\n\\nManufacturing boom propelled India's economy to significant growth in the October to December quarter of 2023, with annual GDP expanding 8.4% compared to the same period in 2022, according to official government figures.\\n\\nThe impressive growth rate underscores India's position as one of the world's fastest-growing major economies, outpacing other large nations. Manufacturing played a key role in this expansion, demonstrating the country's increasing industrial capacity.\\n\\nThe GDP figures exceeded most economists' expectations and suggest strong domestic demand and industrial activity despite global economic headwinds."
}