{
  "title": "NASA safety panel warns of increasing risks to ISS operations",
  "publication_date": "2024-04-17T00:00:00Z",
  "summary": "NASA's Aerospace Safety Advisory Panel expressed deep concerns about the International Space Station's safety, citing aging infrastructure, ongoing leaks in the Zvezda module, deorbit planning challenges, and significant budget shortfalls. The panel warns that the ISS has entered its riskiest period as it approaches its projected end in 2030.",
  "content": "Members of a NASA safety panel said they were \"deeply concerned\" about the safety of the aging International Space Station, citing long-running issues and funding shortfalls.\n\nDuring a public meeting of the Aerospace Safety Advisory Panel (ASAP) April 17, members expressed concerns about growing risks as the station nears its projected end in 2030. Rich Williams, a panel member, stated that \"the ISS has entered the riskiest period of its existence.\"\n\nOngoing problems include leaks in the Zvezda module's PrK vestibule, where Russian and American experts have been investigating small cracks for several years without resolution. Officials from NASA and Roscosmos are scheduled to meet in Moscow to discuss risk mitigation efforts.\n\nAnother significant concern is the development of deorbit plans, particularly in emergency scenarios before the arrival of the U.S. Deorbit Vehicle (USDV) being built by SpaceX. The station also faces challenges with maintaining sufficient spare parts and delays in cargo resupply missions.\n\nThe panel highlighted a substantial ISS budget shortfall as an overarching issue. NASA's fiscal year 2024 operating plan allocated $993 million to ISS operations and maintenance, with $1.63 billion for crew and cargo transportation. The ASAP warns that funding for the USDV and supporting infrastructure could strain NASA's ability to safely manage ISS operations.\n\nWilliams emphasized the importance of maintaining adequate budget and resources until the vehicle's safe reentry, despite the temptation to reduce resources as programs near their final phases.",
  "category": "Science",
  "tags": [
    "NASA",
    "International Space Station",
    "space",
    "aerospace",
    "safety",
    "budget",
    "SpaceX",
    "Roscosmos"
  ],
  "location": "Washington, United States",
  "source": {
    "title": "NASA safety panel warns of increasing risks to ISS operations",
    "publication_date": 1744922946,
    "content": [
      {
        "title": "NASA safety panel warns of increasing risks to ISS operations",
        "publication_date": "2025-04-18T02:19:06+00:00",
        "content": "SpaceNews\n\nCovering the business and politics of space\n\nWASHINGTON — Members of a NASA safety panel said they were “deeply concerned” about the safety of the aging International Space Station, citing long-running issues and funding shortfalls.\n\nDuring a public meeting of the Aerospace Safety Advisory Panel (ASAP) April 17, members expressed concerns about growing risks as the station nears its projected end in 2030.\n\n“The ISS has entered the riskiest period of its existence,” said Rich Williams, a member of the panel, arguing there were “increasing risks” to the station.\n\nSome of those risks are problems the station has been facing for years, such as leaks in a vestibule of the station’s Zvezda module called PrK. Russian and American experts have been investigating small cracks seen in PrK for several years,with no resolution on their cause or how to best address them.\n\nSign up for The China Report\n\nBeginning this spring, Andrew Jones will be explaining the business, politics and technology in Chinese space activities as part of a new biweekly newsletter.\n\nBy submitting this form, you agree to the SpaceNews Privacy Policy and Terms and Conditions and to receive email from us. You can opt-out at any time.\n\nWilliams said officials from NASA and Roscosmos are scheduled to meet later this month in Moscow to update efforts to mitigate risks on the cracking. In the meantime, he said ISS managers have implemented procedures such as limiting repressurization of the vestibule, which links a docking port to the rest of the station. “The panel has considered this one of our highest concerns,” he said.\n\nAnother concern is developing deorbit plans for the ISS, particularly in an emergency before its scheduled retirement at the end of the decade before the arrival of the U.S. Deorbit Vehicle (USDV) that NASA has contracted SpaceX to build. “If there is a deorbit of the ISS before the USDV is delivered, the risk to the public from ISS breakup debris will increase by orders of magnitude,” Williams said.\n\nThe station is dealing with several other issues, such as keeping sufficient spare parts for life support systems and delays with cargo resupply vehicles. That latter concern involves both the delays in the first flight of Sierra Space’s Dream Chaser vehicle, now expected no earlier than late summer. and Northrop Grumman scrapping its NG-22 Cygnus mission to the ISS, which was scheduled to launch in June,because of damage to the spacecraft incurred during shipping.\n\n“Overarching all of these risks is a large ISS budget shortfall,” Williams said. “All of these risks are actually a derivative of this budget shortfall and collectively contribute to potential compromise of the low Earth orbit transition plan.”\n\nHe did not elaborate on the nature of the budget shortfall ASAP perceives in ISS operations. In the agency’s fiscal year 2024 operating plan, NASA allocated $993 million to ISS operations and maintenance, with more than $1.63 billion to crew and cargo transportation. In 2023, NASA spent $1.03 billion on ISS operations and maintenance and $1.64 billion on crew and cargo transportation.\n\nASAP, in its 2024 annual report, warned that ISS operations could face budget pressures from the costs of building the USDV and funding needed for supporting commercial space stations. “The Panel has grave concerns, however, that if the necessary funds for both the USDV and the supporting launch infrastructure (over $1B in total) comes solely from the existing ISS budget, this will unduly strain NASA’s ability to safely perform normal and contingency ISS on-orbit operations,” it stated.\n\n“As programs near final phases, it is tempting to assume less resources will need to be available,” Williams said. “For the ISS, it is critical to maintain adequate budget and resources until the vehicle is safely reentered.”\n\n“The panel appreciates the demonstrated operational excellence of the ISS program, but remains deeply concerned about the increasing and cascading risk attending the program over the next several years,” he concluded.\n\nJeff Foust writes about space policy, commercial space, and related topics for SpaceNews.\n\nHe earned a Ph.D. in planetary sciences from the Massachusetts Institute of Technology and a bachelor’s degree with honors in geophysics and planetary science...More by Jeff Foust\n\nBack to top"
      },
      {
        "title": "NASA safety panel warns of increasing risks to ISS operations",
        "author": "Unknown Author",
        "publication_date": "2025-04-18T02:19:06+00:00"
      }
    ],
    "authors": [
      "Jeff Foust"
    ],
    "source": "SpaceNews",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/04/54193905419_090d981511_k.jpg?fit=1200%2C800&quality=89&ssl=1",
    "url": "https://spacenews.com/nasa-safety-panel-warns-of-increasing-risks-to-iss-operations/"
  },
  "markdown_content": "## Safety Concerns\\n\\nMembers of a NASA safety panel said they were \"deeply concerned\" about the safety of the aging International Space Station, citing long-running issues and funding shortfalls.\\n\\nDuring a public meeting of the Aerospace Safety Advisory Panel (ASAP) April 17, members expressed concerns about growing risks as the station nears its projected end in 2030.\\n\\n> The ISS has entered the riskiest period of its existence.\\n\\n## Technical Issues\\n\\n* Leaks in the Zvezda module's PrK vestibule\\n* Small cracks being investigated by Russian and American experts for several years\\n* Development challenges with deorbit plans\\n* Maintenance of sufficient spare parts\\n* Delays in cargo resupply missions\\n\\n## Budget Constraints\\n\\nNASA's fiscal year 2024 operating plan includes:\\n* $993 million for ISS operations and maintenance\\n* $1.63 billion for crew and cargo transportation\\n\\nThe ASAP warns that funding for the U.S. Deorbit Vehicle (USDV) and supporting infrastructure could strain NASA's ability to safely manage ISS operations.\\n\\n## Future Operations\\n\\nOfficials from NASA and Roscosmos are scheduled to meet in Moscow to discuss risk mitigation efforts. Williams emphasized the importance of maintaining adequate budget and resources until the vehicle's safe reentry, despite the temptation to reduce resources as programs near their final phases."
}