{
  "title": "5 things to know about tariffs and how they work",
  "publication_date": "2025-03-04T16:49:20-04:00",
  "summary": "A comprehensive overview of tariffs, explaining their function, implementation, and impact on international trade. The article discusses how tariffs are collected, their varying rates, Trump's stance on tariffs, their economic effects, and their historical significance as a revenue source for the US government.",
  "content": "Tariffs are typically charged as a percentage of the price a buyer pays a foreign seller, collected by Customs and Border Protection agents at 328 ports of entry across the United States. U.S. tariff rates vary, with 2.5 percent on passenger cars and 6 percent on golf shoes, though rates can be lower for countries with trade agreements.\n\nMainstream economists generally view tariffs skeptically, considering them inefficient for revenue generation. While Trump claims foreign countries pay tariffs, it's actually American importers who pay, often passing costs to consumers through higher prices.\n\nTariffs can impact foreign countries by making their products more expensive and harder to sell abroad. A study by Yang Zhou found Trump's tariffs caused three times more damage to the Chinese economy than to the U.S. economy.\n\nHistorically, before the 1913 federal income tax, tariffs were a major government revenue source, accounting for 90 percent of federal revenue from 1790 to 1860. Today, tariffs generate relatively modest revenue compared to income and Social Security taxes.\n\nTariffs can also serve as diplomatic leverage. However, they often provoke retaliation, as seen when the EU responded to Trump's steel tariffs by taxing U.S. products. Studies suggest Trump's tariffs failed to significantly boost U.S. employment but succeeded politically in regions most affected by them.",
  "category": "Business",
  "tags": [
    "economics",
    "international trade",
    "tariffs",
    "Trump",
    "trade policy",
    "customs",
    "federal revenue",
    "international relations"
  ],
  "location": "United States",
  "source": {
    "title": "5 things to know about tariffs and how they work",
    "publication_date": 1741055400,
    "content": [
      {
        "title": "5 things to know about tariffs and how they work",
        "publication_date": "2025-03-04T16:49:20-04:00",
        "content": "Thank you. Please check your inbox to confirm.\n\nPaul Wiseman, Associated PressPaul Wiseman, Associated Press\n\nLeave your feedback\n\nWASHINGTON (AP) — Tariffs are in the news at the moment. Here’s what they are and what you need to know about them.\n\nTariffs are typically charged as a percentage of the price a buyer pays a foreign seller. In the United States, tariffs are collected by Customs and Border Protection agents at 328 ports of entry across the country.\n\nREAD MORE:A timeline of Trump’s tariff actions so far\n\nU.S. tariff rates vary: They are generally 2.5 percent on passenger cars, for instance, and 6 percent on golf shoes. Tariffs can be lower for countries with which the United States has trade agreements. Before the U.S. began imposing 25 percent tariffs on good from Canada and Mexico as of Tuesday, most goods moved between the United States and those countries tariff-free because of President Donald Trump’s U.S.-Mexico-Canada trade agreement.\n\nMainstream economists are generally skeptical about tariffs, considering them an inefficient way for governments to raise revenue.\n\nTrump is a proponent of tariffs, insisting that they are paid for by foreign countries. In fact, it is importers — American companies — that pay tariffs, and the money goes to the U.S. Treasury. Those companies typically pass their higher costs on to their customers in the form of higher prices. That’s why economists say consumers usually end up footing the bill for tariffs.\n\nREAD MORE:How soon will prices rise? 4 questions about Trump’s reciprocal tariffs, answered\n\nStill, tariffs can hurt foreign countries by making their products pricier and harder to sell abroad. Foreign companies might have to cut prices — and sacrifice profits — to offset the tariffs and try to maintain their market share in the United States. Yang Zhou, an economist at Shanghai’s Fudan University, concluded in a study that Trump’s tariffs on Chinese goods inflicted more than three times as much damage to the Chinese economy as they did to the U.S. economy.\n\nTrump has said tariffs will create more factory jobs, shrink the federal deficit, lower food prices and allow the government to subsidize childcare.\n\n“Tariffs are the greatest thing ever invented,’’ Trump said at a rally in Flint, Michigan, during his presidential campaign.\n\nDuring his first term, Trump imposed tariffs with a flourish — targeting imported solar panels, steel, aluminum and pretty much everything from China.\n\nWATCH:Trump announces broad tariffs at ‘Liberation Day’ White House event\n\n“Tariff Man,” he called himself.\n\nTrump is moving ahead with higher tariffs in his second term.\n\nThe United States in recent years has gradually retreated from its post-World War II role of promoting global free trade and lower tariffs. That’s generally a response to the loss of U.S. manufacturing jobs, widely attributed to unfettered tree trade and and China’s ascent as a manufacturing power.\n\nBy raising the price of imports, tariffs can protect home-grown manufacturers. They may also serve to punish foreign countries for unfair trade practices such as subsidizing their exporters or dumping products at unfairly low prices.\n\nBefore the federal income tax was established in 1913, tariffs were a major revenue source for the government. From 1790 to 1860, tariffs accounted for 90 percent of federal revenue, according to Douglas Irwin, a Dartmouth College economist who has studied the history of trade policy.\n\nWATCH:Senate passes resolution to undo Trump’s Canada tariffs in rare Republican rebuke\n\nTariffs fell out of favor as global trade grew after World War II. The government needed vastly bigger revenue streams to finance its operations.\n\nIn the fiscal year that ended Sept. 30, the government collected around $80 billion in tariffs and fees, a trifle next to the $2.5 trillion that comes from individual income taxes and the $1.7 trillion from Social Security and Medicare taxes.\n\nStill, Trump favors a budget policy that resembles what was in place in the 19th century.\n\nTariffs can also be used to pressure other countries on issues that may or may not be related to trade. In 2019, for example, Trump used the threat of tariffs as leverage to persuade Mexico to crack down on waves of Central American migrants crossing Mexican territory on their way to the United States.\n\nTrump even sees tariffs as a way to prevent wars.\n\nWATCH:A look inside Canada’s last-minute efforts to avert Trump’s steep tariffs\n\n“I can do it with a phone call,” he said at an August rally in North Carolina.\n\nIf another country tries to start a war, he said he’d issue a threat:\n\n“We’re going to charge you 100 percent tariffs. And all of a sudden, the president or prime minister or dictator or whoever the hell is running the country says to me, ‘Sir, we won’t go to war.’ ”\n\nTariffs raise costs for companies and consumers that rely on imports. They’re also likely to provoke retaliation.\n\nThe European Union, for example, punched back against Trump’s tariffs on steel and aluminum by taxing U.S. products, from bourbon to Harley-Davidson motorcycles. Likewise, China has responded to Trump’s trade war by slapping tariffs on American goods, including soybeans and pork in a calculated drive to hurt his supporters in farm country.\n\nA study by economists at the Massachusetts Institute of Technology, the University of Zurich, Harvard and the World Bank concluded that Trump’s tariffs failed to restore jobs to the American heartland. The tariffs “neither raised nor lowered U.S. employment’’ where they were supposed to protect jobs, the study found.\n\nREAD MORE:Dow tumbles more than 1,600 the day after Trump’s major tariff announcement\n\nDespite Trump’s 2018 taxes on imported steel, for example, the number of jobs at U.S. steel plants barely budged: They remained right around 140,000. By comparison, Walmart alone employs 1.6 million people in the United States.\n\nWorse, the retaliatory taxes imposed by China and other nations on U.S. goods had “negative employment impacts,’’ especially for farmers, the study found. These retaliatory tariffs were only partly offset by billions in government aid that Trump doled out to farmers. The Trump tariffs also damaged companies that relied on targeted imports.\n\nIf Trump’s trade war fizzled as policy, though, it succeeded as politics. The study found that support for Trump and Republican congressional candidates rose in areas most exposed to the import tariffs — the industrial Midwest and manufacturing-heavy Southern states like North Carolina and Tennessee.\n\nYour tax-deductible donation ensures our vital reporting continues to thrive. Support PBS News Hour now.\n\nLeft:The border wall is shown in a background as a semi-truck crosses a bridge after clearing U.S. Customs while entering the United States from Mexico along the border in San Diego, California, on March 4, 2025. Photo by Mike Blake/ Reuters\n\nByJosh Boak, Paul Wiseman, Rob Gillies, Associated Press\n\nByJosh Boak, Zeke Miller, Rob Gillies, Associated Press\n\nByStan Choe, Associated Press\n\nByAssociated Press\n\nByJosh Boak, Associated Press\n\nByJosh Boak, Fabiola Sanchez, Associated Press\n\nPaul Wiseman, Associated PressPaul Wiseman, Associated Press\n\nSupport Provided By:Learn more\n\nSupport PBS News:\n\nSubscribe to Here’s the Deal, our politics\n                 newsletter for analysis you won’t find anywhere else.\n\nThank you. Please check your inbox to confirm.\n\n© 1996 - 2025 NewsHour Productions LLC. All Rights Reserved.\n\nPBS is a 501(c)(3) not-for-profit organization.\n\nSections\n\nAbout\n\nStay Connected\n\nSubscribe to Here's the Deal with Lisa Desjardins\n\nThank you. Please check your inbox to confirm.\n\nLearn more about Friends of the News Hour.\n\nSupport for News Hour Provided By"
      },
      {
        "title": "5 things to know about tariffs and how they work",
        "author": "Unknown Author",
        "publication_date": "2025-03-04T16:49:20-04:00"
      }
    ],
    "authors": [
      "Paul Wiseman"
    ],
    "source": "PBS",
    "image_url": "https://d3i6fh83elv35t.cloudfront.net/static/2025/03/2025-03-04T202754Z_137220116_RC2I6DAESTWF_RTRMADP_3_USA-TRUMP-TARRIFS-1024x683.jpg",
    "url": "https://www.pbs.org/newshour/economy/5-things-to-know-about-tariffs-and-how-they-work"
  },
  "markdown_content": "## How Tariffs Work\\nTariffs are typically charged as a percentage of the price a buyer pays a foreign seller, collected by Customs and Border Protection agents at 328 ports of entry across the United States. U.S. tariff rates vary, with 2.5 percent on passenger cars and 6 percent on golf shoes, though rates can be lower for countries with trade agreements.\\n\\n## Economic Impact\\nMainstream economists generally view tariffs skeptically, considering them inefficient for revenue generation. While Trump claims foreign countries pay tariffs, it's actually American importers who pay, often passing costs to consumers through higher prices.\\n\\nTariffs can impact foreign countries by making their products more expensive and harder to sell abroad. A study by Yang Zhou found Trump's tariffs caused three times more damage to the Chinese economy than to the U.S. economy.\\n\\n## Historical Context\\nHistorically, before the 1913 federal income tax, tariffs were a major government revenue source, accounting for 90 percent of federal revenue from 1790 to 1860. Today, tariffs generate relatively modest revenue compared to income and Social Security taxes.\\n\\n## Diplomatic Effects\\nTariffs can also serve as diplomatic leverage. However, they often provoke retaliation, as seen when the EU responded to Trump's steel tariffs by taxing U.S. products. Studies suggest Trump's tariffs:\\n* Failed to significantly boost U.S. employment\\n* Succeeded politically in regions most affected by them"
}