{
  "title": "Study links climate change with rising arsenic levels in rice increasing cancer risks for Asians",
  "publication_date": "2024-04-18T00:00:00Z",
  "summary": "A study published in The Lancet Planetary Health reveals that climate change could increase arsenic levels in rice, posing elevated cancer risks for Asian populations by 2050. Research shows that rising temperatures and CO2 levels cause changes in soil chemistry, leading to higher arsenic absorption in rice grains, particularly affecting South and Southeast Asian countries where rice is a dietary staple.",
  "content": "New research from Columbia University suggests that climate change could be leading to dangerous increases in arsenic levels in rice, particularly threatening Asian populations. The study, published in The Lancet Planetary Health journal, demonstrates how rising temperatures and carbon dioxide levels are altering soil chemistry to favor increased arsenic absorption in rice grains.\n\nResearchers found that temperature and CO2 work synergistically to increase arsenic concentrations in rice, potentially leading to millions of cancer cases in Asian countries by 2050. The study examined 28 rice strains over a decade, focusing on seven Asian countries including Bangladesh, China, India, Indonesia, Myanmar, the Philippines, and Vietnam.\n\nThe health implications are significant, with increased exposure to arsenic linked to lung, bladder, and skin cancers, as well as heart disease and diabetes. China alone is projected to see 13.4 million cancer cases attributable to arsenic in rice by 2050.\n\nDr. Lewis Ziska, associate professor at Columbia University, emphasized that these changes could substantially increase the global burden of cancer and other arsenic-related health issues. The research team suggests implementing measures such as breeding plants to minimize arsenic uptake and improving soil management in rice paddies to reduce exposure.",
  "category": "Science",
  "tags": [
    "climate change",
    "public health",
    "cancer",
    "agriculture",
    "food safety",
    "environmental science",
    "Asia"
  ],
  "location": "Asia",
  "source": {
    "title": "Study links climate change with rising arsenic levels in rice increasing cancer risks for Asians",
    "publication_date": 1744955620,
    "content": [
      {
        "title": "Study links climate change with rising arsenic levels in rice increasing cancer risks for Asians",
        "publication_date": "Unknown",
        "content": "New Delhi, Apr 18 (PTI) Climate change could be resulting in higher levels of arsenic in rice, potentially increasing lifetime cancer and health risks for people in Asian countries by 2050, according to a new study published in The Lancet Planetary Health journal.Researchers from Columbia University, US, explained that an increase in temperatures above 2 degrees Celsius and rising levels of carbon dioxide could be causing changes in soil chemistry, favouring arsenic, which gets more easily absorbed into a rice grain.Contaminated soil and irrigated water while growing rice are known to increase inorganic arsenic in rice.An increased exposure to arsenic is known to heighten the risk of cancers of the lung, bladder and skin, among others. Rice can also absorb additional arsenic from water used for cooking.\"Our results suggest that this increase in arsenic levels could significantly elevate the incidence of heart disease, diabetes, and other non-cancer health effects,\" author Lewis Ziska, associate professor of environmental health sciences, Columbia University, said.\"As rice is a dietary staple in many parts of the world, these changes could lead to a substantial rise in the global burden of cancer, cardiovascular diseases, and other arsenic-related health issues,\" Ziska said.Studies have revealed rice consumption to be a major health threat to people in South and Southeast Asian countries, including India, Bangladesh, Nepal, Thailand and Vietnam, where rice is the staple food.The combined effects of rising CO2 and temperatures on arsenic accumulation in rice have not been studied in detail until now, the team said.In this study, the researchers measured the effects of rising temperatures and carbon dioxide on 28 rice strains over 10 years in the field. Using models, inorganic arsenic doses and health risks for seven Asian countries -- Bangladesh, China, India, Indonesia, Myanmar, the Philippines, and Vietnam -- were estimated.\"We found that temperature and CO2 act synergistically to increase arsenic concentrations in rice, compounding dietary arsenic exposures for rice consumers and leading to projected cancer cases in the tens of millions among populations of Asian countries in 2050,\" according to the study.Projected average cases of bladder and lung cancer in 2050 were found to increase in proportion with exposure to arsenic, with the highest risk projections (44 per cent) seen for rising temperatures and carbon dioxide levels.China was projected to see 1.34 crore cases of cancer attributable to arsenic in rice in 2050 -- the highest among the seven countries studied.\"Emerging evidence also suggests that arsenic exposure may be linked to diabetes, adverse pregnancy outcomes, neurodevelopmental issues, and immune system effects,\" Ziska said.The authors suggested measures to reduce arsenic exposure, including breeding plants to minimise arsenic uptake and improved soil management in rice paddies, along with public health initiatives.\n\n(This story has not been edited by THE WEEK and is auto-generated from PTI)\n\n'Women said miscreants attacked...': What West Bengal Governor Ananda Bose said after meeting Murshidabad riot victims\n\nMS Dhoni's CSK gets 'Baby ABD': IPL strugglers sign South African Dewald Brevis, here are his T20 stats | IPL 2025\n\nWhat Kamal Haasan loved about Joju George at the sets of 'Thug Life'\n\nWill Modi meeting Elon Musk help Starlink's chances in India?\n\nAlien life spotted on Planet K2-18 explained: What's the JWST-Cambridge molecule buzz all about?\n\nCopyright © 2024 All rights reserved"
      },
      {
        "title": "Study links climate change with rising arsenic levels in rice increasing cancer risks for Asians",
        "author": "Unknown Author",
        "publication_date": "Unknown"
      }
    ],
    "authors": [],
    "source": "theweek.in",
    "image_url": "https://www.theweek.in/content/dam/week/wire-updates/pti-preview-theweek.jpg.transform/schema-1x1/image.jpg",
    "url": "https://www.theweek.in/wire-updates/national/2025/04/18/lst3-research-warming-arsenic.html"
  },
  "markdown_content": "## Research Findings\\nClimate change could be leading to dangerous increases in arsenic levels in rice, particularly threatening Asian populations, according to new research from Columbia University. The study, published in *The Lancet Planetary Health* journal, demonstrates how rising temperatures and carbon dioxide levels are altering soil chemistry to favor increased arsenic absorption in rice grains.\\n\\nResearchers found that temperature and CO2 work synergistically to increase arsenic concentrations in rice, potentially leading to millions of cancer cases in Asian countries by 2050. The study examined 28 rice strains over a decade, focusing on seven Asian countries including:\\n* Bangladesh\\n* China\\n* India\\n* Indonesia\\n* Myanmar\\n* Philippines\\n* Vietnam\\n\\n## Health Implications\\nThe health implications are significant, with increased exposure to arsenic linked to:\\n* Lung cancer\\n* Bladder cancer\\n* Skin cancer\\n* Heart disease\\n* Diabetes\\n\\nChina alone is projected to see 13.4 million cancer cases attributable to arsenic in rice by 2050.\\n\\n## Expert Response\\n> These changes could substantially increase the global burden of cancer and other arsenic-related health issues.\\n\\nDr. Lewis Ziska, associate professor at Columbia University, and his research team suggest implementing measures such as:\\n* Breeding plants to minimize arsenic uptake\\n* Improving soil management in rice paddies to reduce exposure"
}