{
  "title": "Google's Gemini 2.5 Flash introduces 'thinking budgets' that cut AI costs by 600% when turned down",
  "publication_date": "2025-04-17T23:27:30+00:00",
  "summary": "Google has launched Gemini 2.5 Flash, featuring a new \"thinking budget\" mechanism that allows developers to control AI computational power allocation. The system enables cost reduction by up to 600% when reasoning capabilities are turned down. The model charges $0.15 per million input tokens, with output costs ranging from $0.60 to $3.50 per million tokens depending on reasoning settings.",
  "content": "Google has launched Gemini 2.5 Flash, a major upgrade to its AI lineup that gives businesses and developers unprecedented control over how much \"thinking\" their AI performs. The new model, released today in preview through Google AI Studio and Vertex AI, represents a strategic effort to deliver improved reasoning capabilities while maintaining competitive pricing in the increasingly crowded AI market.\n\nThe model introduces what Google calls a \"thinking budget\" — a mechanism that allows developers to specify how much computational power should be allocated to reasoning through complex problems before generating a response. This approach aims to address a fundamental tension in today's AI marketplace: more sophisticated reasoning typically comes at the cost of higher latency and pricing.\n\nThe new pricing structure highlights the cost of reasoning in today's AI systems. When using Gemini 2.5 Flash, developers pay $0.15 per million tokens for input. Output costs vary dramatically based on reasoning settings: $0.60 per million tokens with thinking turned off, jumping to $3.50 per million tokens with reasoning enabled.\n\nThe thinking budget can be adjusted from 0 to 24,576 tokens, operating as a maximum limit rather than a fixed allocation. According to Google, the model intelligently determines how much of this budget to use based on the complexity of the task, preserving resources when elaborate reasoning isn't necessary.\n\nGoogle claims Gemini 2.5 Flash demonstrates competitive performance across key benchmarks while maintaining a smaller model size than alternatives. On Humanity's Last Exam, it scored 12.1%, outperforming several competitors though falling short of OpenAI's o4-mini.\n\nThe model's ability to determine appropriate reasoning levels based on query complexity is a key innovation. Simple questions require minimal reasoning, while complex problems automatically engage deeper thinking processes.\n\nThe release comes amid Google's aggressive moves in the AI space, including free Gemini Advanced access for U.S. college students until spring 2026, reflecting their strategy to compete with OpenAI's ChatGPT in the market.",
  "category": "Technology",
  "tags": [
    "artificial intelligence",
    "Google",
    "Gemini",
    "cloud computing",
    "machine learning",
    "business technology",
    "cost optimization"
  ],
  "location": "unknown",
  "source": {
    "title": "Google's Gemini 2.5 Flash introduces 'thinking budgets' that cut AI costs by 600% when turned down",
    "publication_date": 1744912650,
    "content": [
      {
        "title": "Google’s Gemini 2.5 Flash introduces ‘thinking budgets’ that cut AI costs by 600% when turned down",
        "publication_date": "2025-04-17T23:27:30+00:00",
        "content": "Join our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage.Learn More\n\nGooglehas launchedGemini 2.5 Flash, a major upgrade to its AI lineup that gives businesses and developers unprecedented control over how much “thinking” their AI performs. The new model, released today in preview throughGoogle AI StudioandVertex AI, represents a strategic effort to deliver improved reasoning capabilities while maintaining competitive pricing in the increasingly crowded AI market.\n\nThe model introduces what Google calls a “thinking budget” — a mechanism that allows developers to specify how much computational power should be allocated to reasoning through complex problems before generating a response. This approach aims to address a fundamental tension in today’s AI marketplace: more sophisticated reasoning typically comes at the cost of higher latency and pricing.\n\n“We know cost and latency matter for a number of developer use cases, and so we want to offer developers the flexibility to adapt the amount of the thinking the model does, depending on their needs,” said Tulsee Doshi, Product Director for Gemini Models at Google DeepMind, in an exclusive interview with VentureBeat.\n\nThis flexibility reveals Google’s pragmatic approach to AI deployment as the technology increasingly becomes embedded in business applications where cost predictability is essential. By allowing the thinking capability to be turned on or off, Google has created what it calls its “first fully hybrid reasoning model.”\n\nThe new pricing structure highlights the cost of reasoning in today’s AI systems. When usingGemini 2.5 Flash, developers pay $0.15 per million tokens for input. Output costs vary dramatically based on reasoning settings: $0.60 per million tokens with thinking turned off, jumping to $3.50 per million tokens with reasoning enabled.\n\nThis nearly sixfold price difference for reasoned outputs reflects the computational intensity of the “thinking” process, where the model evaluates multiple potential paths and considerations before generating a response.\n\n“Customers pay for any thinking and output tokens the model generates,” Doshi told VentureBeat. “In the AI Studio UX, you can see these thoughts before a response. In the API, we currently don’t provide access to the thoughts, but a developer can see how many tokens were generated.”\n\nThe thinking budget can be adjusted from 0 to 24,576 tokens, operating as a maximum limit rather than a fixed allocation. According to Google, the model intelligently determines how much of this budget to use based on the complexity of the task, preserving resources when elaborate reasoning isn’t necessary.\n\nGoogle claimsGemini 2.5 Flashdemonstrates competitive performance across key benchmarks while maintaining a smaller model size than alternatives. OnHumanity’s Last Exam, a rigorous test designed to evaluate reasoning and knowledge, 2.5 Flash scored 12.1%, outperforming Anthropic’sClaude 3.7 Sonnet(8.9%) andDeepSeek R1(8.6%), though falling short of OpenAI’s recently launchedo4-mini(14.3%).\n\nThe model also posted strong results on technical benchmarks likeGPQA diamond(78.3%) andAIME mathematics exams(78.0% on 2025 tests and 88.0% on 2024 tests).\n\n“Companies should choose 2.5 Flash because it provides the best value for its cost and speed,” Doshi said. “It’s particularly strong relative to competitors on math, multimodal reasoning, long context, and several other key metrics.”\n\nIndustry analysts note that these benchmarks indicate Google is narrowing the performance gap with competitors while maintaining a pricing advantage — a strategy that may resonate with enterprise customers watching their AI budgets.\n\nThe introduction of adjustable reasoning represents a significant evolution in how businesses can deploy AI. With traditional models, users have little visibility into or control over the model’s internal reasoning process.\n\nGoogle’s approach allows developers to optimize for different scenarios. For simple queries like language translation or basic information retrieval, thinking can be disabled for maximum cost efficiency. For complex tasks requiring multi-step reasoning, such as mathematical problem-solving or nuanced analysis, the thinking function can be enabled and fine-tuned.\n\nA key innovation is the model’s ability to determine how much reasoning is appropriate based on the query. Google illustrates this with examples: a simple question like “How many provinces does Canada have?” requires minimal reasoning, while a complex engineering question about beam stress calculations would automatically engage deeper thinking processes.\n\n“Integrating thinking capabilities into our mainline Gemini models, combined with improvements across the board, has led to higher quality answers,” Doshi said. “These improvements are true across academic benchmarks – including SimpleQA, which measures factuality.”\n\nThe release ofGemini 2.5 Flashcomes during a week of aggressive moves by Google in the AI space. On Monday, the company rolled outVeo 2video generation capabilities to Gemini Advanced subscribers, allowing users to create eight-second video clips from text prompts. Today, alongside the 2.5 Flash announcement, Google revealed thatall U.S. college students will receive free access to Gemini Advanced until spring 2026— a move interpreted by analysts as an effort to build loyalty among future knowledge workers.\n\nThese announcements reflect Google’s multi-pronged strategy to compete in a market dominated by OpenAI’s ChatGPT, which reportedly sees over800 million weekly userscompared to Gemini’s estimated250-275 million monthly users, according to third-party analyses.\n\nThe 2.5 Flash model, with its explicit focus on cost efficiency and performance customization, appears designed to appeal particularly to enterprise customers who need to carefully manage AI deployment costs while still accessing advanced capabilities.\n\n“We’re super excited to start getting feedback from developers about what they’re building with Gemini Flash 2.5 and how they’re using thinking budgets,” Doshi said.\n\nWhile this release is in preview, the model is already available for developers to start building with, though Google has not specified a timeline for general availability. The company indicates it will continue refining the dynamic thinking capabilities based on developer feedback during this preview phase.\n\nFor enterprise AI adopters, this release represents an opportunity to experiment with more nuanced approaches to AI deployment, potentially allocating more computational resources to high-stakes tasks while conserving costs on routine applications.\n\nThe model is also available to consumers through theGemini app, where it appears as “2.5 Flash (Experimental)” in the model dropdown menu, replacing the previous 2.0 Thinking (Experimental) option. This consumer-facing deployment suggests Google is using the app ecosystem to gather broader feedback on its reasoning architecture.\n\nAs AI becomes increasingly embedded in business workflows, Google’s approach with customizable reasoning reflects a maturing market where cost optimization and performance tuning are becoming as important as raw capabilities — signaling a new phase in the commercialization of generative AI technologies.\n\nIf you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI.\n\nRead ourPrivacy Policy\n\nThanks for subscribing. Check out moreVB newsletters here.\n\nAn error occured.\n\n© 2025VentureBeat. All rights reserved.\n\nThanks for subscribing. Check out moreVB newsletters here.\n\nAn error occured."
      },
      {
        "title": "Google’s Gemini 2.5 Flash introduces ‘thinking budgets’ that cut AI costs by 600% when turned down",
        "author": "Michael Nuñez",
        "publication_date": "2025-04-17T23:27:30+00:00"
      }
    ],
    "authors": [
      "Michael Nunez"
    ],
    "source": "VentureBeat",
    "image_url": "https://venturebeat.com/wp-content/uploads/2025/04/nuneybits_Vector_art_of_a_retro_computer_on_the_screen_is_a_lig_b7962004-900f-4fdd-8b99-620ed4be1597.webp?w=400",
    "url": "https://venturebeat.com/ai/googles-gemini-2-5-flash-introduces-thinking-budgets-that-cut-ai-costs-by-600-when-turned-down/"
  },
  "markdown_content": "## New Release Details\\nGoogle has launched Gemini 2.5 Flash, a major upgrade to its AI lineup that gives businesses and developers unprecedented control over how much \"thinking\" their AI performs. The new model, released today in preview through Google AI Studio and Vertex AI, represents a strategic effort to deliver improved reasoning capabilities while maintaining competitive pricing in the increasingly crowded AI market.\\n\\n## Technical Innovation\\nThe model introduces what Google calls a \"thinking budget\" — a mechanism that allows developers to specify how much computational power should be allocated to reasoning through complex problems before generating a response. This approach aims to address a fundamental tension in today's AI marketplace: more sophisticated reasoning typically comes at the cost of higher latency and pricing.\\n\\n## Pricing Structure\\nThe new pricing structure highlights the cost of reasoning in today's AI systems. When using Gemini 2.5 Flash, developers pay:\\n* $0.15 per million tokens for input\\n* $0.60 per million tokens with thinking turned off\\n* $3.50 per million tokens with reasoning enabled\\n\\n## Technical Specifications\\nThe thinking budget can be adjusted from 0 to 24,576 tokens, operating as a maximum limit rather than a fixed allocation. According to Google, the model intelligently determines how much of this budget to use based on the complexity of the task, preserving resources when elaborate reasoning isn't necessary.\\n\\n## Performance Metrics\\nGoogle claims Gemini 2.5 Flash demonstrates competitive performance across key benchmarks while maintaining a smaller model size than alternatives. On Humanity's Last Exam, it scored 12.1%, outperforming several competitors though falling short of OpenAI's o4-mini.\\n\\nThe model's ability to determine appropriate reasoning levels based on query complexity is a key innovation. Simple questions require minimal reasoning, while complex problems automatically engage deeper thinking processes.\\n\\n## Market Strategy\\nThe release comes amid Google's aggressive moves in the AI space, including free Gemini Advanced access for U.S. college students until spring 2026, reflecting their strategy to compete with OpenAI's ChatGPT in the market."
}