{
  "title": "Varanasi gang-rape case: SIT formed as suspects' families challenge complainant's claims",
  "publication_date": "2025-04-18T03:02:16+05:30",
  "summary": "An eight-member Special Investigation Team (SIT) has been formed to investigate a Varanasi gang-rape case after families of the accused raised questions about the 19-year-old complainant's allegations. The police have arrested 14 persons, while the SIT will ensure transparent investigation. The case involves allegations of gang-rape and wrongful confinement over five days, with the accused families highlighting several discrepancies in the complaint.",
  "content": "An eight-member Special Investigation Team (SIT) was constituted on Thursday to probe the Varanasi gang-rape case after the families of the arrested accused submitted an application to the police, picking holes in the allegations levelled by the 19-year-old complainant.\n\nThe SIT, formed by Varanasi Police Commissioner Mohit Agarwal, will ensure transparent investigation and prevent wrongful implication of innocent persons. The team is headed by Deputy Commissioner of Police (DCP) Pramod Kumar and includes senior police officials.\n\nThe case emerged when the complainant's father filed a missing person's report on April 4 for his daughter who had been missing since March 29. After being found at a friend's house, the woman filed a complaint alleging gang-rape and wrongful confinement over five days at multiple locations.\n\nThe accused families have raised several questions, including the delay in filing the missing person's report, lack of immediate rape complaint when found, absence of injury marks, and the existence of CCTV footage showing the complainant \"walking cheerfully\" with some accused. They also pointed to active social media activity during the alleged incident period.\n\nThe police are conducting DNA profiling of the 14 arrested accused, and the SIT will examine all evidence and new facts that emerge during the investigation. The medical examination reportedly found no external injuries on the complainant.",
  "category": "World",
  "tags": [
    "crime",
    "investigation",
    "sexual assault",
    "police",
    "India",
    "law enforcement"
  ],
  "location": "Varanasi, India",
  "source": {
    "title": "Kim Soo Hyun breaks silence on financial trouble amid lawsuit discrepancy: ‘We did not fail to pay…’",
    "publication_date": 1744922731,
    "content": [
      {
        "title": "Varanasi gang-rape case: SIT formed as suspects’ families pick holes in complainant claims",
        "publication_date": "2025-04-18T03:02:16+05:30",
        "content": "An eight-member Special Investigation Team (SIT) was constituted on Thursday to probe the Varanasi gang-rape case after the families of the arrested accused submitted an application to the police, picking holes in the allegations levelled by the 19-year-old complainant, officials said.\n\nThe SIT, formed by Varanasi Police Commissioner Mohit Agarwal, has been tasked with ensuring that the “investigation is conducted transparently and no innocent person is wrongly implicated in the case”.\n\nThe police have arrested 14 persons in the case so far.\n\nThe SIT will be headed by Deputy Commissioner of Police (DCP) Pramod Kumar and has ADCPs Shruti Srivastava and Neetu, Assistant Commissioner of Police (ACP) Vidhush Saxena and four inspector-rank officials as its members.\n\nIn a press statement, the Varanasi police said the eight-member team “will also examine any new facts that emerge during the probe” and that “any accused not named in the FIR but identified during the course of the investigation will be arrested only after a recommendation of the SIT”.\n\nThe 19-year-old’s father had on April 4 filed a missing person’s complaint, stating that his daughter was missing since March 29. The police traced the woman to her friend’s house later that evening. The next day, the teenaged woman, accompanied by her parents, visited the local police station and filed a complaint, alleging she was “wrongfully confined and gang-raped” for five days. She claimed that she was drugged by some of the accused and taken to multiple locations in Varanasi, including a hotel and a café, where she was sexually assaulted.\n\nAn FIR was registered on charges of gang rape and criminal confinement against 12 persons by name and 11 unidentified individuals.\n\nIn their application to the police, the families of the accused questioned why no missing person’s report was filed for five days since she went missing on March 29. They also questioned why the complainant did not report the alleged rape to the police when she was recovered from her friend’s house on April 4.\n\nThey said even as the complainant claimed to have been raped between March 29 and April 4, she stayed twice at her friend’s house and did not mention the sexual assault incident to her friend. They also questioned why no visible injury marks found on her body if she was allegedly raped by 23 people. She did not return home even as her friend’s house is around 500 metres from her residence, they said.\n\nIn their letter, they claimed that CCTV footage from March 31 showed the complainant walking cheerfully with three of the accused. Several posts and photos were uploaded on the victim’s Instagram account on April 2, in which she appeared hale and hearty, they further claimed.\n\nThe letter also stated that the victim messaged one of the accused on Instagram on March 31, informing him that she was coming to a café. The family questioned why the victim did not raise an alarm at the hotels and cafés where she claimed to have been assaulted. They also asked why she went with the same accused again on April 3, despite claiming to have been sexually assaulted by him on March 31.\n\nThe police said some people claimed that the complainant was initially unwilling to return to her parents’ home after she was recovered.\n\nThe families also alleged that the complainant’s family demanded money from some of the accused, threatening to implicate them in case they didn’t pay up. The FIR, they alleged, was part of a planned scheme to blackmail and extort money.\n\nThey claimed that the girl’s parents knew of her whereabouts between March 29 and April 4, and that most of the accused were previously connected to the woman through Instagram.\n\nWhen contacted, Police Commissioner Mohit Agarwal said the SIT will also examine the evidence against the 14 accused arrested in the case. “The DNA profiling of the accused is also being done,” he added.\n\nThe SIT will also probe the allegation that the victim did not name some of the persons named in the FIR in her statement before the magistrate, it is learnt.\n\nDuring her medical examination no external injuries were found on the complainant, a police officer said."
      },
      {
        "title": "Varanasi gang-rape case: SIT formed as suspects’ families pick holes in complainant claims",
        "author": "Unknown Author",
        "publication_date": "2025-04-18T03:02:16+05:30"
      }
    ],
    "authors": [],
    "source": "The Indian Express",
    "image_url": "https://images.indianexpress.com/2025/04/Kimsoohyun-2.jpg",
    "url": "https://indianexpress.com/article/entertainment/web-series/kim-soo-hyun-breaks-silence-on-financial-trouble-amid-lawsuit-discrepancy-we-did-not-fail-to-pay-9950726/"
  },
  "markdown_content": "## Investigation Team Formation\\nThe Varanasi Police Commissioner Mohit Agarwal has formed an eight-member Special Investigation Team (SIT) to probe the Varanasi gang-rape case. The decision comes after families of the arrested accused submitted applications challenging the complainant's allegations.\\n\\n## Investigation Leadership\\nThe SIT, led by Deputy Commissioner of Police (DCP) Pramod Kumar and comprising senior police officials, aims to ensure transparent investigation and prevent wrongful implication of innocent persons.\\n\\n## Case Background\\nThe case came to light when the complainant's father filed a missing person's report on April 4 for his daughter, who had been missing since March 29. Upon being located at a friend's house, the 19-year-old woman filed a complaint alleging gang-rape and wrongful confinement across multiple locations over five days.\\n\\n## Challenges to Allegations\\nThe accused families have raised several points of contention:\\n* Delay in filing the missing person's report\\n* Absence of immediate rape complaint upon discovery\\n* Lack of injury marks\\n* CCTV footage showing the complainant \"walking cheerfully\" with some accused\\n* Active social media presence during the alleged incident period\\n\\n## Ongoing Investigation\\n* DNA profiling is being conducted for the 14 arrested accused\\n* The SIT will examine all evidence and new developments\\n* Medical examination reportedly found no external injuries on the complainant"
}