{
  "title": "Arshad Warsi joins the cast of Shah Rukh Khan's King: Report",
  "publication_date": "2025-04-18T16:36:42+05:30",
  "summary": "Actor Arshad Warsi has been cast in a pivotal role in Shah Rukh Khan's upcoming film 'King', directed by Siddharth Anand. The film marks the big screen debut of SRK's daughter Suhana Khan following her OTT debut in 'The Archies'. While details about Warsi's character remain under wraps, this marks the first major collaboration between the two actors.",
  "content": "Shah Rukh Khan's upcoming film 'King' has been generating significant buzz since its announcement last year. The film is particularly notable as it reunites SRK with Pathaan director Siddharth Anand and marks the theatrical debut of his daughter Suhana Khan, who recently made her OTT debut with The Archies.\n\nAccording to a report by Peeping Moon, Arshad Warsi has joined the cast in a pivotal role, though specific details about his character are being kept confidential. While Shah Rukh Khan and Arshad Warsi have been friends for years, this will be their first significant on-screen collaboration, apart from SRK's previous guest appearance in Warsi's 2005 film 'Kuchh Meetha Ho Jaye'.\n\nThe film is being produced under Khan's Red Chillies Entertainment and Siddharth Anand's Marflix Pictures. The cast also includes notable actors Abhishek Bachchan and Abhay Verma of 'Munjya' fame.",
  "category": "Entertainment",
  "tags": [
    "bollywood",
    "casting news",
    "Shah Rukh Khan",
    "Arshad Warsi",
    "Suhana Khan",
    "Indian cinema",
    "movie production"
  ],
  "location": "Mumbai, India",
  "source": {
    "title": "BREAKING! Arshad Warsi joins the cast of Shah Rukh Khan’s King: Report",
    "publication_date": 1744954839,
    "content": [
      {
        "title": "BREAKING! Arshad Warsi joins the cast of Shah Rukh Khan’s King: Report : Bollywood News - Bollywood Hungama",
        "publication_date": "2025-04-18T16:36:42+05:30",
        "content": "SEARCH\n\nLANGUAGE\n\nFOLLOW US ON\n\nFEEDBACK\n\nKing marks the big screen debut of Shah Rukh Khan's daughter Suhana Khan.\n\nShah Rukh Khan’s upcoming filmKinghas been creating waves ever since news about the same came out for the first time last year. This is purely because it is a film starring SRK, one of the biggest stars not just in India but world over. Plus, it’s helmed by Siddharth Anand, the director of the actor’s comeback filmPathaan. But the reason whyKingis anticipated even more is because it marks the big screen debut of the superstar’s daughter Suhana Khan. The film follows her OTT debut withThe Archies.\n\nNow, a latest report has sparked more excitement forKing. As per a report by Peeping Moon, Arshad Warsi has joined the cast of the film. The report states that he will be playing a pivotal role in the film but details about his character are currently kept under wraps.\n\nShah Rukh and Arshad have been friends since long. But this is the first time that the two will be seen in a movie together where both are playing prominent roles. Interestingly, SRK had done a guest appearance in Arshad starrerKuchh Meetha Ho Jayein 2005. The Samar Khan directorial also starred SRK’sPardesco-star Mahima Chaudhry along with Rohit Roy, Sandhya Mridul and Jaspal Bhatti.\n\nComing back toKing, the film is produced under Khan’s Red Chillies Entertainment and Siddharth Anand’s Marflix Pictures and it also stars Abhishek Bachchan and Abhay Verma ofMunjyafame.\n\nAlso Read:When Shah Rukh Khan went off script while filming Don: Alyy Khan recalls candid on-set moment\n\nCatch us for latestBollywood News,New Bollywood Moviesupdate,Box office collection,New Movies Release,Bollywood News Hindi,Entertainment News,Bollywood Live News Today&Upcoming Movies 2025and stay updated with latest hindi movies only on Bollywood Hungama.\n\nNo Releated Data\n\nSkip this step for now\n\n5000characters remaining"
      },
      {
        "title": "BREAKING! Arshad Warsi joins the cast of Shah Rukh Khan’s King: Report : Bollywood News - Bollywood Hungama",
        "author": "Bollywood Hungama",
        "publication_date": "2025-04-18T16:36:42+05:30"
      }
    ],
    "authors": [],
    "source": "Bollywood Hungama",
    "image_url": "https://media5.bollywoodhungama.in/wp-content/uploads/2025/04/620x450_7-1.jpg",
    "url": "https://www.bollywoodhungama.com/news/bollywood/breaking-arshad-warsi-joins-cast-shah-rukh-khans-king-report/"
  },
  "markdown_content": "## Cast Update\\nShah Rukh Khan's upcoming film \"King\" has been generating significant buzz since its announcement last year. The film is particularly notable as it reunites SRK with Pathaan director Siddharth Anand and marks the theatrical debut of his daughter Suhana Khan, who recently made her OTT debut with The Archies.\\n\\n## New Addition\\nAccording to a report by Peeping Moon, Arshad Warsi has joined the cast in a pivotal role, though specific details about his character are being kept confidential. While Shah Rukh Khan and Arshad Warsi have been friends for years, this will be their first significant on-screen collaboration, apart from SRK's previous guest appearance in Warsi's 2005 film \"Kuchh Meetha Ho Jaye\".\\n\\n## Production Details\\nThe film is being produced under Khan's Red Chillies Entertainment and Siddharth Anand's Marflix Pictures. The cast also includes notable actors:\\n* Abhishek Bachchan\\n* Abhay Verma of \"Munjya\" fame"
}