{
  "title": "China reacts to US increasing defence budget to USD 1 trillion",
  "publication_date": "2025-04-18T17:22:01+05:30",
  "summary": "China has strongly criticized US plans to increase its defense budget to $1 trillion, with Chinese Defense Ministry spokesperson Zhang Xiaogang calling it a \"wanton use of force.\" China, the second-largest defense spender, questioned America's military spending while being in heavy debt. China's own defense budget increased by 7.2% to $249 billion this year.",
  "content": "China has sharply reacted to reports which claim that the US is looking to increase its defence budget to USD one trillion, saying that \"wanton use of force will not make America great again.\" Earlier, reports surfaced that the US defence budget for fiscal year 2026 will reach a record USD one trillion.\n\nChinese Ministry of Defence spokesperson, Zhang Xiaogang, said such an act would only inflict painful disasters upon the people of the US and the rest of the world. The Chinese media quoted Zhang as saying that America's sky-high defence budget exposed once again the bellicose nature of the US side and its belief in \"might makes right\".\n\nHe added that while the US government is in heavy debt, it continues to keep pouring \"ill-got wealth\" exploited from other countries into manufacturing weapons.\n\nNotably, China is the second-largest spender on defence after the United States, as it increased its defence budget this year by 7.2% to USD 249. The current Chinese defence budget is USD 17 billion more compared to last year.\n\nIn terms of the Chinese currency, the defence budget amounts to 1.784665 trillion yuan, according to a draft budget report submitted to China's Parliament by Premier Li Qiang. Last year, China increased its defence budget by 7.2 per cent to about USD 232 billion.\n\nCritics view China's defence budget with scepticism in light of massive military modernisation, including building aircraft carriers, rapid construction of advanced naval ships, and modern stealth aircraft being carried out at a feverish pitch by the Chinese military.",
  "category": "World",
  "tags": [
    "military spending",
    "defense budget",
    "US-China relations",
    "international relations",
    "military modernization",
    "geopolitics"
  ],
  "location": "China",
  "source": {
    "title": "'Wanton use of force' with 'ill-gotten wealth': China reacts to US increasing defence budget to USD 1 trillion",
    "publication_date": 1744957321,
    "content": [
      {
        "title": "'Wanton use of force' with 'ill-gotten wealth': China reacts to US increasing defence budget to USD 1 trillion",
        "publication_date": "2025-04-18T17:22:01+05:30",
        "content": "China has sharply reacted to reports which claim that the US is looking to increase its defence budget to USD one trillion, saying that \"wanton use of force will not make America great again\". Earlier, reports surfaced that the US defence budget for fiscal year 2026 will reach a record USD one trillion.Advertisement\n\nChinese Ministry of Defence spokesperson, Zhang Xiaogang, said such an act would only inflict painful disasters upon the people of the US and the rest of the world.Advertisement\n\nThe Chinese media quoted Zhang as saying that America's sky-high defence budget exposed once again the bellicose nature of the US side and its belief in \"might makes right\".\n\nHe added that while the US government is in heavy debt, it continues to keep pouring \"ill-got wealth\" exploited from other countries into manufacturing weapons, he said.\n\nNotably, China is the second-largest spender on defence after the United States, as it increased its defence budget this year by 7.2% to USD 249. The current Chinese defence budget is USD 17 billion more compared to last year.\n\nIn terms of the Chinese currency, the defence budget amounts to 1.784665 trillion yuan, according to a draft budget report submitted to China's Parliament by Premier Li Qiang, the state-run Xinhua news agency reported. Last year, China increased its defence budget by 7.2 per cent to about USD 232 billion (1.67 trillion yuan).\n\nCritics view China's defence budget with scepticism in light of massive military modernisation, including building aircraft carriers, rapid construction of advanced naval ships, and modern stealth aircraft being carried out at a feverish pitch by the Chinese military.\n\n(With inputs from AP)\n\n© 2009-2025 Independent News Service. All rights reserved."
      },
      {
        "title": "'Wanton use of force' with 'ill-gotten wealth': China reacts to US increasing defence budget to USD 1 trillion",
        "author": "India TV News",
        "publication_date": "2025-04-18T17:22:01+05:30"
      }
    ],
    "authors": [
      "Mohit Pandey"
    ],
    "source": "India TV News",
    "image_url": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2025/04/trumpxi-1744977087.webp",
    "url": "https://www.indiatvnews.com/news/world/wanton-use-of-force-with-ill-gotten-wealth-china-reacts-to-us-increasing-defence-budget-to-usd-1-trillion-2025-04-18-986187"
  },
  "markdown_content": "## Chinese Response to US Defense Budget\\n\\nChina has sharply reacted to reports which claim that the US is looking to increase its defence budget to USD one trillion, saying that \"wanton use of force will not make America great again.\" Earlier, reports surfaced that the US defence budget for fiscal year 2026 will reach a record USD one trillion.\\n\\n## Official Statement\\n> America's sky-high defence budget exposed once again the bellicose nature of the US side and its belief in \"might makes right\"\\n\\nChinese Ministry of Defence spokesperson, Zhang Xiaogang, said such an act would only inflict painful disasters upon the people of the US and the rest of the world. He added that while the US government is in heavy debt, it continues to keep pouring \"ill-got wealth\" exploited from other countries into manufacturing weapons.\\n\\n## Defense Budget Comparison\\n\\n* China is the second-largest spender on defence after the United States\\n* China increased its defence budget this year by 7.2% to USD 249\\n* Current Chinese defence budget is USD 17 billion more compared to last year\\n* In Chinese currency, the defence budget amounts to 1.784665 trillion yuan\\n* Last year, China increased its defence budget by 7.2 per cent to about USD 232 billion\\n\\n## Critical Perspective\\n\\nCritics view China's defence budget with scepticism in light of massive military modernisation, including:\\n- Building aircraft carriers\\n- Rapid construction of advanced naval ships\\n- Modern stealth aircraft being carried out at a feverish pitch by the Chinese military"
}