{
  "title": "Infosys to Acquire Leading Energy Consulting Company, MRE Consulting",
  "publication_date": "2025-04-17T00:00:00Z",
  "summary": "Infosys announced a definitive agreement to acquire MRE Consulting Ltd., a Houston-based technology and business consulting service provider. The acquisition will strengthen Infosys's capabilities in energy and commodity trading and risk management (E/CTRM). MRE Consulting brings a team of over 200 professionals and proprietary E/CTRM business process frameworks.",
  "content": "Infosys, a global leader in next-generation digital services and consulting, today announced a definitive agreement to acquire MRE Consulting Ltd., a technology and business consulting service provider. This strategic investment strengthens Infosys's capabilities in trading and risk management, especially in the energy sector.\n\nHeadquartered in Houston, Texas, MRE Consulting will bring a team of over 200 professionals with industry knowledge, consulting and deep technology experience in Energy/Commodity Trading and Risk Management (E/CTRM) platforms and ecosystems. Through decades of successful delivery, MRE Consulting has developed proprietary E/CTRM business process frameworks spanning multiple commodities, transportation modes and business models.\n\nAshiss Kumar Dash, EVP & Global Head at Infosys, emphasized that with increasing complexity in integrating diverse energy sources including renewables, global corporations require innovative solutions to navigate transformation. The company is witnessing significant demand for digital transformation in E/CTRM.\n\nMRE Founders Mike Short, Dru Neikirk and Shane Merz expressed enthusiasm about the partnership, citing opportunities at the intersection of data, AI, and technology. The acquisition is expected to close during the first quarter of fiscal year 2026, subject to customary closing conditions.\n\nFounded in 1994, MRE Consulting provides technology and business consulting services to the Energy & Utilities, Services, and Healthcare industries, specializing in business advisory and digital transformation for E/CTRM.",
  "category": "Business",
  "tags": [
    "acquisition",
    "technology",
    "consulting",
    "energy sector",
    "digital transformation",
    "business",
    "trading",
    "risk management"
  ],
  "location": "Houston, Texas",
  "source": {
    "title": "Infosys to Acquire Leading Energy Consulting Company, MRE Consulting",
    "publication_date": 1744874939,
    "content": [
      {
        "title": "Infosys to Acquire Leading Energy Consulting Company, MRE Consulting",
        "publication_date": "Unknown",
        "content": "Being Resilient. That's Live Enterprise.\n\nDigital Core Capabilities\n\nDigital Operating Model\n\nEmpowering Talent Transformations\n\nTales of Transformation\n\nIndustries\n\nServices\n\nPlatforms\n\nInfosys Knowledge Institute\n\nAbout Us\n\nAcquisition to strengthen energy and commodity trading and risk management (E/CTRM) capabilities for Infosys\n\nBengaluru,  India and Houston, US – April 17, 2025\n\nInfosys(NSE, BSE,  NYSE: INFY) a global leader in next-generation digital services and consulting,  today announced a definitive agreement to acquireMRE Consulting Ltd. (‘MRE  Consulting’), a technology and business consulting service provider. This  strategic investment brings newer capabilities for Infosys in trading and risk  management, especially in the energy sector.\n\nHeadquartered in Houston,  Texas, MRE Consulting will bring a team of over 200 professionals with  industry knowledge, consulting and deep technology experience in Energy/Commodity Trading  and Risk Management (E/CTRM) platforms and ecosystems. Through  decades of successful delivery, MRE Consulting has developed proprietary E/CTRM  business process frameworks spanning multiple commodities, transportation modes  and business models. These frameworks serve as the foundation for commodity  trading projects, accelerating vendor selection, solution design and  implementation. MRE brings new clients, and synergies with new buying centers.\n\nAshiss Kumar Dash, EVP &  Global Head – Services, Utilities, Resources, Energy, and Sustainability,  Infosys,said, “The  world is now shifting towards a more sustainable future. With increasing  complexity in integrating diverse sources of energy including renewables,  global corporations require innovative solutions to navigate transformation. At  Infosys, we are witnessing a significant rise in demand for digital  transformation in energy and commodity trading and risk management (E/CTRM). By  combining MRE Consulting’s deep E/CTRM capabilities with Infosys’ established  leadership in the energy, resources and utilities sector, we are further  enhancing our ability to drive value for our clients in this critical area of  their business. We are excited to welcome MRE Consulting and its  leadership team to the Infosys family.”\n\nMRE  Founders, Mike Short,Dru Neikirk and Shane Merz,  said, “The  opportunities for our clients at the intersection of data, AI, and technology  are vast. Beyond strong business synergy, we were seeking a partner who shared  our values and mutual respect. By joining with Infosys, we will extend our  expertise, deliver new capabilities, and expand beyond our current markets,  while scaling what makes MRE special. We are truly excited about  this new journey.”\n\nThe  acquisition is expected to close during the first quarter of fiscal year 2026  (i.e. quarter ending June 30, 2025), subject to customary closing conditions.\n\nFounded in 1994, MRE  Consulting provides technology and business consulting services to the Energy  & Utilities, Services, and Healthcare industries. MRE specializes in business  advisory and digital transformation for Energy/Commodity Trading and Risk  Management (E/CTRM). MRE also provides comprehensive solutions across customer engagement, call  center optimization, field service, CPQ/pricing, cloud infrastructure and digital  workplace and is a Salesforce and Microsoft partner. We are proud to be recognized  as a Houston Business Journal Best Places to Work. For more information, please  visitwww.mre-consulting.com/.\n\nInfosys is a global leader in next-generation digital services and consulting. Over 300,000 of our people work to amplify human potential and create the next opportunity for people, businesses and communities. We enable clients in more than 56 countries to navigate their digital transformation. With over four decades of experience in managing the systems and workings of global enterprises, we expertly steer clients, as they navigate their digital transformation powered by cloud and AI. We enable them with an AI-first core, empower the business with agile digital at scale and drive continuous improvement with always-on learning through the transfer of digital skills, expertise, and ideas from our innovation ecosystem. We are deeply committed to being a well-governed, environmentally sustainable organization where diverse talent thrives in an inclusive workplace.\n\nVisitwww.infosys.comto see how Infosys (NSE, BSE, NYSE: INFY) can help your enterprise navigate your next.\n\nCertain statements in this release concerning our future growth prospects, or our future financial or operating performance, are forward-looking statements intended to qualify for the 'safe harbor' under the Private Securities Litigation Reform Act of 1995, which involve a number of risks and uncertainties that could cause actual results or outcomes to differ materially from those in such forward-looking statements. The risks and uncertainties relating to these statements include, but are not limited to, risks and uncertainties regarding the execution of our business strategy, increased competition for talent, our ability to attract and retain personnel, increase in wages, investments to reskill our employees, our ability to effectively implement a hybrid work model, economic uncertainties and geo-political situations, technological disruptions and innovations such as Generative AI, the complex and evolving regulatory landscape including immigration regulation changes, our ESG vision, our capital allocation policy and expectations concerning our market position, future operations, margins, profitability, liquidity, capital resources, our corporate actions including acquisitions, and cybersecurity matters. Important factors that may cause actual results or outcomes to differ from those implied by the forward-looking statements are discussed in more detail in our US Securities and Exchange Commission filings including our Annual Report on Form 20-F for the fiscal year ended March 31, 2024. These filings are available atwww.sec.gov. Infosys may, from time to time, make additional written and oral forward-looking statements, including statements contained in the Company's filings with the Securities and Exchange Commission and our reports to shareholders. The Company does not undertake to update any forward-looking statements that may be made from time to time by or on behalf of the Company unless it is required by law.\n\nFor more information, please contact:PR_Global@Infosys.com\n\nCompany\n\nSubsidiaries\n\nPrograms\n\nSupport\n\nConnect with us\n\nCopyright © 2025 Infosys Limited"
      },
      {
        "title": "Infosys to Acquire Leading Energy Consulting Company, MRE Consulting",
        "author": "Infosys Limited",
        "publication_date": "Unknown"
      }
    ],
    "authors": [],
    "source": "Infosys",
    "image_url": null,
    "url": "https://www.infosys.com/newsroom/press-releases/2025/acquire-energy-consulting-mre.html"
  },
  "markdown_content": "## Acquisition Announcement\\nInfosys, a global leader in next-generation digital services and consulting, today announced a definitive agreement to acquire MRE Consulting Ltd., a technology and business consulting service provider. This strategic investment strengthens Infosys's capabilities in trading and risk management, especially in the energy sector.\\n\\n## Company Overview\\nHeadquartered in Houston, Texas, MRE Consulting will bring a team of over 200 professionals with industry knowledge, consulting and deep technology experience in Energy/Commodity Trading and Risk Management (E/CTRM) platforms and ecosystems. Through decades of successful delivery, MRE Consulting has developed proprietary E/CTRM business process frameworks spanning multiple commodities, transportation modes and business models.\\n\\n## Leadership Perspectives\\n> Ashiss Kumar Dash, EVP & Global Head at Infosys, emphasized that with increasing complexity in integrating diverse energy sources including renewables, global corporations require innovative solutions to navigate transformation. The company is witnessing significant demand for digital transformation in E/CTRM.\\n\\n> MRE Founders Mike Short, Dru Neikirk and Shane Merz expressed enthusiasm about the partnership, citing opportunities at the intersection of data, AI, and technology.\\n\\n## Deal Details\\nThe acquisition is expected to close during the first quarter of fiscal year 2026, subject to customary closing conditions.\\n\\n## Background\\nFounded in 1994, MRE Consulting provides technology and business consulting services to the Energy & Utilities, Services, and Healthcare industries, specializing in business advisory and digital transformation for E/CTRM."
}