{
  "title": "Supreme Court Questions Religious Composition of Waqf Boards",
  "publication_date": "2025-04-16T16:47:23+05:30",
  "summary": "The Supreme Court challenged the constitutional validity of the Waqf (Amendment) Act, 2025, questioning why non-Muslims could serve on Waqf boards if Muslims aren't allowed on Hindu endowment boards. Chief Justice Sanjiv Khanna led the discussion, which sparked tension when the Solicitor General suggested the bench might be unqualified to hear the case.",
  "content": "The Supreme Court on Wednesday raised critical questions about the religious composition of Waqf boards during a hearing on the constitutional validity of the Waqf (Amendment) Act, 2025. The inclusion of non-Muslim members on Waqf boards has become a central point of contention.\n\nChief Justice of India Sanjiv Khanna directly challenged Solicitor General Tushar Mehta, asking \"Are you saying that from now on you will allow Muslims to be part of Hindu endowment boards? Say it openly.\"\n\nThe exchange grew tense when the Solicitor General suggested that \"this bench also cannot hear the case,\" prompting a sharp response from Chief Justice Khanna who stated \"When we sit over here, we lose our religion. For us both sides are the same. How can you compare it with the judges?\"\n\nJustice Viswanathan noted practical considerations regarding mosque access and familiarity with premises, to which the Solicitor General suggested such oversight could be handled by the Charity Commissioner.\n\nThe Court provided interim relief, ruling that properties declared as Waqf by courts should not be de-notified during proceedings, and clarified that all Waqf board members must be Muslim, except for ex-officio members. The three-judge bench will continue the hearing tomorrow.",
  "category": "World",
  "tags": [
    "legal",
    "religious rights",
    "Supreme Court",
    "Waqf Act",
    "constitutional law",
    "religious institutions",
    "India"
  ],
  "location": "India",
  "source": {
    "title": "NCERT gives Hindi names to English textbooks, sparks language row",
    "url": "https://www.indiatoday.in/education-today/news/story/ncert-gives-hindi-names-to-english-textbooks-sparks-language-row-2708688-2025-04-14?utm_source=washare&utm_medium=socialicons&utm_campaign=shareurltracking",
    "created_utc": 1744991446.0,
    "subreddit": "india",
    "media": [
      "https://external-preview.redd.it/s-HX-PR0pZGQhu6dnF1rpnilyiRe9olbKbPAf1HoB7s.jpg?auto=webp&s=96bf8b932a44eaf99dfead4f5cb4aca5de2b9ccb"
    ],
    "content": [
      {
        "title": "Will you allow Muslims on Hindu boards? Supreme Court questions Waqf composition",
        "publication_date": "2025-04-16T16:47:23+05:30",
        "content": "Listen to Story\n\nThe Supreme Court on Wednesday questioned the religious composition of Waqf board during a hearing on the constitutional validity of the Waqf (Amendment) Act, 2025. Theinclusion of non-Muslim members in the Waqf boardis one of the main points of contention, with petitioners arguing that the move dilutes the freedom of Muslims to manage their own religion.\n\nChief Justice of India Sanjiv Khanna asked Solicitor General Tushar Mehta, “Are you saying that from now on you will allow Muslims to be part of Hindu endowment boards? Say it openly.”\n\nThe remark came as the bench questioned why non-Muslims could not be part of Waqf advisory panels if the reverse was also not allowed.\n\nThe Chief Justice pointed out that as per the Act, eight members of the board are Muslims, and possibly only two are not. “Why not have Muslims also on the advisory board of Hindu endowments then?” he said.\n\nThe Solicitor General then suggested that by the same logic “this bench also cannot hear the case”.\n\nThe remark drew a fiery response from the Supreme Court bench.\n\n\"What! When we sit over here. We lose our religion. For us both sides are the same. How can you compare it with the judges?\" the Chief Justice said.\n\nJustice Viswanathan also noted that there were practical issues such as ingress and outgress in mosques, which is why familiarity with the premises might be relevant. The SG responded that such checks could be conducted by the Charity Commissioner.\n\nThe three-judge bench comprising CJI Khanna, Justice Sanjay Kumar, and Justice KV Viswanathan will continue the hearing tomorrow.ABOUT WAQF HEARING IN COURT\n\nThe Supreme Court on Wednesdayheard a batch of petitionschallenging the constitutional validity of the Waqf (Amendment) Act. The bench, led by Chief Justice Sanjiv Khanna, flagged concerns over the practicality of undoing waqf by user, especially for centuries-old masjids without registered sale deeds. The Court also questioned the composition of Waqf boards, which would include non-Muslim members following the amendment of Act.\n\nProviding interim relief, the Court said that properties declared as Waqf by courts should not be de-notified during the proceedings. It also stayed the provision that would prevent properties from being treated as Waqf while under investigation by the District Collector. The Court clarified that all Waqf board members must be Muslim, except ex-officio members. The hearing will continue tomorrow at 2 pm.Published By:Anuja JhaPublished On:Apr 16, 2025Tune InMust Watch"
      },
      {
        "title": "Will you allow Muslims on Hindu boards? Supreme Court questions Waqf composition",
        "author": "Unknown Author",
        "publication_date": "2025-04-16T16:47:23+05:30"
      }
    ]
  },
  "markdown_content": "## Constitutional Hearing\\nThe Supreme Court on Wednesday raised critical questions about the religious composition of Waqf boards during a hearing on the constitutional validity of the Waqf (Amendment) Act, 2025. The inclusion of non-Muslim members on Waqf boards has become a central point of contention.\\n\\n## Key Exchanges\\n> \"Are you saying that from now on you will allow Muslims to be part of Hindu endowment boards? Say it openly.\"\\n- Chief Justice of India Sanjiv Khanna\\n\\nThe exchange grew tense when the Solicitor General suggested that \"this bench also cannot hear the case,\" prompting a sharp response from Chief Justice Khanna:\\n\\n> \"When we sit over here, we lose our religion. For us both sides are the same. How can you compare it with the judges?\"\\n\\nJustice Viswanathan noted practical considerations regarding mosque access and familiarity with premises, to which the Solicitor General suggested such oversight could be handled by the Charity Commissioner.\\n\\n## Interim Ruling\\nThe Court provided interim relief, establishing that:\\n* Properties declared as Waqf by courts should not be de-notified during proceedings\\n* All Waqf board members must be Muslim, except for ex-officio members\\n\\nThe three-judge bench will continue the hearing tomorrow."
}