{
  "title": "Study finds common genetic variants linked to drug-resistant epilepsy",
  "publication_date": "2025-04-17T17:18:48+05:30",
  "summary": "A global study reveals that common genetic variants in CNIH3 and WDR26 genes may explain drug resistance in focal epilepsy patients. Researchers from UCL and UTHealth Houston analyzed data from 6,826 epilepsy patients, finding that these variants increase the risk of drug resistance and influence response to antiseizure medications. This discovery could help predict treatment outcomes earlier.",
  "content": "Certain common genetic changes may explain why some people with focal epilepsy become less responsive to seizure medications, finds a new global study.\n\nFocal epilepsy is a condition where seizures start in one part of the brain. It is the most common type of epilepsy. Antiseizure medication is usually prescribed for people with the condition. However, for one in three people with epilepsy (around 20 million individuals worldwide), current antiseizure medications are ineffective. This means that people will continue to have seizures despite taking medication -- a condition called \"drug resistance.\"\n\nIt is associated with additional significant health risks in epilepsy, including a higher risk of sudden unexpected death in epilepsy, alongside substantially higher healthcare costs.\n\nResearchers at the University College London in the UK and the University of Texas-Health Houston in the US found the reason in some specific common genetic variants in two genes: CNIH3 -- which helps control how certain brain receptors function; and WDR26 -- which is involved in various cell processes.\n\nThe study, published in the journal EBioMedicine showed that people with genetic variants in CNIH3 and WDR26 had a higher risk of having drug resistance in focal epilepsy. The variants also determined a person's response to antiseizure medications.\n\nFor the study, the researchers examined data on 6,826 people with epilepsy. They compared the genomes of those who had drug-resistant epilepsy (4,208 individuals) with those whose seizures were successfully controlled with antiseizure medications (2,618 individuals).\n\nThe findings are particularly important as these genetic signatures can be determined at the onset of epilepsy, rather than after several antiseizure medications have been tried without success. This could eventually help to predict which individuals with epilepsy are likely to develop drug resistance and avoid unnecessary exposure to ineffective medications and their associated side effects.",
  "category": "Health",
  "tags": [
    "medical research",
    "epilepsy",
    "genetics",
    "drug resistance",
    "neurology",
    "healthcare"
  ],
  "location": "unknown",
  "source": {
    "title": "Study finds common genetic variants linked to drug-resistant epilepsy",
    "publication_date": 1744870728,
    "content": [
      {
        "title": "Study finds common genetic variants linked to drug-resistant epilepsy",
        "publication_date": "2025-04-17T17:18:48+05:30",
        "content": "MORE\n\nRepresentative Image\n\nNEW DELHI:Certain common genetic changes may explain why some people with focal epilepsy become less responsive to seizure medications, finds a new global study.\n\nFocal epilepsy is a condition where seizures start in one part of the brain. It is the most common type of epilepsy.\n\nAntiseizure medication is usually prescribed for people with the condition. However, for one in three people with epilepsy (around 20 million individuals worldwide), current antiseizure medications are ineffective. This means that people will continue to have seizures despite taking medication -- a condition called \"drug resistance.\"\n\nIt is associated with additional significant health risks in epilepsy, including a higher risk of sudden unexpected death in epilepsy, alongside substantially higher healthcare costs.\n\nResearchers at the University College London in the UK and the University of Texas-Health Houston in the US found the reason in some specific common genetic variants in two genes: CNIH3 -- which helps control how certain brain receptors function; and WDR26 -- which is involved in various cell processes.\n\nThe study, published in the journal EBioMedicine showed that people with genetic variants in CNIH3 and WDR26 had a higher risk of having drug resistance in focal epilepsy. The variants also determined a person's response to antiseizure medications.\n\n\"The findings of our study offer new insights about why some people have seizures that are resistant to existing antiseizure medications,” said Professor Sanjay Sisodiya from UCL’s Queen Square Institute of Neurology.\n\n\"Recognising these genetic variants, which are frequent in the general population yet strongly influence treatment outcomes, underscores the need to expand genetic testing and future therapies to address polygenic epilepsy (a type of epilepsy that is influenced by multiple genes),\" added Costin Leu, Assistant Professor at UTHealth Houston).\n\nFor the study, the researchers examined data on 6,826 people with epilepsy.\n\nThey compared the genomes of those who had drug-resistant epilepsy (4,208 individuals) with those whose seizures were successfully controlled with antiseizure medications (2,618 individuals).\n\nThe findings are particularly important as these genetic signatures can be determined at the onset of epilepsy, rather than after several antiseizure medications have been tried without success.\n\nThis could eventually help to predict which individuals with epilepsy are likely to develop drug resistance and avoid unnecessary exposure to ineffective medications and their associated side effects, said the team.\n\n© Copyright  | Powered byHocalwire"
      },
      {
        "title": "Study finds common genetic variants linked to drug-resistant epilepsy",
        "author": "IANS",
        "publication_date": "2025-04-17T17:18:48+05:30"
      }
    ],
    "authors": [],
    "source": "dtnext",
    "image_url": "https://dtnext-prod-new.s3.ap-south-1.amazonaws.com/h-upload/2025/04/17/1500x900_861581-untitled-design-28.jpg",
    "url": "https://www.dtnext.in/lifestyle/wellbeing/study-finds-common-genetic-variants-linked-to-drug-resistant-epilepsy-830375"
  },
  "markdown_content": "## Background\\nFocal epilepsy is a condition where seizures start in one part of the brain. It is the most common type of epilepsy. Antiseizure medication is usually prescribed for people with the condition. However, for one in three people with epilepsy (around 20 million individuals worldwide), current antiseizure medications are ineffective. This means that people will continue to have seizures despite taking medication -- a condition called \"drug resistance.\"\\n\\nIt is associated with additional significant health risks in epilepsy, including a higher risk of sudden unexpected death in epilepsy, alongside substantially higher healthcare costs.\\n\\n## Research Findings\\nResearchers at the University College London in the UK and the University of Texas-Health Houston in the US found the reason in some specific common genetic variants in two genes:\\n* CNIH3 -- which helps control how certain brain receptors function\\n* WDR26 -- which is involved in various cell processes\\n\\nThe study, published in the journal EBioMedicine showed that people with genetic variants in CNIH3 and WDR26 had a higher risk of having drug resistance in focal epilepsy. The variants also determined a person's response to antiseizure medications.\\n\\n## Study Methodology\\nFor the study, the researchers examined data on 6,826 people with epilepsy. They compared the genomes of those who had drug-resistant epilepsy (4,208 individuals) with those whose seizures were successfully controlled with antiseizure medications (2,618 individuals).\\n\\n## Significance\\nThe findings are particularly important as these genetic signatures can be determined at the onset of epilepsy, rather than after several antiseizure medications have been tried without success. This could eventually help to predict which individuals with epilepsy are likely to develop drug resistance and avoid unnecessary exposure to ineffective medications and their associated side effects."
}