{
  "title": "Top tips for reducing cancer risk through lifestyle changes",
  "publication_date": "2025-04-18T12:21:00+03:00",
  "summary": "Dietitian Çisem Gündüz shares insights on reducing cancer risk through lifestyle changes. A Mediterranean diet can lower cancer risk by up to 20%, while regular exercise and proper nutrition play crucial roles in prevention. The article highlights specific foods like yogurt, pickles, and antioxidant-rich vegetables that boost immunity and help prevent cancer.",
  "content": "Cancer is one of the leading causes of death worldwide, but what if simple lifestyle changes could significantly lower the risk? Dietitian Çisem Gündüz offers valuable insights into how nutrition and lifestyle can play a significant role in cancer prevention. According to Gündüz, individuals who adopt a Mediterranean diet can reduce their risk of developing cancer by up to 20%.\n\nStudies from the World Cancer Research Fund and the American Institute for Cancer Research show that 30-50% of cancers can be prevented. Harvard Medical School suggests consuming at least 400 grams of fruits and vegetables daily helps protect against certain types of cancer, including stomach and colon cancer.\n\nRegular physical activity is crucial, with 150 minutes of moderate exercise per week potentially lowering the risk of several cancer types, especially breast and colon cancer. Smoking accounts for 85% of lung cancer cases, while alcohol consumption increases the risk of breast, liver, and esophageal cancers.\n\nGündüz emphasizes the importance of melatonin and stress management in cancer prevention. Antioxidants like vitamin C, vitamin E, selenium, and flavonoids help prevent DNA damage. Lycopene and carotenoids found in tomatoes and other vegetables can reduce prostate cancer risk by 30%.\n\nStrengthening gut health through foods like yogurt, pickles, garlic, and onions enhances immune function. Cruciferous vegetables contain cancer-fighting enzymes, while omega-3 fatty acids can slow cancer cell proliferation. The WHO classifies processed meats as carcinogenic, and high glycemic index foods have been linked to various cancers.",
  "category": "Health",
  "tags": [
    "cancer prevention",
    "nutrition",
    "diet",
    "lifestyle",
    "Mediterranean diet",
    "exercise",
    "health",
    "antioxidants",
    "immune system"
  ],
  "location": "unknown",
  "source": {
    "title": "Top tips for reducing cancer risk through lifestyle changes | Daily Sabah",
    "publication_date": 1744957367,
    "content": [
      {
        "title": "Top tips for reducing cancer risk through lifestyle changes",
        "publication_date": "2025-04-18T12:21:00+03:00",
        "content": "Cancer is one of the leading causes of death worldwide, but what if simple lifestyle changes could significantly lower the risk? Dietitian Çisem Gündüz offers valuable insights into how nutrition and lifestyle can play a significant role in cancer prevention. According to Gündüz, individuals who adopt a Mediterranean diet can reduce their risk of developing cancer by up to 20%. She also highlights specific foods, such as yogurt, pickles, garlic and onions, known for their immune-boosting properties and overall health benefits.\n\nGündüz emphasizes the importance of nutrition and lifestyle in reducing cancer risk. Studies from the World Cancer Research Fund (WCRF) and the American Institute for Cancer Research (AICR) show that 30-50% of cancers can be prevented. Nutrition is one of the most significant modifiable risk factors in this regard.\n\nAccording to Harvard Medical School, consuming at least 400 grams of fruits and vegetables daily helps protect against certain types of cancer, including stomach and colon cancer. Gündüz also references studies showing that individuals who closely follow a Mediterranean diet can reduce their overall cancer risk by 10-20%. This diet is rich in antioxidants, anti-inflammatory compounds and fiber – all of which play a positive role in cancer prevention and treatment. Foods such as whole grains, legumes, and fiber-rich vegetables offer particularly strong protection against colon cancer.\n\nRegular physical activity is another key factor in reducing cancer risk. Gündüz highlights clinical research suggesting that engaging in 150 minutes of moderate exercise per week can lower the risk of several types of cancer, especially breast and colon cancer. Furthermore, smoking is responsible for 85% of lung cancer cases, while alcohol consumption has been linked to an increased risk of breast, liver, and esophageal cancers.\n\nGündüz mentions melatonin, a hormone that supports cell renewal and plays a key role in regulating the body’s circadian rhythm. Chronic stress, which suppresses the immune system, can accelerate the development of certain types of cancer. She also emphasizes the importance of antioxidants in preventing DNA damage, which is crucial for cancer prevention. Vitamin C, vitamin E, selenium, polyphenols, and flavonoids can all help reduce cancer risk. Specifically, lycopene and carotenoids – found in tomatoes, carrots, sweet potatoes and red peppers – protect against DNA damage and reduce inflammation. Clinical studies have shown that high lycopene intake can reduce prostate cancer risk by 30%.\n\nStrengthening gut health is essential for supporting the immune system. Gündüz recommends foods like yogurt, pickles, garlic, and onions, which enhance gut flora and improve immune function, further helping to reduce cancer risk.\n\nBroccoli, cauliflower, cabbage, and turnips contain enzymes that neutralize carcinogens. Omega-3 fatty acids, found in salmon, flax seeds, and walnuts, can also slow cancer cell proliferation by stabilizing cell membranes. Additionally, prebiotics and probiotics, which strengthen gut flora, support immunity and lower cancer risk. Foods rich in flavonoids and polyphenols – such as green tea, pomegranate, and red grapes – aid in cell renewal and protect healthy cell functions.\n\nGündüz also warns against consuming processed meats, such as salami, sausage and pepperoni, which the World Health Organization (WHO) classifies as carcinogenic (Group 1). High glycemic index foods, which increase insulin resistance, have been linked to various cancers, particularly those of the pancreas, breast and colon."
      },
      {
        "title": "Top tips for reducing cancer risk through lifestyle changes",
        "author": "Daily Sabah with IHA",
        "publication_date": "2025-04-18T12:21:00+03:00"
      }
    ],
    "authors": [],
    "source": "Daily Sabah",
    "image_url": "https://idsb.tmgrup.com.tr/ly/uploads/images/2025/04/18/thumbs/800x531/378252.jpg",
    "url": "https://www.dailysabah.com/life/health/top-tips-for-reducing-cancer-risk-through-lifestyle-changes"
  },
  "markdown_content": "## The Role of Lifestyle in Cancer Prevention\\n\\nCancer is one of the leading causes of death worldwide, but what if simple lifestyle changes could significantly lower the risk? Dietitian Çisem Gündüz offers valuable insights into how nutrition and lifestyle can play a significant role in cancer prevention.\\n\\n> \"Individuals who adopt a Mediterranean diet can reduce their risk of developing cancer by up to 20%,\" states Gündüz.\\n\\n## Research Findings\\n\\nStudies from the World Cancer Research Fund and the American Institute for Cancer Research show that 30-50% of cancers can be prevented. Harvard Medical School suggests consuming at least 400 grams of fruits and vegetables daily helps protect against certain types of cancer, including stomach and colon cancer.\\n\\n## Exercise and Risk Factors\\n\\nRegular physical activity is crucial, with 150 minutes of moderate exercise per week potentially lowering the risk of several cancer types, especially breast and colon cancer. Smoking accounts for 85% of lung cancer cases, while alcohol consumption increases the risk of breast, liver, and esophageal cancers.\\n\\n## Preventive Measures and Nutrients\\n\\nGündüz emphasizes the importance of melatonin and stress management in cancer prevention. Key protective elements include:\\n\\n* Antioxidants like vitamin C, vitamin E, selenium, and flavonoids help prevent DNA damage\\n* Lycopene and carotenoids found in tomatoes and other vegetables can reduce prostate cancer risk by 30%\\n\\n## Dietary Recommendations\\n\\nStrengthening gut health through foods like yogurt, pickles, garlic, and onions enhances immune function. Additional dietary considerations include:\\n\\n* Cruciferous vegetables contain cancer-fighting enzymes\\n* Omega-3 fatty acids can slow cancer cell proliferation\\n* The WHO classifies processed meats as carcinogenic\\n* High glycemic index foods have been linked to various cancers"
}