{
  "title": "Military Assistance to Israel Expedited Under Emergency Declaration",
  "publication_date": "2025-03-01T00:00:00Z",
  "summary": "Secretary of State Marco Rubio announced the signing of an emergency declaration to expedite $4 billion in military assistance to Israel, reversing previous restrictions. The Trump Administration has approved approximately $12 billion in major Foreign Military Sales to Israel and repealed earlier conditions on military aid.",
  "content": "Secretary of State Marco Rubio has signed a declaration invoking emergency authorities to expedite approximately $4 billion in military assistance to Israel. The action marks a reversal of what was described as the Biden Administration's partial arms embargo, which had withheld certain weapons and ammunition from Israel.\n\nThe Trump Administration has demonstrated its commitment to Israel's security by approving nearly $12 billion in major Foreign Military Sales (FMS) to Israel since taking office. This latest decision accompanies President Trump's repeal of a Biden-era memorandum that had placed what officials called \"baseless and politicized conditions\" on military assistance to Israel during a period when the ally was engaged in conflicts against Iran and terror proxies on multiple fronts.\n\nThe Administration has pledged to continue utilizing all available tools to uphold America's long-standing commitment to Israel's security, including measures to counter security threats.",
  "category": "World",
  "tags": [
    "foreign policy",
    "military aid",
    "Israel",
    "United States",
    "diplomacy",
    "defense",
    "Trump administration"
  ],
  "location": "United States",
  "source": {
    "title": "Joint Statement on the United States-Ukraine Meeting in Jeddah",
    "publication_date": 1741656600,
    "content": [
      {
        "title": "Military Assistance to Israel - United States Department of State",
        "publication_date": "Unknown",
        "content": "Official websites use .gov\n\nSecure .gov websites use HTTPS\n\nCountries &Areas\n\nBureaus &Offices\n\nAbout\n\nMission\n\nHistory\n\nAdministrative\n\nLeadership\n\nDirectories\n\nPress Statement\n\nMarco Rubio, Secretary of State\n\nMarch 1, 2025\n\nI have signed a declaration to use emergency authorities to expedite the delivery of approximately $4 billion in military assistance to Israel. The decision to reverse the Biden Administration’s partial arms embargo, which wrongly withheld a number of weapons and ammunition from Israel, is yet another sign that Israel has no greater ally in the White House than President Trump.\n\nSince taking office, the Trump Administration has approved nearly $12 billion in major FMS sales to Israel. This important decision coincides with President Trump’s repeal of a Biden-era memorandum which had imposed baseless and politicized conditions on military assistance to Israel at a time when our close ally was fighting a war of survival on multiple fronts against Iran and terror proxies.\n\nThe Trump Administration will continue to use all available tools to fulfill America’s long-standing commitment to Israel’s security, including means to counter security threats.\n\nTags\n\nWe use cookies to make our website work better and improve your experience. By continuing to use the site, you agree to our privacy policy.\n\nWe use cookies to make our website work better and improve your experience. By continuing to use the site, you agree to our privacy policy."
      },
      {
        "title": "Military Assistance to Israel - United States Department of State",
        "author": "Unknown Author",
        "publication_date": "Unknown"
      }
    ],
    "authors": [],
    "source": "U.S. Department of State (.gov)",
    "image_url": "https://www.state.gov/wp-content/uploads/2025/01/Press_Release_Alabaster.png",
    "url": "https://www.state.gov/joint-statement-on-the-united-states-ukraine-meeting-in-jeddah/"
  },
  "markdown_content": "## Policy Reversal\\nSecretary of State Marco Rubio has signed a declaration invoking emergency authorities to expedite approximately $4 billion in military assistance to Israel. The action marks a reversal of what was described as the Biden Administration's partial arms embargo, which had withheld certain weapons and ammunition from Israel.\\n\\n## Military Support\\nThe Trump Administration has demonstrated its commitment to Israel's security by approving nearly $12 billion in major Foreign Military Sales (FMS) to Israel since taking office. This latest decision accompanies President Trump's repeal of a Biden-era memorandum that had placed what officials called \"baseless and politicized conditions\" on military assistance to Israel during a period when the ally was engaged in conflicts against Iran and terror proxies on multiple fronts.\\n\\n## Ongoing Commitment\\nThe Administration has pledged to continue utilizing all available tools to uphold America's long-standing commitment to Israel's security, including measures to counter security threats."
}