{
  "title": "China scientists develop flash memory 10,000× faster than current tech",
  "publication_date": "2024-01-15T12:45:40Z",
  "summary": "Researchers at Fudan University have created a revolutionary non-volatile flash memory called \"PoX\" that can program a single bit in 400 picoseconds, making it 10,000 times faster than current technology. The device combines graphene channels with AI-driven optimization to achieve unprecedented speed while maintaining data retention without power.",
  "content": "A research team at Fudan University has built the fastest semiconductor storage device ever reported, a non-volatile flash memory dubbed \"PoX\" that programs a single bit in 400 picoseconds (0.0000000004 s) — roughly 25 billion operations per second. The result, published today in Nature, pushes non-volatile memory to a speed domain previously reserved for the quickest volatile memories and sets a benchmark for data-hungry AI hardware.\n\nConventional static and dynamic RAM (SRAM, DRAM) write data in 1–10 nanoseconds but lose everything when power is cut. Flash chips, by contrast, hold data without power yet typically need micro- to milliseconds per write — far too slow for modern AI accelerators that shunt terabytes of parameters in real time.\n\nThe Fudan group, led by Prof. Zhou Peng at the State Key Laboratory of Integrated Chips and Systems, re-engineered flash physics by replacing silicon channels with two-dimensional Dirac graphene and exploiting its ballistic charge transport.\n\nUsing AI-driven process optimization, the team achieved two-dimensional super-injection, which enables an effectively limitless charge surge into the storage layer that bypasses the classical injection bottleneck.\n\nThe device combines ultra-low energy consumption with picosecond write speeds, potentially eliminating the memory bottleneck in AI systems. If mass-produced, PoX-style memory could eliminate separate high-speed SRAM caches in AI chips, slashing area and energy requirements while enabling instant-on, low-power devices.\n\nFudan engineers are now scaling the cell architecture and pursuing array-level demonstrations, though commercial partners have not been named. If successful, PoX could emerge as a new class of ultra-fast, ultra-green memories particularly suited for large-language-model accelerators.",
  "category": "Technology",
  "tags": [
    "semiconductor",
    "flash memory",
    "artificial intelligence",
    "research",
    "china",
    "computer hardware",
    "innovation",
    "graphene"
  ],
  "location": "Shanghai, China",
  "source": {
    "title": "China scientists develop flash memory 10,000× faster than current tech",
    "publication_date": 1744880340,
    "content": [
      {
        "title": "China scientists develop flash memory 10,000× faster than current tech",
        "publication_date": "Unknown",
        "content": "PoX could be the key to unlocking performance bottlenecks caused by storage limitations in AI hardware\n\n18 hours ago\n\na day ago\n\na day ago\n\na day ago\n\na day ago\n\na day ago\n\n2 days ago\n\n2 days ago\n\n2 days ago\n\n2 days ago\n\nan hour ago\n\n2 hours ago\n\n3 hours ago\n\n13 hours ago\n\n14 hours ago\n\n15 hours ago\n\n17 hours ago\n\n17 hours ago\n\n18 hours ago\n\n18 hours ago\n\nKaif Shaikh\n\nCombining the speed of SRAM with the data‑retention of flash this device meets AI’s staggering bandwidth and power demands (Image is representative)\n\niStock\n\nA research team at Fudan University has built the fastest semiconductor storage device ever reported, a non‑volatile flash memory dubbed “PoX” that programs a single bit in 400 picoseconds (0.0000000004 s) — roughly 25 billion operations per second. The result, published today in Nature, pushes non‑volatile memory to a speed domain previously reserved for the quickest volatile memories and sets a benchmark for data‑hungry AI hardware.\n\nConventional static and dynamic RAM (SRAM, DRAM) write data in 1–10 nanoseconds but lose everything when power is cut. Flash chips, by contrast, hold data without power yet typically need micro‑ to milliseconds per write — far too slow formodern AIaccelerators that shunt terabytes of parameters in real time.\n\nThe Fudan group, led by Prof. Zhou Peng at the State Key Laboratory of Integrated Chips and Systems, re‑engineered flash physics by replacing silicon channels with two‑dimensional Dirac graphene and exploiting its ballistic charge transport.\n\nBy tuning the “Gaussian length” of the channel, the team achieved two‑dimensional super‑injection, which is an effectively limitless charge surge into the storage layer that bypasses the classical injection bottleneck.\n\n“Using AI‑driven process optimization, we drove non‑volatile memory to its theoretical limit,” Zhou told Xinhua, adding that the feat “paves the way for future high‑speed flash memory.”\n\nCo‑author Liu Chunsen likens the breakthrough to shifting from a U‑disk that writes 1,000 times per second to a chip that fires 1 billion times in the blink of an eye. The previous world record for non‑volatile flash programming speed was about two million operations per second.\n\nBecause PoX is non‑volatile, it retains data with no standby power, a critical property for next‑generation edge AI andbattery‑constrained systems. Combining ultra‑low energy with picosecond write speeds could remove the long‑standing memory bottleneck in AI inference and training hardware, where data shuttling, not arithmetic, now dominates power budgets.\n\nFlash memory remains a cornerstone of global semiconductor strategy thanks to its cost and scalability. Fudan’s advance, reviewers say, offers a “completely original mechanism” that may disrupt that landscape.\n\nIf mass‑produced, PoX‑style memory could eliminate separate high‑speed SRAM caches in AI chips, slashing area and energy. It can enable instant‑on, low‑powerlaptopsand phones, and support database engines that hold entire working sets in persistent RAM.\n\nThe device can also strengthen China’s domestic drive to secure leadership in foundationalchip technologies. The team did not disclose endurance figures or fabrication yield, but the graphene channel suggests compatibility with existing 2D‑material processes that global fabs are already exploring. “Our breakthrough can reshape storage technology, drive industrial upgrades and open new application scenarios,” Zhou said.\n\nFudan engineers are now scaling the cell architecture and pursuing array‑level demonstrations. Commercial partners have not been named, but Chinese foundries are racing to integrate 2D materials with mainstream CMOS lines.\n\nIf successful, PoX could come in as a new class of ultra‑fast, ultra‑green memories that meet the swelling appetite of large‑language‑model accelerators, finally giving AI hardware a storage medium that keeps pace with its logic.\n\nKaif ShaikhKaif Shaikh is a journalist and writer passionate about turning complex information into clear, impactful stories. His writing covers technology, sustainability, geopolitics, and occasionally fiction. Kaif's bylines can be found in Times of India, Techopedia, and Kitaab. Apart from the long list of things he does outside work, he likes to read, breathe, and practice gratitude.\n\nStay up-to-date on engineering, tech, space, and science news with The Blueprint.\n\nBy clicking sign up, you confirm that you accept this site'sTerms of UseandPrivacy Policy\n\na day ago\n\na day ago\n\na day ago\n\na day ago\n\nLoading opportunities...\n\nPremium\n\nIE PRO\n\nFollow"
      },
      {
        "title": "China scientists develop flash memory 10,000× faster than current tech",
        "author": "Kaif Shaikh",
        "publication_date": "Unknown"
      }
    ],
    "authors": [
      "Kaif Shaikh"
    ],
    "source": "Interesting Engineering",
    "image_url": "https://interestingengineering.com/_next/image?url=https%3A%2F%2Fcms.interestingengineering.com%2Fwp-content%2Fuploads%2F2025%2F04%2FThumbnails-for-IE-articles-Fastest-Flash-Drive-.jpg&w=1200&q=75",
    "url": "https://interestingengineering.com/innovation/china-worlds-fastest-flash-memory-device"
  },
  "markdown_content": "## Breakthrough in Memory Technology\\nA research team at Fudan University has built the fastest semiconductor storage device ever reported, a non-volatile flash memory dubbed \"PoX\" that programs a single bit in 400 picoseconds (0.0000000004 s) — roughly 25 billion operations per second. The result, published today in Nature, pushes non-volatile memory to a speed domain previously reserved for the quickest volatile memories and sets a benchmark for data-hungry AI hardware.\\n\\n## Technical Background\\nConventional static and dynamic RAM (SRAM, DRAM) write data in 1–10 nanoseconds but lose everything when power is cut. Flash chips, by contrast, hold data without power yet typically need micro- to milliseconds per write — far too slow for modern AI accelerators that shunt terabytes of parameters in real time.\\n\\n## Innovation Details\\nThe Fudan group, led by Prof. Zhou Peng at the State Key Laboratory of Integrated Chips and Systems, re-engineered flash physics by replacing silicon channels with two-dimensional Dirac graphene and exploiting its ballistic charge transport.\\n\\nUsing AI-driven process optimization, the team achieved two-dimensional super-injection, which enables an effectively limitless charge surge into the storage layer that bypasses the classical injection bottleneck.\\n\\n## Potential Impact\\nThe device combines ultra-low energy consumption with picosecond write speeds, potentially eliminating the memory bottleneck in AI systems. If mass-produced, PoX-style memory could eliminate separate high-speed SRAM caches in AI chips, slashing area and energy requirements while enabling instant-on, low-power devices.\\n\\n## Future Development\\nFudan engineers are now scaling the cell architecture and pursuing array-level demonstrations, though commercial partners have not been named. If successful, PoX could emerge as a new class of ultra-fast, ultra-green memories particularly suited for large-language-model accelerators."
}