{
  "title": "USA Oil, Gas Operators Encounter Avalanche of Economic Policy Changes",
  "publication_date": "2024-01-15T00:00:00Z",
  "summary": "U.S. oil and gas operators face significant uncertainty due to recent Trump administration policy changes. Rystad Energy projects that onshore Lower 48 production will remain below November 2023's record high of 11.37 million barrels per day until at least June. The industry faces challenges from price downturns, decreased reinvestment rates, and potential economic recession risks.",
  "content": "U.S. oil and gas operators have encountered an avalanche of economic policy changes from the Trump administration over the last week, creating market uncertainty in an already maturing industry.\n\nRystad Energy expects onshore Lower 48 production will fall short of the record high output of 11.37 million barrels per day of oil, achieved in November 2023, until at least June of this year. The outlook faces serious downside pressure should the recent price downturn hold, forcing operators to cut back on rig activity.\n\nConsistent returns are top of mind for U.S. producers looking to squeeze as many dollars as possible out of their barrels. For tight oil players, decreased reinvestment rates result from fewer growth-oriented private players on the market along with their continued focus on disciplined spending and modest growth.\n\nRystad warns that existing capital frameworks will be put to the test over the coming quarters should President Trump's tariff strategy lead to an economic recession and oil demand destruction. Even prior to the price drop following the president's tariff rollout, exploration and production management teams worried about policy unpredictability.\n\nPublicly traded firms have guided plans to increase volumes by roughly 2.5 percent in 2025 while reducing spending by more than six percent. This growth, now at risk due to price collapse, is driven largely by major diversified public players and supermajors.\n\nThe EIA projects that U.S. crude oil production, including lease condensate, will average 13.51 million barrels per day in 2025 and 13.56 million barrels per day in 2026.",
  "category": "Business",
  "tags": [
    "oil and gas",
    "energy policy",
    "Trump administration",
    "economic policy",
    "Rystad Energy",
    "production output",
    "market uncertainty"
  ],
  "location": "United States",
  "source": {
    "title": "USA Oil, Gas Operators Encounter Avalanche of Economic Policy Changes",
    "publication_date": 1744873500,
    "content": [
      {
        "title": "USA Oil, Gas Operators Encounter Avalanche of Economic Policy Changes",
        "publication_date": "Unknown",
        "content": "U.S. oil and gas operators have encountered an avalanche of economic policy changes from the Trump administration over the last week, creating market uncertainty in an already maturing industry.\n\nThat’s what Rystad Energy stated in a release sent to Rigzone by the Rystad team late Tuesday, adding that it expects onshore Lower 48 production “will fall short of the record high output of 11.37 million barrels per day of oil, achieved in November 2023, until at least June of this year”.\n\nRystad warned in the release, however, that this outlook “faces serious downside pressure should the recent price downturn hold, forcing operators to cut back on rig activity”.Rystad Energy said U.S. oil and gas operators have encountered an avalanche of economic policy changes from the Trump administration over the last week.Image by Jag_cz via iStockImage by Jag_cz via iStockRystad Energy said U.S. oil and gas operators have encountered an avalanche of economic policy changes from the Trump administration over the last week.\n\nIn the release, Rystad said consistent returns are top of mind for U.S. producers looking to squeeze as many dollars as possible out of their barrels, and added that, for these tight oil players, decreased reinvestment rates result from fewer growth-oriented private players on the market along with their continued focus on disciplined spending and modest growth.\n\nRystad went on to warn in the release that existing capital frameworks will be put to the test over the coming quarters, “should President Trump’s tariff strategy lead to an economic recession and, by extension, oil demand destruction”.\n\n“Even prior to the drop in prices following the president’s tariff rollout, exploration and production (E&P) management teams worried about policy unpredictability,” Rystad said in the release.\n\n“Publicly traded firms guided plans to increase volumes by roughly 2.5 percent in 2025 while reducing spending by more than six percent. Much of this growth, which is now at risk due to the collapse in prices, is driven by some of the largest diversified public players and supermajors, capable of diverting cash flows from global operations to fund more growth-oriented programs in U.S. tight oil, while still maintaining capital discipline at a corporate level,” it added.\n\n“Although half-cycle breakeven prices of most wells being drilled today are in the $50 per barrel range, we estimate that public, tight oil E&Ps need more than another $9 per barrel to cover shareholder returns,” it continued.\n\nRystad revealed in the release that it currently expects about 300,000 barrels per day of exit to exit growth in 2025, “all in the Permian - a concentration that presents another risk”.\n\n“Permian natural gas prices remain weak, and our projections show that dry gas production in the basin has little or no growth potential in 2025,” it added.\n\nIn the release, Matthew Bernstein, Vice President of North America Oil and Gas Research at Rystad Energy, said, “U.S. oil operators face both significant subsurface and above ground risks as they plan their capital investment programs”.\n\n“While most oil plays are seeing deteriorating normalized productivity, U.S. producers must also compete on a global market to meet an uncertain but likely decelerating demand outlook,” he added.\n\n“Rystad Energy has long maintained that presidents have very few supply-oriented policy measures at their disposal to increase U.S. oil output,” he continued.\n\n“Doing this while also bringing down prices at the same time is even more unrealistic, as producers see WTI in the $70 per barrel range as supportive of only modest growth,” Bernstein went on to state.\n\nIn a report sent to Rigzone by Standard Chartered Bank Commodities Research Head Paul Horsnell late Monday, analysts at the bank, including Horsnell, said they expect U.S. oil production to weaken over the next three months.\n\nRigzone has contacted the White House, the U.S. Department of Energy, and the American Petroleum Institute for comment on Rystad’s release and Standard Chartered Bank’s report. At the time of writing, none of the above have responded to Rigzone.\n\nIn its latest short term energy outlook (STEO), which was released on April 10, the U.S. Energy Information Administration (EIA) projected that U.S. crude oil production, including lease condensate, will average 13.51 million barrels per day in 2025 and 13.56 million barrels per day in 2026.\n\nLower 48 states, excluding the Gulf of America, are expected to produce 11.28 million barrels per day of the 2025 total and 11.29 million barrels per day of the 2026 total, the EIA’s April STEO showed.\n\nThe Federal Gulf of America is expected to produce 1.80 million barrels per day of this year’s total and 1.83 million barrels per day of next year’s total, and Alaska is expected to produce 0.42 million barrels per day of the 2025 total and 0.44 million barrels per day of the 2026 total, the EIA’s latest STEO highlighted.\n\nTo contact the author, emailandreas.exarheas@rigzone.com\n\nWhat do you think? We’d love to hear from you, join the conversation on theRigzone Social Network.TheRigzone Social Networkis a new social experience created for you and all energy professionals to Speak Up about our industry, share knowledge, connect with peers and industry insiders and engage in a professional community that will empower your career in energy."
      },
      {
        "title": "USA Oil, Gas Operators Encounter Avalanche of Economic Policy Changes",
        "author": "Unknown Author",
        "publication_date": "Unknown"
      }
    ],
    "authors": [
      "Andreas Exarheas"
    ],
    "source": "Rigzone",
    "image_url": "https://images.rigzone.com/images/news/articles/USA-Oil-Gas-Operators-Encounter-Avalanche-of-Economic-Policy-Changes-180255-320x180.png",
    "url": "https://www.rigzone.com/news/usa_oil_gas_operators_encounter_avalanche_of_economic_policy_changes-17-apr-2025-180255-article/"
  },
  "markdown_content": "## Market Outlook\\n\\nU.S. oil and gas operators have encountered an avalanche of economic policy changes from the Trump administration over the last week, creating market uncertainty in an already maturing industry.\\n\\nRystad Energy expects onshore Lower 48 production will fall short of the record high output of 11.37 million barrels per day of oil, achieved in November 2023, until at least June of this year. The outlook faces serious downside pressure should the recent price downturn hold, forcing operators to cut back on rig activity.\\n\\n## Industry Response\\n\\nConsistent returns are top of mind for U.S. producers looking to squeeze as many dollars as possible out of their barrels. For tight oil players, decreased reinvestment rates result from fewer growth-oriented private players on the market along with their continued focus on disciplined spending and modest growth.\\n\\nRystad warns that existing capital frameworks will be put to the test over the coming quarters should President Trump's tariff strategy lead to an economic recession and oil demand destruction. Even prior to the price drop following the president's tariff rollout, exploration and production management teams worried about policy unpredictability.\\n\\n## Production Forecasts\\n\\nPublicly traded firms have guided plans to increase volumes by roughly 2.5 percent in 2025 while reducing spending by more than six percent. This growth, now at risk due to price collapse, is driven largely by major diversified public players and supermajors.\\n\\nThe EIA projects that U.S. crude oil production, including lease condensate, will average:\\n* 13.51 million barrels per day in 2025\\n* 13.56 million barrels per day in 2026"
}