{
  "title": "DeepTek's Chest X-ray AI Solution Receives CE MDR Class IIb Certification",
  "publication_date": "2025-04-17T13:33:57+00:00",
  "summary": "DeepTek's Chest X-ray AI solution has received CE MDR Class IIb certification for its AI-powered radiology diagnostic tool. The solution can detect various lung conditions, medical devices, and uniquely interpret pediatric chest X-rays. Already deployed across 325 sites and having screened over 2 million people for TB, the certification enables expansion across Europe and CE-mark recognized regions.",
  "content": "DeepTek, a leading provider of AI-powered radiology solutions, has announced that its Chest X-ray AI solution has received CE certification under the European Union Medical Device Regulation (EU MDR) as a Class IIb medical device. This achievement marks a significant milestone in DeepTek's mission to transform diagnostic radiology worldwide.\n\nThe solution assists physicians in interpreting frontal chest X-rays by detecting various lung conditions including nodules, masses, tuberculosis, pneumothorax, and over 20 other findings. It can also identify multiple medical devices commonly found in inpatient and ICU settings, and uniquely offers pediatric chest X-ray interpretation capabilities.\n\nDr. Amit Kharat, Co-Founder of DeepTek, emphasized that the certification reflects their commitment to clinical excellence and patient safety. The solution serves as a concurrent reading aid to improve radiologist efficiency and diagnostic confidence.\n\nThe certification enables DeepTek to expand across Europe and CE-mark recognized regions. The solution has already demonstrated significant impact, having screened over 2 million people for TB across 325 sites. It is particularly valuable in regions with high TB burden and limited access to expert radiology.\n\nFounded in 2017, DeepTek is a US-incorporated radiology AI company with deployments across 1,200+ sites, processing over 3,000 studies daily. The solution has also received US FDA CADe approval, reinforcing its reliability in medical imaging applications.",
  "category": "Technology",
  "tags": [
    "artificial intelligence",
    "healthcare",
    "medical technology",
    "radiology",
    "certification",
    "tuberculosis",
    "diagnostics"
  ],
  "location": "United States",
  "source": {
    "title": "DeepTek’s Chest X-ray AI Solution Receives CE MDR Class IIb Certification",
    "publication_date": 1744896837,
    "content": [
      {
        "title": "DeepTek’s Chest X-ray AI Solution Receives CE MDR Class IIb Certification",
        "publication_date": "2025-04-17T13:33:57+00:00",
        "content": "Δ\n\nDeepTek, a leading provider of AI-powered radiology solutions, is proud to announce that its Chest X-ray AI solution has received CE certification under the European Union Medical Device Regulation (EU MDR) as a Class IIb medical device. This marks a significant milestone in DeepTek’s commitment to delivering safe, effective, and scalable AI tools to transform diagnostic radiology worldwide.\n\nThe Chest X-ray AI solution is designed to assist physicians in interpreting frontal chest X-rays (AP/PA views). Powered by advanced machine learning, the solution detects a host of lung conditions such as nodules, lung masses, tuberculosis, pneumothorax, and over 20 other findings, including rib and clavicular fractures.\n\nIn addition, the solution identifies multiple medical devices commonly encountered in inpatient and ICU settings, such as chest leads, pacemakers, and various tubes, providing critical support in complex clinical scenarios.\n\nA unique feature of this solution is its ability to interpret pediatric chest X-rays, including the detection of pediatric tuberculosis and pneumonia, enhancing diagnostic capabilities in younger populations—a segment often underserved by conventional AI models.\n\n“This CE MDR Class IIb certification reflects our deep commitment to clinical excellence and patient safety,”said Dr Amit Kharat, Co-Founder of DeepTek. “Our Chest X-ray AI solution acts as a concurrent reading aid, highlighting regions of suspicion to improve radiologist efficiency and diagnostic confidence.”\n\nThe certification enables DeepTek to expand the availability of its solution across Europe and other CE\n\n-mark recognized regions, offering a powerful tool to enhance productivity, reduce diagnostic delays, and support quality care delivery at scale\n\nWith this regulatory clearance for TB and other critical lung conditions, DeepTek’s AI-powered Chest X-ray solution is a trusted and clinically validated tool used across public health screening and hospital workflows. Additionally, it is among the few solutions to have received comprehensive US FDA CADe approval, further reinforcing its reliability and clinical rigor in medical imaging applications.\n\nThe need for such solutions is particularly urgent in regions grappling with a high TB burden and limited access to expert radiology. With a staggering TB burden and growing radiology workload, CE certification paves the way for deployment across Europe, Asia, Africa, and other CE-mark-recognized regions where\n\nAI-driven diagnostics are not just valuable—but vital. This milestone is not just about regulatory success—it’s about saving lives through early detection and bridging gaps in healthcare access.\n\nDeepTek’s Chest X-ray AI solution is already making a meaningful impact, having screened over 2 million people for TB. The solution is deployed across 325 sites for TB screening, supporting national TB programs and public health initiatives across multiple geographies.\n\nAbout DeepTek\n\nFounded in 2017, DeepTek is a US-incorporated radiology AI company with a global footprint and a mission to democratize expert radiology access. With deployments across 1,200+ sites and over 3,000 studies processed daily, DeepTek’s US FDA-cleared and CE-certified solutions empower radiologists and healthcare providers to deliver faster, more accurate diagnoses.\n\nCXOtoday is a premier resource on the world of IT, relevant to key business decision makers. We offer IT perspective & news to the C-suite audience. We also provide business and technology news to those who evaluate, invest, and manage the IT infrastructure of organizations. CXOtoday has a well-networked and strong community that encourages discussions on what’s happening in the world of IT and its impact on businesses.\n\nCopyright © 2025 Trivone. All Rights Reserved."
      },
      {
        "title": "DeepTek’s Chest X-ray AI Solution Receives CE MDR Class IIb Certification",
        "author": "CXOtoday News Desk",
        "publication_date": "2025-04-17T13:33:57+00:00"
      }
    ],
    "authors": [],
    "source": "CXOToday.com",
    "image_url": null,
    "url": "https://cxotoday.com/press-release/deepteks-chest-x-ray-ai-solution-receives-ce-mdr-class-iib-certification/"
  },
  "markdown_content": "## AI-Powered Radiology Milestone\\nDeepTek, a leading provider of AI-powered radiology solutions, has announced that its Chest X-ray AI solution has received CE certification under the European Union Medical Device Regulation (EU MDR) as a Class IIb medical device. This achievement marks a significant milestone in DeepTek's mission to transform diagnostic radiology worldwide.\\n\\n## Technical Capabilities\\nThe solution assists physicians in interpreting frontal chest X-rays by detecting various lung conditions including:\\n* Nodules\\n* Masses\\n* Tuberculosis\\n* Pneumothorax\\n* Over 20 other findings\\n\\nAdditionally, it can identify multiple medical devices commonly found in inpatient and ICU settings, and uniquely offers pediatric chest X-ray interpretation capabilities.\\n\\n## Leadership Perspective\\n> Dr. Amit Kharat, Co-Founder of DeepTek, emphasized that the certification reflects their commitment to clinical excellence and patient safety. The solution serves as a concurrent reading aid to improve radiologist efficiency and diagnostic confidence.\\n\\n## Impact and Expansion\\nThe certification enables DeepTek to expand across Europe and CE-mark recognized regions. The solution has already demonstrated significant impact, having screened over 2 million people for TB across 325 sites. It is particularly valuable in regions with high TB burden and limited access to expert radiology.\\n\\n## Company Background\\nFounded in 2017, DeepTek is a US-incorporated radiology AI company with deployments across 1,200+ sites, processing over 3,000 studies daily. The solution has also received US FDA CADe approval, reinforcing its reliability in medical imaging applications."
}