{
  "title": "GST on UPI transactions above Rs 2,000: Government issues clarification",
  "publication_date": "2024-03-18T00:00:00Z",
  "summary": "The Times of India's Tech Desk reports on government clarification regarding GST on UPI transactions exceeding Rs 2,000. The dedicated tech journalism team covers various aspects of technology news including gadgets, trends, and digital platforms.",
  "content": "The TOI Tech Desk is a dedicated team of journalists committed to delivering the latest and most relevant news from the world of technology to readers of The Times of India. Their news coverage spans a wide spectrum across gadget launches, gadget reviews, trends, in-depth analysis, exclusive reports and breaking stories that impact technology and the digital universe. The team focuses on topics ranging from how-to guides to the latest developments in AI, cybersecurity, personal gadgets, and major platforms like WhatsApp, Instagram, and Facebook, delivering news with accuracy and authenticity.\n\nThe article discusses government clarification regarding GST implementation on UPI transactions above Rs 2,000, though specific details of the clarification are not provided in the excerpt.",
  "category": "Business",
  "tags": [
    "GST",
    "UPI",
    "digital payments",
    "financial technology",
    "government policy",
    "banking",
    "India"
  ],
  "location": "India",
  "source": {
    "title": "'Good Bad Ugly' box office collection day 8: Ajith's film surpasses 'Game Changer' collections; inches to",
    "publication_date": 1744922760,
    "content": [
      {
        "title": "GST on UPI transactions above Rs 2,000: Government issues clarification - The Times of India",
        "publication_date": "Unknown",
        "content": "The TOI Tech Desk is a dedicated team of journalists committed to delivering the latest and most relevant news from the world of technology to readers of The Times of India. TOI Tech Deskâ\u0080\u0099s news coverage spans a wide spectrum across gadget launches, gadget reviews, trends, in-depth analysis, exclusive reports and breaking stories that impact technology and the digital universe. Be it how-tos or the latest happenings in AI, cybersecurity, personal gadgets, platforms like WhatsApp, Instagram, Facebook and more; TOI Tech Desk brings the news with accuracy and authenticity.Read More\n\nLava Bold 5G\n\nâ\u0082¹11,999\n\nSamsung Galaxy M56 5G\n\nâ\u0082¹24,999\n\nRealme Narzo 80x 5G\n\nâ\u0082¹13,999\n\nRealme Narzo 80 Pro 5G\n\nâ\u0082¹19,999\n\niQOO Z10x 5G\n\nâ\u0082¹13,499\n\niQOO Z11 5G\n\nâ\u0082¹23,990\n\nXiaomi Redmi A5 4G\n\nâ\u0082¹6,499\n\niQOO Z10 5G\n\nâ\u0082¹22,999\n\nInfinix Note 50X 5G+\n\nâ\u0082¹11,499\n\nVivo Y39 5G\n\nâ\u0082¹17,499\n\nToo Cute to Handle! Janani's delightful pictures\n\nâ\u0080\u008b10 habits of parents that secretly boosts childrenâ\u0080\u0099s confidenceâ\u0080\u008b\n\nSaree Looks of Rukhsar Rehman That Radiate Grace and Glamour\n\nâ\u0080\u008bRadiant pictures of actress Priyanka Mohanâ\u0080\u008b\n\nTimes when Priya Prakash Varrier sizzled in sequined outfits\n\n10 healthy dips to make snacks more nutritious\n\nâ\u0080\u008bSigns zinc, magnesium and calcium are your body's immediate prioritiesâ\u0080\u008b\n\nLow-key suit sets to steal from Sai Pallaviâ\u0080\u0099s closet\n\nPooja Hegde Embraces Vintage Vibes with Saree Sophistication"
      },
      {
        "title": "GST on UPI transactions above Rs 2,000: Government issues clarification - The Times of India",
        "author": "Unknown Author",
        "publication_date": "Unknown"
      }
    ],
    "authors": [],
    "source": "Times of India",
    "image_url": "https://static.toiimg.com/thumb/msid-120397687,width-1280,height-720,resizemode-4/120397687.jpg",
    "url": "https://timesofindia.indiatimes.com/entertainment/tamil/movies/box-office/good-bad-ugly-box-office-collection-day-8-ajiths-film-surpasses-game-changer-collections-inches-towards-the-200-crore-mark/articleshow/120397692.cms"
  },
  "markdown_content": "## About TOI Tech Desk\\nThe TOI Tech Desk is a dedicated team of journalists committed to delivering the latest and most relevant news from the world of technology to readers of The Times of India. Their news coverage spans a wide spectrum across gadget launches, gadget reviews, trends, in-depth analysis, exclusive reports and breaking stories that impact technology and the digital universe.\\n\\nThe team focuses on topics ranging from:\\n* How-to guides\\n* Latest developments in AI\\n* Cybersecurity\\n* Personal gadgets\\n* Major platforms like WhatsApp, Instagram, and Facebook\\n\\ndelivering news with accuracy and authenticity.\\n\\n## GST Implementation Update\\nThe article discusses government clarification regarding GST implementation on UPI transactions above Rs 2,000, though specific details of the clarification are not provided in the excerpt."
}