{
  "title": "A Cross-Sectional Study on Social Phobia Among Medical Undergraduates of Ahmedabad City",
  "publication_date": "2025-04-15T12:00:07Z",
  "summary": "A medical research study examining the prevalence and patterns of social phobia among medical students in Ahmedabad, India. The study appears to be aimed at understanding anxiety disorders in the medical student population.",
  "content": "The study focuses on investigating social phobia among medical undergraduate students in Ahmedabad city. The research employs a cross-sectional methodology to examine the prevalence and impact of social anxiety disorder within this specific demographic. While the full content details are not provided in the source material, the study represents an important investigation into mental health concerns among medical students in an urban Indian setting.\n\nThe research was conducted in medical institutions within Ahmedabad, suggesting a focus on understanding and addressing mental health challenges faced by future healthcare professionals during their training period.",
  "category": "Health",
  "tags": [
    "medical education",
    "mental health",
    "social phobia",
    "anxiety disorders",
    "medical students",
    "India",
    "healthcare",
    "research"
  ],
  "location": "Ahmedabad, India",
  "source": {
    "title": "A Cross-Sectional Study on Social Phobia Among Medical Undergraduates of Ahmedabad City",
    "publication_date": 1744925607,
    "content": [
      {
        "title": "Clinical and Radiological Significance of Anatomical Variations in Paranasal Sinuses: A Retrospective CT-Based Study",
        "publication_date": "Unknown",
        "content": "Why publish in Cureus? Click below to find out.\n\nUnlock discounted publishing that highlights your organization and the peer-reviewed research and clinical experiences it produces.\n\nFind out how channels are organized and operated, including details on the roles and responsibilities of channel editors.\n\nOffering a variety of advertising and sponsorship options for reaching influential specialists from targeted demographic splits.\n\nCureus provides an equitable, efficient publishing and peer reviewing experience without sacrificing publication times.\n\nGenerate broad awareness and deliver relevant, peer-reviewed clinical experiences directly to potential customers.\n\nDedicated Cranial Radiosurgery: Clinical Experience with New & Innovative SRS Technologies\n\nSponsored by Zap Surgical Systems\n\nReal-Time Adaptive Motion Management on Helical and Robotic RT Platforms\n\nSponsored by Accuray, Inc.\n\nWhy publish in Cureus? Click below to find out.\n\nUnlock discounted publishing that highlights your organization and the peer-reviewed research and clinical experiences it produces.\n\nFind out how channels are organized and operated, including details on the roles and responsibilities of channel editors.\n\nOffering a variety of advertising and sponsorship options for reaching influential specialists from targeted demographic splits.\n\nCureus provides an equitable, efficient publishing and peer reviewing experience without sacrificing publication times.\n\nGenerate broad awareness and deliver relevant, peer-reviewed clinical experiences directly to potential customers.\n\nDedicated Cranial Radiosurgery: Clinical Experience with New & Innovative SRS Technologies\n\nSponsored by Zap Surgical Systems\n\nReal-Time Adaptive Motion Management on Helical and Robotic RT Platforms\n\nSponsored by Accuray, Inc.\n\nPlease note that by doing so you agree to be added to our monthly email newsletter distribution list.\n\nBy joining Cureus, you agree to ourPrivacy PolicyandTerms of Use."
      },
      {
        "title": "Clinical and Radiological Significance of Anatomical Variations in Paranasal Sinuses: A Retrospective CT-Based Study",
        "author": "Unknown Author",
        "publication_date": "Unknown"
      }
    ],
    "authors": [],
    "source": "Cureus",
    "image_url": "https://assets.cureus.com/uploads/figure/file/1452009/article_river_df9c7550086411f0af3cc544d289569c-Figure-1_imresizer.png",
    "url": "https://www.cureus.com/articles/355329-a-cross-sectional-study-on-social-phobia-among-medical-undergraduates-of-ahmedabad-city"
  },
  "markdown_content": "## Study Overview\\nThe study focuses on investigating social phobia among medical undergraduate students in Ahmedabad city. The research employs a cross-sectional methodology to examine the prevalence and impact of social anxiety disorder within this specific demographic.\\n\\n## Research Context\\nWhile the full content details are not provided in the source material, the study represents an important investigation into mental health concerns among medical students in an urban Indian setting.\\n\\n## Study Location\\nThe research was conducted in medical institutions within Ahmedabad, suggesting a focus on understanding and addressing mental health challenges faced by future healthcare professionals during their training period."
}