{
  "title": "Ukraine war: Amid shifting alliances, General Assembly passes resolution condemning Russia's aggression",
  "publication_date": "2024-02-24T00:00:00Z",
  "summary": "The UN General Assembly adopted two competing resolutions on the Ukraine conflict, marking three years since Russia's invasion. The US-tabled resolution passed in both the General Assembly and Security Council, though with significant amendments. The US notably abstained from its own modified resolution and voted against Ukraine's version, signaling a shift in diplomatic positions. The votes highlighted strategic differences within the transatlantic alliance regarding peace approaches.",
  "content": "Three years after Russia's full-scale invasion of Ukraine, the UN General Assembly adopted two competing resolutions on resolving the conflict, revealing strategic differences within the transatlantic alliance over peace approaches.\n\nThe US-tabled resolution, which initially omitted mention of Russian aggression, passed only after EU-led amendments were added, leading to the US abstaining on its own motion. The text later passed in the Security Council – the first such resolution since Russia's invasion in 2022.\n\nThe Ukrainian resolution, co-sponsored by European countries, called for commitment to Ukraine's sovereignty and territorial integrity within internationally recognized borders, while demanding accountability for international law violations. It passed with 93 votes to 18, with the US notably voting against it alongside Russia.\n\nThe US version, titled \"Path to Peace,\" focused on mourning casualties and calling for swift conflict resolution. After EU amendments were added, it passed with 93 in favor, though the US abstained from its own modified resolution.\n\nUkraine's Deputy Foreign Minister Mariana Betsa warned that the response to Russian aggression would define the future of Ukraine, Europe, and international relations. UN Political Affairs head Rosemary DiCarlo reported that at least 12,654 Ukrainian civilians, including 673 children, have been killed since the invasion began.\n\nThe Security Council's afternoon session saw the US resolution pass without amendments, marking a significant diplomatic development in the ongoing conflict.",
  "category": "World",
  "tags": [
    "Ukraine war",
    "Russia",
    "United Nations",
    "diplomacy",
    "international relations",
    "General Assembly",
    "Security Council",
    "foreign policy"
  ],
  "location": "United Nations, New York",
  "source": {
    "title": "Ukraine war: Amid shifting alliances, General Assembly passes resolution condemning Russia's aggression",
    "publication_date": 1740364200,
    "content": [
      {
        "title": "Ukraine war: Amid shifting alliances, General Assembly passes resolution condemning Russia’s aggression",
        "publication_date": "2025-02-25T21:29:31-05:00",
        "content": "FacebookTwitterPrintEmail\n\nThree years to the day since Russia's full-scale invasion of Ukraine, the UN General Assembly adopted two competing resolutions on resolving the conflict on Monday, one initiated by the United States and the other by Ukraine – a sign of strategic differences within the transatlantic alliance over the way forward for peace.\n\nThe resolution tabled by the United States, which omitted mention of Russian aggression, only passed after a majority of Member States voted to add EU-led amendments which led to the US abstaining on it own motion and voting against the Ukrainian text.\n\nHowever, the text in the original US resolution was passed hours later in theSecurity Council– the first to do so since the full-scale invasion of Ukraine by Russia on 24 February 2022.\n\nUntil Monday’s high stakes diplomatic debates, the Security Council – which is responsible for maintaining international peace and security – has been unable to find consensus, owing largely to Russia’s veto power as a permanent member.\n\nThe two General Assembly draft resolutions put before UN Member States during the morning session both ostensibly called for peace and an end to the conflict – but diverged fundamentally.\n\n“Advancing a comprehensive, just and lasting peace in Ukraine”, proposed by Ukraine and co-sponsored by a host of European countries, was a three-page document that included clauses noting that “the full-scale invasion of Ukraine by the Russian Federation has persisted for three years and continues to have devastating and long-lasting consequences not only for Ukraine, but also for other regions and global stability.”\n\nIt called for a commitment to “the sovereignty, independence, unity and territorial integrity of Ukraine within its internationally recognised borders” and the need to ensure accountability for crimes committed under international law, through “fair and independent investigations and prosecutions at national and international level”.\n\nThe US tabled its own version alongside, titled “Path to Peace”, a brief draft limited to mourning the loss of life throughout the Russian Federation-Ukraine conflict, reiterating that the principal purpose of the UN is to maintain international peace and security and to peacefully settle disputes and imploring a swift end to the conflict, urging a lasting peace between Ukraine and Russia.\n\nAmendments to the text were put forward by Russia and the European Union. Russia proposed adding the words “including by addressing its root causes” to the third paragraph (on a swift end to the conflict).\n\nThe EU proposed adding some of the language in the Ukrainian resolution, referring to the full-scale invasion of Ukraine by the Russian Federation (rather than the Russian Federation-Ukraine conflict), the “territorial integrity” of Ukraine and calling for a peace in line with theUN Charter.\n\nWhen it came to the vote, Ukraine’s version passed by 93 votes to 18. The US voted against, alongside Russia, marking a major shift of its position on the conflict and previous votes.\n\nThe US supported asimilar resolutionsubmitted in February 2023 which received 141 votes in favour.\n\nA total of 65 nations abstained, including South Africa, whose representative, Ambassador Mathu Joyini, said the draft “does not go far enough in terms of inclusivity and creating a positive momentum towards a peaceful negotiation”.\n\nThe US version was also adopted (93 in favour, eight against and 73 abstentions), but Member States also voted to add the European Union amendments with 60 in favour, 18 against and 81 abstentions.\n\nThe US voted against the amendments and abstained on its own resolution (the General Assembly failed to adopt the Russian amendment, with 31 in favour, 71 against and 59 abstentions).\n\nUkraine’s Deputy Foreign Minister Mariana Betsa told the Assembly that the way Russian aggression is answered “will define the future of Ukraine…Europe and our common future”.\n\nLater, flanked by co-sponsors of the country’s General Assembly resolution, shedelivered a statementat the media stakeout just outside the Security Council Chamber. She said the General Assembly had demanded “an early end to this war of aggression and a just, lasting and comprehensive peace in Ukraine, in line with the UN Charter”.\n\nThe General Assembly’s reaffirmation of support for international law and the principles of sovereignty and territorial integrity was profoundly important, she said, warning that a peace deal that “risks rewarding aggression increases the risk” and creates a dangerous precedent for the future.\n\nAttention turned to the Security Council in the afternoon, where a vote was due to be held on theUnited Statesresolution.\n\nAs before, there were attempts to add amendments supported by several western European countries, referring to a “full-scale invasion” by Russia and Ukraine’s territorial integrity, andproposalsfrom Russia to acknowledge the “deeply rooted reasons” for the conflict and lasting peace in both Ukraine and Russia.\n\nBut, the amendments were voted down and the resolution was passed without any changes by the 15-member Council (10 in favour, none against and five abstentions).\n\nSpeaking after the vote, US Ambassador Dorothy Shea said Washington sincerely appreciated Council members’ support saying that it “puts us on the path to peace”.\n\nAfter a pause in proceedings, Rosemary DiCarlo, the head of UN Political Affairs, briefed the 15 Council members on the current situation in Ukraine.\n\nShe said that the Russian invasion “undermined the very foundations of the international order” and reminded delegates that, since 24 February 2022, at least 12,654 Ukrainian civilians, including 673 children, have been killed.\n\nReferring to the Security Council resolution adopted earlier in the Council, Ms. DiCarlo insisted that peace in Ukraine must be “just, sustainable and comprehensive, in line with the Charter of the United Nations, international law and resolutions of the General Assembly”, including those adopted on Monday morning during the General Assembly emergency special session.\n\nFind out more in our comprehensivelive coverage of the day here.\n\nFacebookTwitterPrintEmail"
      },
      {
        "title": "Ukraine war: Amid shifting alliances, General Assembly passes resolution condemning Russia’s aggression",
        "author": "Unknown Author",
        "publication_date": "2025-02-25T21:29:31-05:00"
      }
    ],
    "authors": [],
    "source": "UN News",
    "image_url": "https://global.unitednations.entermediadb.net/assets/mediadb/services/module/asset/downloads/preset/Libraries/Production%20Library/24-02-2025-UN-Photo-GA-vote.jpg/image1170x530cropped.jpg",
    "url": "https://news.un.org/en/story/2025/02/1160456"
  },
  "markdown_content": "## Competing UN Resolutions\\n\\nThree years after Russia's full-scale invasion of Ukraine, the UN General Assembly adopted two competing resolutions on resolving the conflict, revealing strategic differences within the transatlantic alliance over peace approaches.\\n\\nThe US-tabled resolution, which initially omitted mention of Russian aggression, passed only after EU-led amendments were added, leading to the US abstaining on its own motion. The text later passed in the Security Council – the first such resolution since Russia's invasion in 2022.\\n\\n## Resolution Details\\n\\n* The Ukrainian resolution, co-sponsored by European countries:\\n  - Called for commitment to Ukraine's sovereignty\\n  - Demanded territorial integrity within internationally recognized borders\\n  - Required accountability for international law violations\\n  - Passed with 93 votes to 18, with the US voting against alongside Russia\\n\\n* The US version \"Path to Peace\":\\n  - Focused on mourning casualties\\n  - Called for swift conflict resolution\\n  - Passed with 93 votes in favor after EU amendments\\n  - US abstained from its own modified resolution\\n\\n## Official Statements\\n\\n> The response to Russian aggression would define the future of Ukraine, Europe, and international relations.\\n– Mariana Betsa, Ukraine's Deputy Foreign Minister\\n\\nAccording to UN Political Affairs head Rosemary DiCarlo, at least 12,654 Ukrainian civilians, including 673 children, have been killed since the invasion began.\\n\\nThe Security Council's afternoon session saw the US resolution pass without amendments, marking a significant diplomatic development in the ongoing conflict."
}