{
  "title": "James Webb Telescope Finds Possible Life on Exoplanet K2-18b",
  "publication_date": "2025-04-18T17:16:46+05:30",
  "summary": "Cambridge University researchers have discovered compelling evidence suggesting possible life on exoplanet K2-18b using NASA's James Webb Space Telescope. The team detected life-associated molecules like dimethyl sulphide and dimethyl disulphide in the planet's atmosphere, marking a significant breakthrough in the search for extraterrestrial life.",
  "content": "In a major scientific development, researchers at Cambridge University have found compelling, though not yet confirmed, evidence pointing to the possible presence of life on a distant exoplanet named K2-18b. Utilizing NASA's James Webb Space Telescope, the team detected atmospheric molecules.\n\nIn a groundbreaking development, scientists from Cambridge University have found the most promising evidence yet that life may exist beyond Earth. Their research, using NASA's James Webb Space Telescope (JWST), identified life-associated molecules like dimethyl sulphide (DMS) and dimethyl disulphide (DMDS) in the atmosphere of a distant exoplanet named K2-18b. Although these findings are not yet confirmed at the highest scientific certainty, they represent a crucial step in the search for extraterrestrial life and open new frontiers in astrobiology.",
  "category": "Science",
  "tags": [
    "astronomy",
    "space exploration",
    "exoplanets",
    "James Webb Space Telescope",
    "astrobiology",
    "scientific discovery",
    "extraterrestrial life"
  ],
  "location": "Cambridge, UK",
  "source": {
    "title": "James Webb Telescope Founds Possible Life on Exoplanet K2-18b",
    "publication_date": 1744957006,
    "content": [
      {
        "title": "James Webb Telescope Founds Possible Life on Exoplanet K2-18b",
        "publication_date": "2025-04-18T17:16:46+05:30",
        "content": "In a major scientific development, researchers at Cambridge University have found compelling, though not yet confirmed, evidence pointing to the possible presence of life on a distant exoplanet named K2-18b. Utilizing NASA’s James Webb Space Telescope, the team detected atmospheric molecules.\n\nIn a groundbreaking development, scientists from Cambridge University have found the most promising evidence yet that life may exist beyond Earth. Their research, usingNASA’s James Webb Space Telescope (JWST), identified life-associated molecules like dimethyl sulphide(DMS)and dimethyl disulphide(DMDS)in the atmosphere of adistant exoplanet named K2-18b. Although these findings are not yet confirmed at the highest scientific certainty, they represent a crucial step in the search for extraterrestrial life and open new frontiers in astrobiology.\n\nLatest Current Affairs 2025\n\nWelcome to the Current Affairs Section of Adda247. If you are preparing for Government Job Exams, then it is very important for you to read the Daily Current Affairs. All the important updates based on current affairs are included in this Daily Current Affairs 2024 article."
      },
      {
        "title": "James Webb Telescope Founds Possible Life on Exoplanet K2-18b",
        "author": "Unknown Author",
        "publication_date": "2025-04-18T17:16:46+05:30"
      }
    ],
    "authors": [],
    "source": "Adda247",
    "image_url": "https://currentaffairs.adda247.com/wp-content/uploads/multisite/sites/5/2025/04/18171640/James-Webb-Telescope-Founds-Possible-Life-on-Exoplanet-K2-18b.jpg",
    "url": "https://currentaffairs.adda247.com/james-webb-telescope-founds-possible-life-on-exoplanet-k2-18b/"
  },
  "markdown_content": "## Key Discovery\\nIn a major scientific development, researchers at Cambridge University have found compelling, though not yet confirmed, evidence pointing to the possible presence of life on a distant exoplanet named K2-18b. Utilizing NASA's James Webb Space Telescope, the team detected atmospheric molecules.\\n\\n## Research Details\\nIn a groundbreaking development, scientists from Cambridge University have found the most promising evidence yet that life may exist beyond Earth. Their research, using NASA's James Webb Space Telescope (JWST), identified life-associated molecules like dimethyl sulphide (DMS) and dimethyl disulphide (DMDS) in the atmosphere of a distant exoplanet named K2-18b. Although these findings are not yet confirmed at the highest scientific certainty, they represent a crucial step in the search for extraterrestrial life and open new frontiers in astrobiology."
}