{
  "title": "New Skoda Kodiaq Launch Price Rs 46.89 L - Sportline and L&K Trims",
  "publication_date": "2024-03-17T06:47:06+00:00",
  "summary": "Skoda Auto Volkswagen India has launched the 2nd Generation Kodiaq SUV in India, starting at Rs 46.89 lakh for Sportline trim and Rs 48.69 lakh for L&K trim. The premium 7-seater SUV features a 2.0L TSI engine, sophisticated design updates, and comes loaded with luxury features including a 12.9-inch infotainment screen and 9 airbags.",
  "content": "Skoda Auto Volkswagen India (SAVWIPL) has just launched the 2nd Generation Skoda Kodiaq in India. This premium 4X4 SUV is Skoda's flagship offering in India and aims to offer a blend of 7-seat versatility, robust dynamics, off-road ability, refinement and luxury.\n\nStepping into its 2nd Generation avatar, Skoda Kodiaq has adopted a more mature design language. It is offered in both Sportline and L&K trims, with prices starting from Rs 46.89 lakh, while the top-spec L&K trim costs Rs 48.69 lakh (Ex-sh).\n\nThe SUV is available in six colour options including Moon White, Magic Black, Graphite Grey, Velvet Red, and Race Blue, with exclusive Bronx Gold for L&K trim and Steel Grey for Sportline.\n\nThe exterior features a large butterfly grill with integrated light strip, Crystallinium LED headlights, and chiselled lines. Inside, it boasts a 12.9-inch infotainment screen, digital cockpit, smart climate control dials, and trim-specific upholstery.\n\nThe new Kodiaq measures 4,758 mm in length, offers up to 1,976L cargo capacity, and is powered by a 2.0L 4-cylinder TSI Turbo Petrol engine producing 201 bhp and 320 Nm torque. It comes with a 7-speed DSG automatic transmission and AWD system, claiming a fuel efficiency of 14.86 km/l.",
  "category": "Business",
  "tags": [
    "automotive",
    "Skoda",
    "SUV",
    "new launch",
    "luxury vehicles",
    "India market"
  ],
  "location": "India",
  "source": {
    "title": "New Skoda Kodiaq Launch Price Rs 46.89 L - Sportline and L&K Trims",
    "publication_date": 1744852626,
    "content": [
      {
        "title": "New Skoda Kodiaq Launch Price Rs 46.89 L - Sportline and L&K Trims",
        "publication_date": "2025-04-17T06:47:06+00:00",
        "content": "Skoda Auto Volkswagen India (SAVWIPL) has just launched the 2nd Generation Skoda Kodiaq in India. This was a long time due and it replaced the 1st Gen model sold in India. This premium 4X4 SUV is Skoda’s flagship offering in India and aims to offer a blend of 7-seat versatility, robust dynamics, off-road ability, refinement and luxury.\n\nStepping into its2nd Generation avatar, Skoda Kodiaq has adopted a more mature design language. It still looks unmistakably a Kodiaq, but with a new flair that enhances sophistication and premium quotient. Prices for new Skoda Kodiaq start from Rs 46.89 lakh (Ex-sh) and it is offered in both Sportline and L&K trims.\n\nTop-spec L&K trim commands a price tag of Rs 48.69 lakh (Ex-sh), which is Rs 1.8 lakh more than Sportline. All-new Kodiaq is offered in six colour options. These include Moon White, Magic Black, Graphite Grey, Velvet Red, Race Blue. L&K trim gets an exclusive Bronx Gold colour and Sportline gets an exclusive Steel Grey colour.\n\nIt has to be noted that VW Tiguan is only launched in the sporty R Line configuration that commands Rs 49 lakh (Ex-sh). In comparison, Skoda Kodiaq Sportline starting at Rs 46.89 lakh emerges as an attractive proposition. This vehicle has been launched in India via the CKD route and assembled at their facility in Chatrapati Sambhaji Nagar, Maharashtra.\n\nNew Skoda Kodiaq’s exterior design stands out with its large butterfly grill with integrated light strip, Crystallinium LED headlights with a welcome function, large alloy wheels, chiselled lines and more. Sportline trim gets sporty gloss black elements while L&K gets sophisticated dark chrome highlights.\n\nOn the inside, Sportline gets an all-black sporty theme, while L&K trim gets Cognac leather upholstery. There’s a 12.9-inch infotainment screen, a digital cockpit, smart dials for climate control with integrated displays, ventilated seats, a redesigned centre console with a gear selector on steering column and more.\n\nIt is loaded with features and creature comforts. Notable features include Ergo seats, pneumatic massage function, acoustic front windshield and side windows for noise insulation, 9 airbags, panoramic sunroof, 13 speaker 725W music system from Canton, rolling rear sunblinds, multi-zone climate control and more.\n\nNew Skoda Kodiaqmeasures 4,758 mm in length, 1,864 mm in width, and 1,679 mm in height and has a wheelbase of 2,791 mm. Even with 3rd-row seats up, 2nd Gen Kodiaq offers 281L boot space, which can be increased to 786L with 3rd row folded and a cavernous 1,976L capacity when 2nd-row seats are folded.\n\n2nd Gen Skoda Kodiaq is positioned on MQB37 platform and is powered by a 2.0L 4-cylinder TSI Turbo Petrol engine that is capable of generating 201 bhp of peak power and 320 Nm of peak torque. This engine is mated to a 7-speed DSG automatic transmission and an AWD system. Mileage figures (fuel efficiency) revealed by Skoda is 14.86 km/l.\n\nStarted in 2008, RushLane is India's leading auto news website. Updated daily with news on cars, bikes, motorcycles, scooters, electric vehicles, commercial vehicles, domestic sales and exports report, scoops, exclusive spy shots, as well as detailed reviews by experts.RushLane Facebook Groups -CrashLane,SpyLane,InfoLane,MemeLane,SnagLane. JoinWhatsapp Group,Telegram Channelto get news / updates in your phone."
      },
      {
        "title": "New Skoda Kodiaq Launch Price Rs 46.89 L - Sportline and L&K Trims",
        "author": "Akshay Kulkarni",
        "publication_date": "2025-04-17T06:47:06+00:00"
      }
    ],
    "authors": [],
    "source": "RushLane",
    "image_url": "https://www.rushlane.com/wp-content/uploads/2025/04/new-skoda-kodiaq-launch-price-specs-features-cover.jpg",
    "url": "https://www.rushlane.com/new-skoda-kodiaq-launch-price-rs-46-89-l-sportline-and-lk-trims-12521657.html"
  },
  "markdown_content": "## Design and Exterior\\nThe 2nd Generation Skoda Kodiaq has arrived in India, representing SAVWIPL's flagship SUV offering. This premium 4X4 vehicle combines 7-seat versatility with robust dynamics, off-road capability, refinement, and luxury.\\n\\nAdopting a more mature design language, the new Kodiaq features a large butterfly grill with integrated light strip, Crystallinium LED headlights, and chiselled lines.\\n\\n## Pricing and Variants\\n* Sportline trim starts at Rs 46.89 lakh\\n* L&K trim priced at Rs 48.69 lakh (Ex-sh)\\n\\n## Color Options\\n* Moon White\\n* Magic Black\\n* Graphite Grey\\n* Velvet Red\\n* Race Blue\\n* Bronx Gold (exclusive to L&K trim)\\n* Steel Grey (exclusive to Sportline)\\n\\n## Interior Features\\n* 12.9-inch infotainment screen\\n* Digital cockpit\\n* Smart climate control dials\\n* Trim-specific upholstery\\n\\n## Technical Specifications\\n* Length: 4,758 mm\\n* Cargo capacity: up to 1,976L\\n* Engine: 2.0L 4-cylinder TSI Turbo Petrol\\n* Power output: 201 bhp\\n* Torque: 320 Nm\\n* Transmission: 7-speed DSG automatic\\n* Drive system: AWD\\n* Fuel efficiency: 14.86 km/l"
}