{
  "title": "U.S. bests Germany, into hockey worlds semis",
  "publication_date": "2024-01-18T00:00:00Z",
  "summary": "The United States advanced to the women's ice hockey world championship semifinals with a 3-0 victory over Germany. Goals from Kelly Pannek, Lacey Eden, and Alex Carpenter secured the win. The U.S. will face host Czech Republic in the semifinals, while Canada will play Finland for the other final spot.",
  "content": "CESKE BUDEJOVICE, Czech Republic -- Jennifer Gardiner and Sarah Fillier both struck twice and Canada grabbed a spot in the semifinals at the women's ice hockey world championship by routing Japan 9-1 on Thursday.\n\nCanada will play Finland for a spot in the final, and the United States will meet host Czech Republic in Saturday's other last-four matchup.\n\nEarlier, the United States blanked Germany 3-0 to reach the semifinals. Kelly Pannek, Lacey Eden and Alex Carpenter each scored and captain Hilary Knight registered an assist to extend her record at the worlds to 51. Aerin Frankel made 12 saves in the shutout.\n\n\"Today was an important game, we battled and continued to fight,\" U.S. coach John Wroblewski said. \"Germany is a tough, physical team and we stuck to our game and got the win.\"\n\nThe U.S. has reached the final in all 23 previous worlds and won 10 titles.\n\nIn other matches, Natálie Mlýnková scored a hat trick as the Czech Republic defeated Switzerland 7-0, while Finland beat Sweden 3-2.",
  "category": "Sports",
  "tags": [
    "ice hockey",
    "women's sports",
    "world championship",
    "Team USA",
    "Team Canada",
    "international sports"
  ],
  "location": "Ceske Budejovice, Czech Republic",
  "source": {
    "title": "U.S. bests Germany, into hockey worlds semis",
    "publication_date": 1744888800,
    "content": [
      {
        "title": "U.S. bests Germany, into hockey worlds semis",
        "publication_date": "Unknown",
        "content": "CESKE BUDEJOVICE, Czech Republic -- Jennifer Gardiner and Sarah Fillier both struck twice and Canada grabbed a spot in the semifinals at the women's ice hockey world championship by routing Japan 9-1 on Thursday.\n\nCanada will play Finland for a spot in the final, and the United States will meet host Czech Republic in Saturday's other last-four matchup.\n\nCaptain Marie-Philip Poulin assisted on Julia Gosling's power-play goal as she became the fourth player to reach 200 appearances for Canada.\n\nClaire Thompson had a goal and two assists, and Ella Shelton, Emily Clark and Sophie Jaques also scored for Canada. Renata Fast had three assists.\n\nThompson opened the scoring and Gardiner doubled the lead late in the first period before Mei Miura scored for Japan to make it 2-1 in the second on a breakaway.\n\nCanada, the defending champion, answered with goals from Shelton, Fillier and Gosling in a span of 3:14 later in the period to jump to a 5-1 lead.\n\nGardiner added her second early in the final period for her fifth overall at the tournament and a lead of the goal scoring table.\n\nFillier and Clark made it 8-1 with goals scored 48 seconds apart before Jaques finished the demolition with 59 seconds to go.\n\nEarlier, the United States blanked Germany 3-0 to reach the semifinals.\n\nKelly Pannek, Lacey Eden and Alex Carpenter each scored and captain Hilary Knight registered an assist to extend her record at the worlds to 51.\n\nAerin Frankel made 12 saves in the shutout. Germany last scored against the U.S. at the worlds in 2008.\n\n\"Today was an important game, we battled and continued to fight,\" U.S. coach John Wroblewski said. \"Germany is a tough, physical team and we stuck to our game and got the win.\"\n\nPannek one-timed a shot from the left circle for her third goal at the tournament 5:36 into the quarterfinal. Eden added the second midway through the opening period from the slot.\n\nCarpenter scored from close range with 1:07 remaining in the second period.\n\nThe U.S. has reached the final in all 23 previous worlds and won 10 titles.\n\nIn the following game, Natálie Mlýnková scored a hat trick as the Czech Republic produced a five-goal opening period en route to a 7-0 rout of Switzerland and a fourth straight semifinal appearance.\n\nMlýnková scored two power-play goals and added another short-handed. Tereza Vanišová and Kristýna Kaltounková each had a goal and two assists, and Daniela Pejšov, and Denisa Křížová also scored for the Czechs, who claimed bronze in two of the previous three years of the championship.\n\nKlára Peslarová stopped 14 shots for her shutout.\n\nEarlier, Finland beat Sweden 3-2.\n\nJenniina Nylund and Ronja Savolainen put Finland, last year's bronze medalist, 2-0 ahead in the opening period.\n\nSweden answered through goals from Ebba Hedqvist and Josefin Bouveng in the second.\n\nSusanna Tapani gave the Finns the lead for good with 8:14 remaining in the frame."
      },
      {
        "title": "U.S. bests Germany, into hockey worlds semis",
        "author": "Unknown Author",
        "publication_date": "Unknown"
      }
    ],
    "authors": [],
    "source": "ESPN",
    "image_url": "https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2025%2F0415%2Fr1479211_1296x729_16%2D9.jpg",
    "url": "https://www.espn.com/olympics/story/_/id/44717547/us-wins-fifth-straight-women-hockey-worlds-semis"
  },
  "markdown_content": "## Tournament Results\\n\\nCanada secured a semifinal spot with a commanding 9-1 victory over Japan, led by Jennifer Gardiner and Sarah Fillier's double strikes.\\n\\n## Semifinal Matchups\\n* Canada vs Finland\\n* United States vs Czech Republic (host)\\n\\n## USA's Victory\\nThe United States advanced with a 3-0 win against Germany:\\n* Kelly Pannek, Lacey Eden and Alex Carpenter scored\\n* Captain Hilary Knight extended her world championship record to 51 assists\\n* Aerin Frankel secured the shutout with 12 saves\\n\\n> \"Today was an important game, we battled and continued to fight,\" U.S. coach John Wroblewski said. \"Germany is a tough, physical team and we stuck to our game and got the win.\"\\n\\nThe U.S. team maintains their impressive record of reaching the final in all 23 previous world championships, claiming 10 titles.\\n\\n## Other Matches\\n* Czech Republic defeated Switzerland 7-0, featuring Natálie Mlýnková's hat trick\\n* Finland edged Sweden 3-2"
}