{
  "title": "Premalu Star Naslen's sports drama Alappuzha Gymkhana set for Telugu release",
  "publication_date": "2025-04-18T03:32:05+00:00",
  "summary": "Malayalam actor Naslen's sports drama Alappuzha Gymkhana, directed by Khalid Rahman, is scheduled for Telugu release on April 25, 2025. The film, which was released in Malayalam on April 10, received positive reviews for its storytelling and fresh approach to sports genre.",
  "content": "After gaining popularity among Telugu audiences with Premalu, actor Naslen is all set to return with another film – this time in a sports drama titled Alappuzha Gymkhana. Directed by Khalid Rahman, the Malayalam film is now gearing up for its Telugu release on April 25, 2025.\n\nAlappuzha Gymkhana was originally released in Malayalam on April 10, 2025, and received a positive response for its content-driven storytelling and refreshing take on the sports genre. The film has been holding steady at the box office and is now aiming to make a mark with Telugu audiences.\n\nAlongside Naslen, the film features a talented ensemble cast including Lukman Avaran, Ganapathi S. Poduval, Sandeep Pradeep, Anagha Ravi, Franco Francis, Baby Jean, and Shiva Hariharan. Produced by Plan B Motion Pictures and Reelistic Studios, the film's music is composed by Vishnu Vijay.",
  "category": "Entertainment",
  "tags": [
    "movies",
    "sports drama",
    "Malayalam cinema",
    "Telugu cinema",
    "regional films",
    "Naslen",
    "Alappuzha Gymkhana"
  ],
  "location": "Alappuzha, India",
  "source": {
    "title": "Suriya & Vetrimaaran’s film aiming for release during this time",
    "publication_date": 1744848000,
    "content": [
      {
        "title": "Premalu Star Naslen’s sports drama Alappuzha Gymkhana set for Telugu release",
        "publication_date": "2025-04-18T03:32:05+00:00",
        "content": "After gaining popularity among Telugu audiences with Premalu, actor Naslen is all set to return with another film – this time in a sports drama titled Alappuzha Gymkhana. Directed by Khalid Rahman, the Malayalam film is now gearing up for its Telugu release on April 25, 2025.\n\nAlappuzha Gymkhana was originally released in Malayalam on April 10, 2025, and received a positive response for its content-driven storytelling and refreshing take on the sports genre. The film has been holding steady at the box office and is now aiming to make a mark with Telugu audiences.\n\nAlongside Naslen, the film features a talented ensemble cast including Lukman Avaran, Ganapathi S. Poduval, Sandeep Pradeep, Anagha Ravi, Franco Francis, Baby Jean, and Shiva Hariharan. Produced by Plan B Motion Pictures and Reelistic Studios, the film’s music is composed by Vishnu Vijay."
      },
      {
        "title": "Premalu Star Naslen’s sports drama Alappuzha Gymkhana set for Telugu release",
        "author": "123telugu",
        "publication_date": "2025-04-18T03:32:05+00:00"
      }
    ],
    "authors": [],
    "source": "123Telugu.com",
    "image_url": "https://cdn.123telugu.com/content/wp-content/uploads/2025/04/Suriya-Vetrimaaran.jpg",
    "url": "https://www.123telugu.com/mnews/suriya-vetrimaarans-film-aiming-for-release-during-this-time.html"
  },
  "markdown_content": "## Release Details\\nNaslen, known for his role in *Premalu*, is set to appear in the sports drama \"Alappuzha Gymkhana.\" The Telugu version is scheduled for release on April 25, 2025, following its successful Malayalam release on April 10, 2025.\\n\\n## Reception and Performance\\nThe Malayalam release has garnered positive responses for:\\n* Content-driven storytelling\\n* Fresh perspective on the sports genre\\n\\nThe film continues to perform well at the box office and is now poised to expand its reach to Telugu audiences.\\n\\n## Cast and Credits\\n* Lead actor: Naslen\\n* Supporting cast:\\n  - Lukman Avaran\\n  - Ganapathi S. Poduval\\n  - Sandeep Pradeep\\n  - Anagha Ravi\\n  - Franco Francis\\n  - Baby Jean\\n  - Shiva Hariharan\\n\\nThe film is directed by Khalid Rahman, with music by Vishnu Vijay. Production is jointly handled by Plan B Motion Pictures and Reelistic Studios."
}