{
  "title": "Public ignorance and apathy towards bird flu could hinder preventive efforts",
  "publication_date": "2025-04-17T22:47:00-04:00",
  "summary": "A study by CUNY researchers reveals concerning public attitudes toward bird flu prevention. Many Americans lack knowledge about food safety practices and show reluctance to take preventive measures. The survey found that over half didn't understand milk safety, 27% wouldn't modify their diet, and 28.7% were hesitant about potential vaccines. Political affiliation and geographic location significantly influenced attitudes toward preventive measures.",
  "content": "In an editorial in the American Journal of Public Health, a team led by researchers from the CUNY Graduate School of Public Health and Health Policy (CUNY SPH) say public ignorance and apathy towards bird flu (highly pathogenic avian influenza, or HPAI) could pose a serious obstacle to containing the virus and preventing a larger-scale public health crisis.\n\nThe authors conducted a population representative survey of U.S. residents from August 5 to 15, 2024, which used an in-depth sampling framework and intentional oversampling of rural populations.\n\nThe results suggest many respondents were unaware of simple food safety practices that could reduce the risk of HPAI infection. Over half (53.7%) did not know that pasteurized milk is safer than raw milk, although almost three of four respondents (71.3%) did understand that cooking meat at high temperatures could eliminate harmful bacteria and viruses like H5N1.\n\nOver a quarter (27%) of respondents said they were unwilling to modify their diet to reduce the risk of exposure to the virus, and more than one in four respondents (28.7%) expressed reluctance to take a potential vaccine for H5N1, even if advised by the CDC to do so.\n\nParticipants who described themselves as Republicans or Independents were significantly less likely than Democrats to support either vaccination or dietary modifications. Rural Americans, many of whom are more likely to work or live in or near livestock industries, were less likely to accept public health measures, including vaccination and dietary changes, compared to their urban counterparts.\n\n\"These attitudes could pose a serious obstacle to containing the virus and preventing a major public health crisis,\" says Piltch-Loeb, the study's lead author. \"The fact that responses vary significantly by political party and geography emphasizes the need for a carefully segmented health communications strategy to address the issue.\"",
  "category": "Health",
  "tags": [
    "bird flu",
    "public health",
    "vaccination",
    "food safety",
    "rural health",
    "HPAI",
    "infectious disease",
    "health communication"
  ],
  "location": "United States",
  "source": {
    "title": "Public ignorance and apathy towards bird flu could hinder preventive efforts",
    "publication_date": 1744924620,
    "content": [
      {
        "title": "Public ignorance and apathy towards bird flu could hinder preventive efforts",
        "publication_date": "2025-04-17T22:47:00-04:00",
        "content": "In an editorial in theAmerican Journal of Public Health, a team led by researchers from the CUNY Graduate School of Public Health and Health Policy (CUNY SPH) say public ignorance and apathy towards bird flu (highly pathogenic avian influenza, or HPAI) could pose a serious obstacle to containing the virus and preventing a larger-scale public health crisis.\n\nThe authors, including CUNY SPH Assistant Professor Rachael Piltch-Loeb, Associate Professor Katarzyna Wyka, Professor Jeffrey V. Lazarus, Senior Scholar Kenneth Rabin, Distinguished Lecturer Scott C. Ratzan, and Dean Ayman El-Mohandes, conducted a population representative survey of U.S. residents from August 5 to 15, 2024, which used an in-depth sampling framework and intentional oversampling of rural populations.\n\nThe results suggest many respondents were unaware of simple food safety practices that could reduce the risk of HPAI infection. Over half (53.7%) did not know that pasteurized milk is safer than raw milk, although almost three of four respondents (71.3%) did understand that cooking meat at high temperatures could eliminate harmful bacteria and viruses like H5N1.\n\nOver a quarter (27%) of respondents said they were unwilling to modify their diet to reduce the risk of exposure to the virus, and more than one in four respondents (28.7%) expressed reluctance to take a potential vaccine for H5N1, even if advised by the CDC to do so.\n\nParticipants who described themselves as Republicans or Independents were significantly less likely than Democrats to support either vaccination or dietary modifications.\n\nRural Americans, many of whom are more likely to work or live in or near livestock industries, were less likely to accept public health measures, including vaccination and dietary changes, compared to their urban counterparts.\n\n\"These attitudes could pose a serious obstacle to containing the virus and preventing a major public health crisis,\" says Piltch-Loeb, the study's lead author. \"The fact that responses vary significantly by political party and geography emphasizes the need for a carefully segmented health communications strategy to address the issue.\"\n\nRabin, who has been engaged in health communications campaigns for more than four decades, adds that, \"Working closely with agricultural leaders, farm communities and food processing companies will be critical, and the fact that most of the agricultural workers who are at direct risk of exposure to the bird flu virus may be undocumented could seriously jeopardize efforts to track and control the spread of infections.\"\n\nCUNY Graduate School of Public Health and Health Policy\n\nhttps://doi.org/10.2105/AJPH.2025.308080\n\nPosted in:Disease/Infection News|Healthcare News\n\nCancel reply to comment\n\nRafael E. Carazo Salas\n\nCellVoyant leverages AI and live-cell imaging to predict cellular behavior, transforming cell therapy development and making it more accessible and efficient.\n\nRoya Amini-Naieni\n\nDr. Allotey\n\nDr. Pascale Allotey advocates for comprehensive maternal health policies, stressing the importance of women's voices in shaping effective healthcare solutions.\n\nNews-Medical.Net provides this medical information service in accordance\n\n                                                        with theseterms and conditions.\n\n                                                        Please note that medical information found\n\n                                                        on this website is designed to support, not to replace the relationship\n\n                                                        between patient and physician/doctor and the medical advice they may provide.\n\nLast Updated: Saturday 19 Apr 2025\n\nNews-Medical.net - An AZoNetwork Site\n\nOwned and operated by AZoNetwork, © 2000-2025\n\nYour AI Powered Scientific Assistant\n\nHi, I'm Azthena, you can trust me to find commercial scientific answers from News-Medical.net.\n\nTo start a conversation, please log into your AZoProfile account first, or create a new account.\n\nRegistered members can chat with Azthena, request quotations, download pdf's, brochures and subscribe to our relatednewsletter content.\n\nA few things you need to know before we start.Please read andacceptto continue.\n\nPlease check the box above to proceed.\n\nGreat. Ask your question.\n\nAzthena may occasionally provide inaccurate responses.Read the full terms.\n\nTerms\n\nWhile we only use edited and approved content for Azthena\n            answers, it may on occasions provide incorrect responses.\n            Please confirm any data provided with the related suppliers or\n            authors. We do not provide medical advice, if you search for\n            medical information you must always consult a medical\n            professional before acting on any information provided.\n\nYour questions, but not your email details will be shared with\n            OpenAI and retained for 30 days in accordance with their\n            privacy principles.\n\nPlease do not ask questions that use sensitive or confidential\n            information.\n\nRead the fullTerms & Conditions.\n\nProvide Feedback"
      },
      {
        "title": "Public ignorance and apathy towards bird flu could hinder preventive efforts",
        "author": "Unknown Author",
        "publication_date": "2025-04-17T22:47:00-04:00"
      }
    ],
    "authors": [],
    "source": "News-Medical",
    "image_url": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/pigeons-620x480.jpg",
    "url": "https://www.news-medical.net/news/20250417/Public-ignorance-and-apathy-towards-bird-flu-could-hinder-preventive-efforts.aspx"
  },
  "markdown_content": "## Key Findings\\n\\nIn an editorial in the American Journal of Public Health, a team led by researchers from the CUNY Graduate School of Public Health and Health Policy (CUNY SPH) say public ignorance and apathy towards bird flu (highly pathogenic avian influenza, or HPAI) could pose a serious obstacle to containing the virus and preventing a larger-scale public health crisis.\\n\\n## Study Methodology\\n\\nThe authors conducted a population representative survey of U.S. residents from August 5 to 15, 2024, which used an in-depth sampling framework and intentional oversampling of rural populations.\\n\\n## Survey Results\\n\\n* Over half (53.7%) did not know that pasteurized milk is safer than raw milk\\n* Almost three of four respondents (71.3%) understood that cooking meat at high temperatures could eliminate harmful bacteria and viruses like H5N1\\n* 27% of respondents said they were unwilling to modify their diet to reduce risk of exposure\\n* More than one in four respondents (28.7%) expressed reluctance to take a potential H5N1 vaccine\\n\\n## Demographic Trends\\n\\n* Participants who described themselves as Republicans or Independents were significantly less likely than Democrats to support either vaccination or dietary modifications\\n* Rural Americans, many of whom are more likely to work or live in or near livestock industries, were less likely to accept public health measures compared to their urban counterparts\\n\\n## Expert Commentary\\n\\n> These attitudes could pose a serious obstacle to containing the virus and preventing a major public health crisis,\" says Piltch-Loeb, the study's lead author. \"The fact that responses vary significantly by political party and geography emphasizes the need for a carefully segmented health communications strategy to address the issue."
}