{
  "title": "Shah Rukh Khan's 'King' Adds Arshad Warsi to Star-Studded Cast",
  "publication_date": "2025-04-18T16:36:42+05:30",
  "summary": "Arshad Warsi has joined the cast of Shah Rukh Khan's upcoming film 'King', directed by Siddharth Anand. The movie marks the big screen debut of SRK's daughter Suhana Khan following her OTT debut in 'The Archies'. While Warsi's role details remain under wraps, this marks his first major collaboration with SRK.",
  "content": "Shah Rukh Khan's upcoming film 'King' has been generating significant buzz since its announcement last year. The project gains additional attention not only for featuring one of India's biggest global stars but also for being directed by Siddharth Anand, who helmed Khan's comeback film 'Pathaan'.\n\nAccording to a report by Peeping Moon, Arshad Warsi has now joined the cast in a pivotal role, though specific details about his character remain confidential. While Shah Rukh Khan and Warsi have maintained a long-standing friendship, this marks their first substantial on-screen collaboration, aside from Khan's previous cameo in Warsi's 2005 film 'Kuchh Meetha Ho Jayein'.\n\nThe film is particularly noteworthy as it marks the theatrical debut of Shah Rukh Khan's daughter Suhana Khan, who recently made her acting debut on OTT with 'The Archies'. 'King' is being produced under Khan's Red Chillies Entertainment and Siddharth Anand's Marflix Pictures, with additional cast members including Abhishek Bachchan and Abhay Verma of 'Munjya' fame.",
  "category": "Entertainment",
  "tags": [
    "bollywood",
    "shah rukh khan",
    "arshad warsi",
    "suhana khan",
    "casting news",
    "indian cinema",
    "king movie"
  ],
  "location": "Mumbai, India",
  "source": {
    "title": "Tamannaah Bhatia joins cast of No Entry 2 featuring Varun Dhawan, Arjun Kapoor, and Diljit Dosanjh",
    "publication_date": 1744867564,
    "content": [
      {
        "title": "BREAKING! Arshad Warsi joins the cast of Shah Rukh Khan’s King: Report : Bollywood News - Bollywood Hungama",
        "publication_date": "2025-04-18T16:36:42+05:30",
        "content": "SEARCH\n\nLANGUAGE\n\nFOLLOW US ON\n\nFEEDBACK\n\nKing marks the big screen debut of Shah Rukh Khan's daughter Suhana Khan.\n\nShah Rukh Khan’s upcoming filmKinghas been creating waves ever since news about the same came out for the first time last year. This is purely because it is a film starring SRK, one of the biggest stars not just in India but world over. Plus, it’s helmed by Siddharth Anand, the director of the actor’s comeback filmPathaan. But the reason whyKingis anticipated even more is because it marks the big screen debut of the superstar’s daughter Suhana Khan. The film follows her OTT debut withThe Archies.\n\nNow, a latest report has sparked more excitement forKing. As per a report by Peeping Moon, Arshad Warsi has joined the cast of the film. The report states that he will be playing a pivotal role in the film but details about his character are currently kept under wraps.\n\nShah Rukh and Arshad have been friends since long. But this is the first time that the two will be seen in a movie together where both are playing prominent roles. Interestingly, SRK had done a guest appearance in Arshad starrerKuchh Meetha Ho Jayein 2005. The Samar Khan directorial also starred SRK’sPardesco-star Mahima Chaudhry along with Rohit Roy, Sandhya Mridul and Jaspal Bhatti.\n\nComing back toKing, the film is produced under Khan’s Red Chillies Entertainment and Siddharth Anand’s Marflix Pictures and it also stars Abhishek Bachchan and Abhay Verma ofMunjyafame.\n\nAlso Read:When Shah Rukh Khan went off script while filming Don: Alyy Khan recalls candid on-set moment\n\nCatch us for latestBollywood News,New Bollywood Moviesupdate,Box office collection,New Movies Release,Bollywood News Hindi,Entertainment News,Bollywood Live News Today&Upcoming Movies 2025and stay updated with latest hindi movies only on Bollywood Hungama.\n\nNo Releated Data\n\nSkip this step for now\n\n5000characters remaining"
      },
      {
        "title": "BREAKING! Arshad Warsi joins the cast of Shah Rukh Khan’s King: Report : Bollywood News - Bollywood Hungama",
        "author": "Bollywood Hungama",
        "publication_date": "2025-04-18T16:36:42+05:30"
      }
    ],
    "authors": [],
    "source": "Bollywood Hungama",
    "image_url": "https://stat4.bollywoodhungama.in/wp-content/uploads/2025/04/WhatsApp-Image-2025-04-17-at-4.18.16-PM.jpeg",
    "url": "https://www.bollywoodhungama.com/news/bollywood/tamannaah-bhatia-joins-cast-no-entry-2-featuring-varun-dhawan-arjun-kapoor-diljit-dosanjh/"
  },
  "markdown_content": "## Cast Updates\\nShah Rukh Khan's upcoming film \"King\" has been generating significant buzz since its announcement last year. The project gains additional attention not only for featuring one of India's biggest global stars but also for being directed by Siddharth Anand, who helmed Khan's comeback film \"Pathaan\".\\n\\nAccording to a report by Peeping Moon, Arshad Warsi has now joined the cast in a pivotal role, though specific details about his character remain confidential. While Shah Rukh Khan and Warsi have maintained a long-standing friendship, this marks their first substantial on-screen collaboration, aside from Khan's previous cameo in Warsi's 2005 film \"Kuchh Meetha Ho Jayein\".\\n\\n## Production Details\\nThe film is particularly noteworthy as it marks the theatrical debut of Shah Rukh Khan's daughter Suhana Khan, who recently made her acting debut on OTT with \"The Archies\". \"King\" is being produced under Khan's Red Chillies Entertainment and Siddharth Anand's Marflix Pictures, with additional cast members including:\\n\\n* Abhishek Bachchan\\n* Abhay Verma of \"Munjya\" fame"
}