{
  "title": "Amrita Rao's sister Preetika Rao makes serious allegations against TV star Harshad Arora",
  "publication_date": "2025-04-17T21:44:17+05:30",
  "summary": "Preetika Rao, actress and sister of Amrita Rao, has made serious allegations against her former co-star Harshad Arora. In response to a fan posting romantic scenes from their show 'Beintehaa', Preetika accused Harshad of being a womanizer in an Instagram chat that surfaced on Reddit. She expressed anger at the circulation of their on-screen romantic scenes and claimed Harshad \"sleeps with every woman he finds in the industry.\"",
  "content": "Amrita Rao's sister, Preetika Rao, has been a part of movies and the television industry. She gained popularity for her role as Aaliya Zain Abdullah in Beintehaa, where she starred opposite Harshad Arora. Their on-screen chemistry was widely appreciated during the show's run from 2013 to 2014.\n\nRecently, Preetika made headlines after responding angrily to a fan who shared romantic scenes from Beintehaa featuring her and Harshad. In an Instagram chat that later appeared on Reddit, she made serious allegations against her former co-star, calling him a womanizer.\n\nIn the leaked chat, Preetika wrote, \"Shame on you! For putting these videos on your page when I have repeatedly requested you not to post my videos with a man who sleeps with every woman he finds in the industry!\" She further added that only 5% of their scenes involved physical contact, and she objected to these particular scenes being circulated against her wishes.\n\nAfter Beintehaa, Preetika went on to appear in shows like Love Ka Hai Intezaar and Laal Ishq, while Harshad Arora worked in various shows including Dahleez, Sasural Simar Ka, and Ghum Hai Kisikey Pyaar Meiin. As of now, Harshad has not responded to these allegations, and Preetika has not provided any additional details about her claims.",
  "category": "Entertainment",
  "tags": [
    "television",
    "controversy",
    "Indian TV",
    "celebrities",
    "scandal",
    "Beintehaa",
    "social media"
  ],
  "location": "India",
  "source": {
    "title": "Amrita Rao’s sister Preetika Rao makes serious allegations against TV star Harshad Arora, says ‘Sleeps with e",
    "publication_date": 1744886657,
    "content": [
      {
        "title": "Amrita Rao’s sister Preetika Rao makes serious allegations against TV star Harshad Arora, says ‘Sleeps with every woman’",
        "publication_date": "2025-04-17T21:44:17+05:30",
        "content": "April 17, 2025 9:44 PM IST\n\nBySanskruti Nemane\n\nAmrita Rao's sister,Preetika Rao,has been a part of movies and the television industry. We have all loved her in Beintehaa. She played the role of Aaliya Zain Abdullah. She was seen opposite Harshad Arora and the jodi became a big hit. Their chemistry was loved by the audience. The show aired from 2013 to 2014, and it was one of the top TV shows. However, now, Preetika's comments against Harshad have left everyone shocked.Also Read -Yeh Rishta Kya Kehlata Hai star Rohit Purohit, Ayesha Singh, Sai Ketan Rao and other TV stars who ruled with performances despite non-hit shows [View Pics]She was upset when one of the fans ofBeintehaawho shared romantic scenes from the show. The scenes feature Preetika and Harshad. Preetika got upset and made serious allegations against Harshad. She revealed that he is someone who sleeps with every woman he meets.Also Read -Harshad Arora and Muskaan Rajput engagement: The Ghum Hai Kisikey Pyaar Meiin actor was once rumoured to be dating THESE actressesAn alleged screenshot ofPreetika Rao's chat with an Instagram user surfaced on Reddit. In this chat, she is seen calling Harshad a womaniser.Also Read -Ghum Hai Kisikey Pyaar Meiin actor Harshad Arora gets engaged to Muskaan RajputShe wrote, \"Shame on you! For putting these videos on your page when I have repeatedly requested you not to post my videos with a man who sleeps with every woman he finds in the industry! Pls note: You are doing something AGAINST THE WISH of my soul! The KARMA is yours!!! Face it!\"She further wrote, \"In Beintehaa, out of 95% of no touch & we had 5% of such scenes and you are blasting this all throughout against my wishes! SHAME on YOU! Mark my words you are taking upon yourself a very serious karma!\" This is a big story inentertainment newsandTV news.Take a look at the screenshots here:What's the tea? Pratika rao calls harshad arora a womaniser ?byu/ok_its_youinIndianTellyTalkAfterBeintehaa, Preetika was also seen inLove Ka Hai IntezaarandLaal Ishq. Harshad Arora did many other shows likeDahleez, Sasural Simar Ka, and Ghum Hai Kisikey Pyaar Meiin.This statement by Preetika has left everyone shocked. She has not yet shared any further details yet. Harshad Arora has also not reacted to this news yet.\n\nAmrita Rao's sister,Preetika Rao,has been a part of movies and the television industry. We have all loved her in Beintehaa. She played the role of Aaliya Zain Abdullah. She was seen opposite Harshad Arora and the jodi became a big hit. Their chemistry was loved by the audience. The show aired from 2013 to 2014, and it was one of the top TV shows. However, now, Preetika's comments against Harshad have left everyone shocked.Also Read -Yeh Rishta Kya Kehlata Hai star Rohit Purohit, Ayesha Singh, Sai Ketan Rao and other TV stars who ruled with performances despite non-hit shows [View Pics]\n\nShe was upset when one of the fans ofBeintehaawho shared romantic scenes from the show. The scenes feature Preetika and Harshad. Preetika got upset and made serious allegations against Harshad. She revealed that he is someone who sleeps with every woman he meets.Also Read -Harshad Arora and Muskaan Rajput engagement: The Ghum Hai Kisikey Pyaar Meiin actor was once rumoured to be dating THESE actresses\n\nAn alleged screenshot ofPreetika Rao's chat with an Instagram user surfaced on Reddit. In this chat, she is seen calling Harshad a womaniser.Also Read -Ghum Hai Kisikey Pyaar Meiin actor Harshad Arora gets engaged to Muskaan Rajput\n\nShe wrote, \"Shame on you! For putting these videos on your page when I have repeatedly requested you not to post my videos with a man who sleeps with every woman he finds in the industry! Pls note: You are doing something AGAINST THE WISH of my soul! The KARMA is yours!!! Face it!\"\n\nShe further wrote, \"In Beintehaa, out of 95% of no touch & we had 5% of such scenes and you are blasting this all throughout against my wishes! SHAME on YOU! Mark my words you are taking upon yourself a very serious karma!\" This is a big story inentertainment newsandTV news.\n\nWhat's the tea? Pratika rao calls harshad arora a womaniser ?byu/ok_its_youinIndianTellyTalk\n\nAfterBeintehaa, Preetika was also seen inLove Ka Hai IntezaarandLaal Ishq. Harshad Arora did many other shows likeDahleez, Sasural Simar Ka, and Ghum Hai Kisikey Pyaar Meiin.This statement by Preetika has left everyone shocked. She has not yet shared any further details yet. Harshad Arora has also not reacted to this news yet.\n\nPublished: April 17, 2025 9:44 PM IST\n\nBySanskruti Nemane\n\nBy clicking “Accept All Cookies”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts.Cookie Policy"
      },
      {
        "title": "Amrita Rao’s sister Preetika Rao makes serious allegations against TV star Harshad Arora, says ‘Sleeps with every woman’",
        "author": "Unknown Author",
        "publication_date": "2025-04-17T21:44:17+05:30"
      }
    ],
    "authors": [],
    "source": "Bollywood Life",
    "image_url": "https://st1.bollywoodlife.com/wp-content/uploads/2025/04/Harshad-Arora-Preetika-Rao-Beintehaa-1.jpg?impolicy=Medium_Resize&w=1280&h=900",
    "url": "https://www.bollywoodlife.com/tv/amrita-rao-sister-preetika-rao-makes-serious-allegations-against-tv-star-harshad-arora-3142638/"
  },
  "markdown_content": "## TV Career\\nAmrita Rao's sister, Preetika Rao, has been a part of movies and the television industry. She gained popularity for her role as Aaliya Zain Abdullah in \"Beintehaa,\" where she starred opposite Harshad Arora. Their on-screen chemistry was widely appreciated during the show's run from 2013 to 2014.\\n\\n## Recent Controversy\\nRecently, Preetika made headlines after responding angrily to a fan who shared romantic scenes from \"Beintehaa\" featuring her and Harshad. In an Instagram chat that later appeared on Reddit, she made serious allegations against her former co-star, calling him a womanizer.\\n\\nIn the leaked chat, Preetika wrote:\\n> \"Shame on you! For putting these videos on your page when I have repeatedly requested you not to post my videos with a man who sleeps with every woman he finds in the industry!\"\\n\\nShe further added that only 5% of their scenes involved physical contact, and she objected to these particular scenes being circulated against her wishes.\\n\\n## Career Developments\\nAfter \"Beintehaa,\" both actors moved on to different projects:\\n* Preetika appeared in shows like \"Love Ka Hai Intezaar\" and \"Laal Ishq\"\\n* Harshad Arora worked in various shows including:\\n  - \"Dahleez\"\\n  - \"Sasural Simar Ka\"\\n  - \"Ghum Hai Kisikey Pyaar Meiin\"\\n\\nAs of now, Harshad has not responded to these allegations, and Preetika has not provided any additional details about her claims."
}