{
  "title": "IT Sector Slowdown: AI, Trump Tariffs Not Solely To Blame, Says Sridhar Vembus Operating Thesis",
  "publication_date": "2025-04-16T00:00:00Z",
  "summary": "Zoho founder Sridhar Vembu attributes IT sector slowdown to broader inefficiencies in the software industry, beyond just AI disruption and Trump tariffs. Major Indian IT companies reported weak outlooks, with hiring freezes affecting graduate employment. Vembu suggests the industry needs fresh thinking as past models may not guide future success.",
  "content": "The slowdown seen in the headline numbers being reportered by India's information technology companies is not just a result of disruption due to artificial intelligence and the Trump tariffs but also inefficiency in products and services of the broader software industry, according to Zoho founder Sridhar Vembu.\n\nVembu stated in a social media post that the current situation isn't merely a cyclical downturn or AI-related issue. He pointed to inefficiencies that have accumulated over decades of a prolonged asset bubble, which were subsequently adapted in India.\n\nIndian IT majors including Tata Consultancy Services Ltd., Infosys Ltd., and Wipro Ltd. reported disappointing fourth quarter results and provided weak outlooks, leading to market disappointment. The sector has been struggling under tariff pressures, causing delays in new orders and project ramp-ups.\n\nA significant consequence has been a freeze in hiring, affecting a sector that traditionally provided employment opportunities for numerous young graduates annually.\n\nVembu warned that the country is at an \"inflection point\" and emphasized that the experiences of the past 30 years won't necessarily guide the next 30. He called for challenging existing assumptions and implementing fresh thinking approaches.",
  "category": "Business",
  "tags": [
    "IT industry",
    "technology",
    "artificial intelligence",
    "tariffs",
    "Indian economy",
    "employment",
    "business slowdown"
  ],
  "location": "India",
  "source": {
    "title": "IT Sector Slowdown: AI, Trump Tariffs Not Solely To Blame, Says Sridhar Vembus Operating Thesis",
    "publication_date": 1744932300,
    "content": [
      {
        "title": "IT Sector Slowdown: AI, Trump Tariffs Not Solely To Blame, Says Sridhar Vembu's 'Operating Thesis'",
        "publication_date": "Unknown",
        "content": "The slowdown seen in the headline numbers being reportered by India's information technology companies is not just a result of disruption due to artificial intelligence and the Trump tariffs but also inefficiency in products and services of the broader software industry, according to Zoho founder Sridhar Vembu.\n\n\"My operating thesis: what we are seeing is not just a cyclical downturn and it is not just AI related. Even without the uncertainty induced by tariffs, there was trouble ahead. The broader software industry has been quite inefficient, both in products and services,\" the billionaire said in a post on social media platform X.\n\nHe observed that inefficiencies have accumulated over decades of a prolonged asset bubble and those were adapted in India.\n\nSridhar Vembu shared his thesis on Indian IT in a post on X.\n\nIndian IT majorsTata Consultancy ServicesLtd.,InfosysLtd. andWiproLtd. reported their fourth quarter and full year financial results this week and gave a weak outlook, sparking disappointment on the street. The IT honchos have been under the tariff cloud which has delayed new orders and project ramp-ups.\n\nA fallout has been a freeze in hiring in a sector that has long provided a gateway for lakhs of young graduates to eager to enter the workforce every year.\n\n\"Our jobs came to depend on them. The IT industry sucked in talent that may have gone into manufacturing or infrastructure (for example). We are only in the early stages of a long reckoning,\" Sridhar Vembu said.\n\nThe Zoho Chief Scientist has warned that the country is at an \"inflection point\" and the last 30 years are not a good guide post to the next 30. \"We have to challenge our assumptions and do fresh thinking.\""
      },
      {
        "title": "IT Sector Slowdown: AI, Trump Tariffs Not Solely To Blame, Says Sridhar Vembu's 'Operating Thesis'",
        "author": "Shubhayan Bhattacharya",
        "publication_date": "Unknown"
      }
    ],
    "authors": [
      "Shubhayan Bhattacharya"
    ],
    "source": "NDTV Profit",
    "image_url": "https://media.assettype.com/bloombergquint/2025-04-18/87h9cbd2/GHgTnf1bMAAqz9c.jpg?w=1200&auto=format%2Ccompress&q=60&rect=0%2C0%2C3500%2C1969&",
    "url": "https://www.ndtvprofit.com/quarterly-earnings/it-sector-slowdown-ai-trump-tariffs-not-solely-to-blame-says-sridhar-vembu"
  },
  "markdown_content": "## Industry Analysis\\nThe slowdown seen in the headline numbers being reportered by India's information technology companies is not just a result of disruption due to artificial intelligence and the Trump tariffs but also inefficiency in products and services of the broader software industry, according to Zoho founder Sridhar Vembu.\\n\\n> Vembu stated in a social media post that the current situation isn't merely a cyclical downturn or AI-related issue. He pointed to inefficiencies that have accumulated over decades of a prolonged asset bubble, which were subsequently adapted in India.\\n\\n## Market Impact\\nIndian IT majors including Tata Consultancy Services Ltd., Infosys Ltd., and Wipro Ltd. reported disappointing fourth quarter results and provided weak outlooks, leading to market disappointment. The sector has been struggling under tariff pressures, causing delays in new orders and project ramp-ups.\\n\\nA significant consequence has been a freeze in hiring, affecting a sector that traditionally provided employment opportunities for numerous young graduates annually.\\n\\n## Future Outlook\\n> Vembu warned that the country is at an \"inflection point\" and emphasized that the experiences of the past 30 years won't necessarily guide the next 30. He called for challenging existing assumptions and implementing fresh thinking approaches."
}