{
  "title": "Meta CEO Admits TikTok Impact on Company's Growth at Antitrust Trial",
  "publication_date": "2025-04-17T14:28:37+00:00",
  "summary": "During Meta's antitrust trial, CEO Mark Zuckerberg testified that TikTok posed a significant competitive threat to Meta's business since 2018, acknowledging that the company's growth slowed dramatically after TikTok's rise in popularity. The testimony came during the FTC's trial that could potentially force Meta to separate Instagram and WhatsApp.",
  "content": "In Meta's antitrust trial on Wednesday, Meta CEO Mark Zuckerberg testified that TikTok's success was a significant risk to Meta's business, describing it as a \"top priority\" and a \"highly urgent\" competitive threat when it emerged in 2018.\n\nZuckerberg admitted that TikTok's arrival directly impacted Meta, noting that the company's \"growth slowed down dramatically\" when TikTok gained popularity. The testimony came during the U.S. Federal Trade Commission's trial against the social networking giant, which could potentially require Meta to spin off Instagram or WhatsApp as separate companies.\n\nThe Meta CEO also made notable observations about the evolving nature of social media platforms, stating that apps now serve primarily as discovery engines rather than relying on connections between friends and family for growth. However, Facebook is simultaneously attempting to return to its \"OG roots\" with new features designed to enhance friend connections, including a revamped Friends tab. Zuckerberg identified a \"return to OG Facebook\" as a key goal for 2025.\n\nThe timing of these developments coincides with ByteDance's acquisition of Musical.ly in 2017 and its subsequent merger with TikTok. Around this period, Meta (then Facebook) modified its reporting structure, switching to a \"family of apps\" metric that included Instagram and WhatsApp, reportedly to obscure slowing growth in its main platform.",
  "category": "Technology",
  "tags": [
    "social media",
    "Meta",
    "TikTok",
    "antitrust",
    "Mark Zuckerberg",
    "FTC",
    "business competition",
    "technology companies"
  ],
  "location": "United States",
  "source": {
    "title": "Chinese shopping app Taobao joins DHgate in Top 5 on US App Store",
    "publication_date": 1744899887,
    "content": [
      {
        "title": "Mark Zuckerberg says TikTok slowed Meta's growth | TechCrunch",
        "publication_date": "2025-04-17T14:28:37+00:00",
        "content": "Latest\n\nAI\n\nAmazon\n\nApps\n\nBiotech & Health\n\nClimate\n\nCloud Computing\n\nCommerce\n\nCrypto\n\nEnterprise\n\nEVs\n\nFintech\n\nFundraising\n\nGadgets\n\nGaming\n\nGoogle\n\nGovernment & Policy\n\nHardware\n\nInstagram\n\nLayoffs\n\nMedia & Entertainment\n\nMeta\n\nMicrosoft\n\nPrivacy\n\nRobotics\n\nSecurity\n\nSocial\n\nSpace\n\nStartups\n\nTikTok\n\nTransportation\n\nVenture\n\nEvents\n\nStartup Battlefield\n\nStrictlyVC\n\nNewsletters\n\nPodcasts\n\nVideos\n\nPartner Content\n\nTechCrunch Brand Studio\n\nCrunchboard\n\nContact Us\n\nIn Meta’s antitrust trial on Wednesday, Meta CEO Mark Zuckerberg testified that TikTok’s success was a risk to Meta’s business, saying the short-form video app was a “top priority” and a “highly urgent” competitive threat when it arrived in 2018, according toBloombergandotheroutlets.\n\nThe reports come from a packed first week of testimony in the U.S. Federal Trade Commission’s trial against the social networking giant. If the FTC’s lawyers prevail, the trial could potentially require Meta to spin out Instagram or WhatsApp as separate companies.\n\nNotably, Zuckerberg admitted on Wednesday that TikTok’s arrival had directly impacted Meta, saying his company had observed that its “growth slowed down dramatically” when TikTok became popular. He also said the ByteDance-owned app has continued to be a focus of Meta’s competitive efforts for several years.\n\nByteDancepurchasedMusical.ly in 2017, andmergedit with TikTok the following year. Around the same time, Meta (then known as Facebook)stopped reporting Facebook’s user numbersin its quarterly reports, shifting to a new “family of apps” metric that encompassed Instagram and WhatsApp. The change was designed to hide the fact that Meta’s flagship app was seeing slowing growth.\n\nZuckerberg made another interesting comment during the trial in response to a question about social media platforms’ “network effects.” He said it’s become less important for social media apps to leverage connections between friends and family to grow.\n\n“The apps now serve primarily as discovery engines,” Zuckerberg told the court. “People can take that content to messaging engines.”\n\nAt the same time, however, Facebook is trying to return to its “OG roots”by turning once again to those network effects. The company recently released new features designed to make it easier to connect with friends, includinga revamped Friends tabthat highlights friend requests and activity. In January, Zuckerberg told investors that a “return to OG Facebook” was a key goal for 2025.\n\nTopics\n\nConsumer News Editor\n\nSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\n\nOpenAI’s new reasoning AI models hallucinate more\n\nChatGPT is referring to users by their names unprompted, and some find it ‘creepy’\n\nOpenAI pursued Cursor maker before entering into talks to buy Windsurf for $3B\n\nDefense tech Theseus landed Y Combinator, the US Special Forces, and $4.3M from a tweet\n\nFlorida draft law mandating encryption backdoors for social media accounts billed ‘dangerous and dumb’\n\nThe latest viral ChatGPT trend is doing ‘reverse location search’ from photos\n\nFor security, Android phones will now auto-reboot after three days\n\n© 2025 Yahoo."
      },
      {
        "title": "Mark Zuckerberg says TikTok slowed Meta's growth | TechCrunch",
        "author": "Sarah Perez",
        "publication_date": "2025-04-17T14:28:37+00:00"
      }
    ],
    "authors": [
      "Sarah Perez"
    ],
    "source": "TechCrunch",
    "image_url": "https://techcrunch.com/wp-content/uploads/2025/04/taobao-GettyImages-2186362768.jpg",
    "url": "https://techcrunch.com/2025/04/17/chinese-shopping-app-taobao-joins-dhgate-in-top-5-on-us-app-store/"
  },
  "markdown_content": "## Competition and Growth Impact\\n\\nMark Zuckerberg testified that TikTok's success was a significant risk to Meta's business, describing it as a \"top priority\" and a \"highly urgent\" competitive threat when it emerged in 2018.\\n\\nZuckerberg admitted that TikTok's arrival directly impacted Meta, noting that the company's \"growth slowed down dramatically\" when TikTok gained popularity. The testimony came during the U.S. Federal Trade Commission's trial against the social networking giant, which could potentially require Meta to spin off Instagram or WhatsApp as separate companies.\\n\\n## Platform Evolution\\n\\nThe Meta CEO also made notable observations about the evolving nature of social media platforms:\\n\\n> Apps now serve primarily as discovery engines rather than relying on connections between friends and family for growth.\\n\\nHowever, Facebook is simultaneously attempting to return to its \"OG roots\" with new features designed to enhance friend connections, including a revamped Friends tab. Zuckerberg identified a \"return to OG Facebook\" as a key goal for 2025.\\n\\n## Strategic Changes\\n\\nThe timing of these developments coincides with:\\n* ByteDance's acquisition of Musical.ly in 2017\\n* Its subsequent merger with TikTok\\n* Meta's modification of reporting structure to a \"family of apps\" metric\\n  - Included Instagram and WhatsApp\\n  - Reportedly done to obscure slowing growth in its main platform"
}