{
  "title": "Move over, Med diet – plantains and cassava can be as healthy as tomatoes and olive oil, say researchers",
  "publication_date": "2025-04-17T09:00:36+00:00",
  "summary": "Research from Tanzania's Kilimanjaro region shows traditional African diets featuring plantains, cassava, and fermented banana drink can boost immune system and reduce inflammation, comparable to Mediterranean diet benefits. The study found people switching to heritage diets experienced anti-inflammatory effects, while those adopting Western diets showed increased inflammation markers.",
  "content": "Findings from Tanzania's Kilimanjaro region indicate traditional eating habits in rural Africa can boost the immune system and reduce inflammation.\n\nPlantains, cassava and fermented banana drink should be added to global healthy eating guidelines alongside the olive oil, tomatoes and red wine of the Mediterranean diet, say researchers who found the traditional diet of people living in Tanzania's Kilimanjaro region had a positive impact on the body's immune system.\n\nTraditional foods enjoyed in rural villages also had a positive impact on markers of inflammation, according to a study published in Nature Medicine. Researchers observed 77 young men who switched between heritage and western-style diets for two weeks, with blood samples taken throughout the study.\n\nThe heritage diet included meals like green plantain mixed with kidney beans, boiled chicken with vegetables, and brown rice and beans. Those following the traditional diet showed improved inflammatory markers and better immune response, while those switching to Western diets gained weight and showed increased inflammation.\n\nDr Godfrey Temba, the study's first author, noted that elderly villagers who consumed traditional diets remained very healthy into their 80s and 90s. The researchers argue that African heritage diets deserve recognition in global dietary guidelines, similar to Mediterranean and Nordic diets.\n\nThe team is now studying the impact of heritage diets on obesity and vaccine response in Tanzanians, while also planning to compare different regional heritage diets across Africa.",
  "category": "Health",
  "tags": [
    "nutrition",
    "diet",
    "health research",
    "African food",
    "traditional diet",
    "inflammation",
    "immune system",
    "Tanzania",
    "Mediterranean diet"
  ],
  "location": "Kilimanjaro region, Tanzania",
  "source": {
    "title": "Donald Trump is seeking to erase the United States as we know it | Laurence H Tribe",
    "publication_date": 1742779800,
    "content": [
      {
        "title": "Move over, Med diet – plantains and cassava can be as healthy as tomatoes and olive oil, say researchers",
        "publication_date": "2025-04-17T09:00:36+00:00",
        "content": "Findings from Tanzania’s Kilimanjaro region indicate traditional eating habits in rural Africa can boost the immune system and reduce inflammation\n\nPlantains, cassava and fermented banana drink should be added to global healthy eating guidelines alongside the olive oil, tomatoes and red wine of the Mediterranean diet, say researchers who found the traditional diet of people living in Tanzania’s Kilimanjaro region had a positive impact on the body’s immune system.\n\nTraditional foods enjoyed in rural villages also had a positive impact on markers of inflammation, the researchers found ina study published this monthin the journal Nature Medicine.\n\nDr Quirijn de Mast, one of the paper’s authors, said they were now in a race against time to record and study the potential benefits of African heritage diets before they disappear as people move to cities and adopt western-style eating habits.\n\n“Time is ticking because you see that these heritage diets are being replaced more and more by western diets,” he said. “We will lose so much interesting information [from which] we can learn – and not only for Africa.”\n\nIn previous research, the team had established that people following the traditional way of life in rural areas had a different immune-system profile to urban dwellers, with more anti-inflammatory proteins. Chronic inflammation is a key driver of many non-communicable diseases (NCDs), including rheumatoidarthritis and Alzheimer’s disease.\n\nThe new study set out to establish whether diet played a role. For a fortnight, 77 young men in their 20s and 30s were switched from heritage to western-style diets, or the reverse – with blood samples taken at the start and end, and again four weeks later.\n\nMeals on the heritage dietmenuincluded green plantain mixed with kidney beans, boiled chicken served with green vegetables and brown rice and beans. On the western-style menu, they included pizza, fried chicken and french fries and spaghetti served with beef stew.\n\nThose newly adopting a western-style diet saw inflammatory markers in their blood increase and tests suggested their immune systems did not respond as well to infections. They also gained weight. By contrast, switching from a western diet to a heritage diet had a largely anti-inflammatory effect, and blood markers linked to metabolic problems fell.\n\nIn a third arm of the trial, participants following a western-style diet were asked to drink the local fermented banana beverage, known asmbege, for one week. That group also saw improvements in markers of inflammation.\n\nFor Dr Godfrey Temba, the first author of the paper and a lecturer at KCMC University in Moshi, Tanzania, the findings were not a surprise. “When we are in most of the villages, talking to elderly people [of] 80 or 90 years, they are very healthy. They don’t have any health complications [and] they tell you about consuming this type of diet and this beverage since they were 25.”\n\nHowever, the diet and its benefits have not been explored and documented – unlike the traditional diets of the Mediterranean and Nordic countries, which arepromoted by the World Health Organizationfor their beneficial effects.\n\nTemba said: “We think this is the right time … so that [African heritage diets] can be also included in the global guidelines of diets, because they really have a health benefit – but because it’s not studied extensively, it’s not easy to convince [people] that they are healthy, because you don’t have enough data.”\n\nThe diet’s components, such as flavonoids and other polyphenols, and its impact on the gut microbiome were likely to play a part in the observed effects, De Mast said.\n\nThe study was conducted only in men for logistical reasons, but the researchers said they would expect similar findings in women, and for benefits to be maintained over time if people continued the diets.\n\nMany African countries are facing rising rates of NCDs such as diabetes, obesity and heart disease.\n\nDe Mast, who holds positions at KCMC University and Radboud University Medical Center in the Netherlands, said research priorities in Africa had historically been determined by countries in the global north with a focus on infectious diseases such as malaria, tuberculosis and HIV. “Research on [things like] immunology has been neglected. I hope it will change now, with the rapid rise in NCDs, because that will be a major challenge for health systems across Africa.”\n\nNutritional guidelines also tended to “translate what we know from the north to Africa”, he said. “I think you should have, really, region-specific recommendations based on scientific data.”\n\nThe team is now testing what impact adopting a heritage diet can have on Tanzanians living with obesity, including whether it can boost their response to vaccines, and plan to compare different regional heritage diets.\n\n“There’s so much diversity in dietary patterns across Africa – or [even just] in Tanzania,” said De Mast. “Godfrey is in Kilimanjaro region, but 30km down the road there is the Maasai tribe and their diet is entirely different. It’s mainly animal protein based – still, traditionally, cardiovascular disease was almost absent.\n\n“So I think this is just the beginning of research looking at these heritage diets.”"
      },
      {
        "title": "Move over, Med diet – plantains and cassava can be as healthy as tomatoes and olive oil, say researchers",
        "author": "Unknown Author",
        "publication_date": "2025-04-17T09:00:36+00:00"
      }
    ],
    "authors": [
      "Laurence Tribe"
    ],
    "source": "The Guardian",
    "image_url": "https://i.guim.co.uk/img/media/ce24dec802a807e4197af2de82a099b4363cf54c/0_0_4063_2438/master/4063.jpg?width=465&dpr=1&s=none&crop=none",
    "url": "https://www.theguardian.com/commentisfree/2025/mar/24/trump-us-constitution"
  },
  "markdown_content": "## Study Findings\\nTraditional eating habits in rural Africa can boost the immune system and reduce inflammation, according to findings from Tanzania's Kilimanjaro region.\\n\\n## Key Dietary Components\\nPlantains, cassava and fermented banana drink should be added to global healthy eating guidelines alongside the olive oil, tomatoes and red wine of the Mediterranean diet, say researchers who found the traditional diet of people living in Tanzania's Kilimanjaro region had a positive impact on the body's immune system.\\n\\n## Research Details\\nTraditional foods enjoyed in rural villages also had a positive impact on markers of inflammation, according to a study published in Nature Medicine. Researchers observed 77 young men who switched between heritage and western-style diets for two weeks, with blood samples taken throughout the study.\\n\\n## Traditional Menu Examples\\nThe heritage diet included:\\n* Green plantain mixed with kidney beans\\n* Boiled chicken with vegetables\\n* Brown rice and beans\\n\\nThose following the traditional diet showed improved inflammatory markers and better immune response, while those switching to Western diets gained weight and showed increased inflammation.\\n\\n## Expert Commentary\\n> Elderly villagers who consumed traditional diets remained very healthy into their 80s and 90s.\\n\\nnoted Dr Godfrey Temba, the study's first author. The researchers argue that African heritage diets deserve recognition in global dietary guidelines, similar to Mediterranean and Nordic diets.\\n\\n## Future Research\\nThe team is now:\\n* Studying the impact of heritage diets on obesity\\n* Examining vaccine response in Tanzanians\\n* Planning to compare different regional heritage diets across Africa"
}