{
  "title": "Yeh Rishta Kya Kehlata Hai: Abhir's jealousy peaks as he leaves the sofa to share bed with Kiara",
  "publication_date": "2025-04-17T14:45:00-06:00",
  "summary": "In Star Plus' show Yeh Rishta Kya Kehlata Hai, multiple relationship dramas unfold. While Ruhi struggles with her feelings for Armaan post Rohit's death, Kiara implements a plan to make Abhir jealous by spending time with Samrat. Abhir eventually moves from the sofa to share the bed with Kiara after hearing her pretend conversation with Samrat.",
  "content": "Star Plus' iconic show Yeh Rishta Kya Kehlata Hai is once again steering toward an emotional love triangle. Following Rohit's tragic death, Ruhi finds herself gradually drawn back to Armaan. Although she's trying to suppress these feelings and avoid thinking about him, her subconscious betrays her—Ruhi begins dreaming of Armaan kissing her forehead, Abhira walking away from him, and a possible future together.\n\nOnce portrayed with grey shades, Ruhi is now making a conscious effort to distance herself from Armaan emotionally, scolding herself whenever such thoughts cross her mind. However, her recurring dreams and emotional turmoil are making it difficult to hold back.\n\nOn the other side of the story, the love triangle involving Kiara is heating up. After discovering Charu and Abhir's relationship, Kiara has decided to mirror Abhir's behavior. She is trying to make him jealous by frequently bringing up Samrat, a friend she now spends a lot of time with—someone who brings a smile to her face.\n\nIn the upcoming episode, late at night, Abhir sleeping on the sofa while Kiara is on the bed, as usual. Suddenly, he hears whispers and giggles, as Kiara pretends to have a conversation with Samrat. When he questions her, she casually dismisses it, implying that he must be imagining things. Shortly after, Abhir quietly picks up his blanket and shifts to the bed, surprising Kiara who questions this change in his behavior.",
  "category": "Entertainment",
  "tags": [
    "television",
    "drama series",
    "Star Plus",
    "Indian TV",
    "romance",
    "relationships"
  ],
  "location": "India",
  "source": {
    "title": "Yeh Rishta Kya Kehlata Hai: Abhir’s jealousy peaks as he leaves the sofa to share bed with Kiara",
    "publication_date": 1744881455,
    "content": [
      {
        "title": "Yeh Rishta Kya Kehlata Hai: Abhir’s jealousy peaks as he leaves the sofa to share bed with Kiara",
        "publication_date": "Unknown",
        "content": "My Forums\n\nFollow us on\n\nPublished:Thursday,Apr 17, 2025 14:45 PM GMT-06:00\n\nAishwarya Nair\n\nStar Plus' iconic showYeh Rishta Kya Kehlata Haiis once again steering toward an emotional love triangle. Following Rohit's tragic death, Ruhi finds herself gradually drawn back to Armaan. Although she's trying to suppress these feelings and avoid thinking about him, her subconscious betrays her—Ruhi begins dreaming of Armaan kissing her forehead, Abhira walking away from him, and a possible future together.\n\nOnce portrayed with grey shades, Ruhi is now making a conscious effort to distance herself from Armaan emotionally, scolding herself whenever such thoughts cross her mind. However, her recurring dreams and emotional turmoil are making it difficult to hold back.\n\nThis shift has left viewers speculating whether Ruhi might once again slip into her past negative tendencies and pursue Armaan, putting his marriage with Abhira at risk. But it's not just the relationship at stake—now that Ruhi is also the surrogate mother of Armaan and Abhira's unborn child, another pressing concern arises: Will she be able to hand over the baby to the couple, or will emotions complicate things further?\n\nOn the other side of the story, the love triangle involving Kiara is heating up. After discovering Charu and Abhir’s relationship, Kiara has decided to mirror Abhir’s behavior. She is trying to make him jealous by frequently bringing up Samrat, a friend she now spends a lot of time with—someone who brings a smile to her face.\n\nShe has also started following a similar routine as Abhir. Just like him, she now leaves the house early, returns late, and avoids conversations, going straight to bed. Though she’s unsure if her plan will succeed, she is unaware that her strategy is already having an impact.\n\nIn the upcoming episode ofYeh Rishta Kya Kehlata Hai, late at night, Abhir sleeping on the sofa while Kiara is on the bed, as usual. Suddenly, he hears whispers and giggles, as Kiara pretends to have a conversation with Samrat. When he questions her, she casually dismisses it, implying that he must be imagining things.\n\nShortly after, Abhir quietly picks up his blanket and shifts to the bed. This unusual move surprises Kiara, prompting her to ask about the change in his behavior. Abhir responds by saying he will now sleep there just to prove that his ears aren’t playing tricks on him and then asks her to carry on with her conversation.\n\nRohit Purohit\n\nSamridhii Shukla\n\nYeh Rishta Kya Kehlata Hai\n\nStar Plus\n\nTo comment you need to either\n\np_name\n\n@p_username\n\np_groupname\n\np_bio\n\nPosts\n\nComments\n\np_commentcount\n\nJoined\n\np_joindate\n\nVisited\n\np_lastvisiteddate\n\nStay Connected with IndiaForums!\n\nBe the first to know about the latest news, updates, and exclusive\ncontent.\n\nInstall this web app on your iPhone for the best experience. It's easy,\njust tapand then \"Add to Home Screen\".\n\nQuick Links\n\nPopular Channels\n\nFollow us on\n\nDisclaimer:All Logos and Pictures of various Channels, Shows, Artistes, Media Houses,\nCompanies, Brands etc. belong to their respective owners, and are used to merely\nvisually identify the Channels, Shows, Companies, Brands, etc. to the viewer.\nIncase of any issue please contact the webmaster."
      },
      {
        "title": "Yeh Rishta Kya Kehlata Hai: Abhir’s jealousy peaks as he leaves the sofa to share bed with Kiara",
        "author": "Unknown Author",
        "publication_date": "Unknown"
      }
    ],
    "authors": [
      "Aishwarya Nair"
    ],
    "source": "India Forums",
    "image_url": "https://img.indiaforums.com/media/640x0/64/0283-yeh-rishta-kya-kehlata-hai-abhirs-jealousy-peaks-as-he-leaves-the-sofa-to-share-bed-with-kiara.jpg",
    "url": "https://www.indiaforums.com/article/yeh-rishta-kya-kehlata-hai-abhirs-jealousy-peaks-as-he-leaves-the-sofa-to-share-bed-with-kiara_220875"
  },
  "markdown_content": "## Current Plot Development\\nStar Plus' iconic show \"Yeh Rishta Kya Kehlata Hai\" is once again steering toward an emotional love triangle. Following Rohit's tragic death, Ruhi finds herself gradually drawn back to Armaan. Although she's trying to suppress these feelings and avoid thinking about him, her subconscious betrays her—Ruhi begins dreaming of Armaan kissing her forehead, Abhira walking away from him, and a possible future together.\\n\\n## Ruhi's Internal Struggle\\nOnce portrayed with grey shades, Ruhi is now making a conscious effort to distance herself from Armaan emotionally, scolding herself whenever such thoughts cross her mind. However, her recurring dreams and emotional turmoil are making it difficult to hold back.\\n\\n## Parallel Love Triangle\\nOn the other side of the story, the love triangle involving Kiara is heating up. After discovering Charu and Abhir's relationship, Kiara has decided to mirror Abhir's behavior. She is trying to make him jealous by frequently bringing up Samrat, a friend she now spends a lot of time with—someone who brings a smile to her face.\\n\\n## Upcoming Episode Preview\\nIn the upcoming episode, late at night, Abhir sleeping on the sofa while Kiara is on the bed, as usual. Suddenly, he hears whispers and giggles, as Kiara pretends to have a conversation with Samrat. When he questions her, she casually dismisses it, implying that he must be imagining things. Shortly after, Abhir quietly picks up his blanket and shifts to the bed, surprising Kiara who questions this change in his behavior."
}