{
  "title": "WHO warns that polio cases are on the rise",
  "publication_date": "2025-04-17T13:46:07+00:00",
  "summary": "WHO reports increasing polio cases globally due to funding disruptions for vaccination efforts. Only two countries remain with endemic wild-type polio, while vaccine-derived poliovirus poses risks in multiple nations. WHO recommends increased vaccination access and travel restrictions for unvaccinated individuals, despite facing significant funding challenges exceeding $200m in lost support.",
  "content": "The World Health Organization (WHO) has released an update on polio following the March 2025 meeting of the International Health Regulations Emergency Committee. Polio, which can cause lifelong disability, has been eradicated in Europe, the Americas, much of the western Pacific, and most of Asia. Wild poliovirus, which occurs naturally in the environment, has also been eliminated from the African continent.\n\nAt the time of writing, WHO recognises only two countries with endemic wild-type polio. Circulating vaccine-derived poliovirus (cVDPV), which results from mutations in populations treated with the oral polio vaccination who have not reached full immunity, has the potential to cause outbreaks in populations worldwide.\n\nWHO named five countries with a risk of international spread of their current polio outbreaks, including Afghanistan and Pakistan with wild-type polio circulation, as well as Mozambique, the Democratic Republic of the Congo, French Guiana, and Guinea with cVDPV types 1 and 3.\n\nDuring 2018-2028, polio vaccination rates are projected to remain largely stable and consistently high in many markets, including China, Australia, Italy, Japan, Russia, South Korea, and Spain, all of which report over 95% of children receiving a full course of polio vaccination by age 36 months.\n\nRecent disruptions to funding for vaccination efforts and broader health systems around the world will have an impact on polio infections. While WHO is asking for increased investment in polio control in the most vulnerable places around the world, over $200m in financial support for the global effort to eradicate polio has been lost.",
  "category": "Health",
  "tags": [
    "polio",
    "WHO",
    "vaccination",
    "public health",
    "disease control",
    "healthcare funding",
    "global health"
  ],
  "location": "Global",
  "source": {
    "title": "WHO warns that polio cases are on the rise",
    "publication_date": 1744877960,
    "content": [
      {
        "title": "WHO warns that polio cases are on the rise",
        "publication_date": "2025-04-17T13:46:07+00:00",
        "content": "Disruptions to funding for vaccination efforts and broader health systems globally will have an impact on polio infections.\n\nThe World Health Organization (WHO) has released an update on polio following the March 2025 meeting of the International Health Regulations Emergency Committee. Polio, which can cause lifelong disability, has been eradicated in Europe, the Americas, much of the western Pacific, and most of Asia. Wild poliovirus, which occurs naturally in the environment, has also been eliminated from the African continent. At the time of writing, WHO recognises only two countries with endemic wild-type polio. Circulating vaccine-derived poliovirus (cVDPV), which results from mutations in populations treated with the oral polio vaccination who have not reached full immunity, has the potential to cause outbreaks in populations worldwide. WHO has released its recommendations to prevent further outbreaks, paramount among them being increased access to vaccination, at a time when investment in global health is being deprioritised.WHO named five countries with a risk of international spread of their current polio outbreaks, including all countries with wild-type polio circulation (Afghanistan and Pakistan), as well as four countries with cVDPV types 1 and 3 (Mozambique, the Democratic Republic of the Congo, French Guiana, and Guinea). WHO’s recommendations include strengthening vaccine recommendations and access, as well as restricting travel for individuals who have not received vaccination. WHO also named 35 countries that reported imported cases of cVDPV type 2, and ten countries that reported infections of wild-type polio or cVDPV in the last 24 months. These countries are recommended to remain vigilant and maintain vaccination efforts to protect against resurgences in polio infections.Leading data and analytics companyGlobalData‘s epidemiologists track poliomyelitis vaccination coverage across the 16 major markets (the US, France, Germany, Italy, Spain, the UK, Japan, Australia, Brazil, Canada, China, India, Mexico, Russia, South Africa, and South Korea). During 2018-2028, polio vaccination rates are projected to remain largely stable and consistently high in many markets, including China, Australia, Italy, Japan, Russia, South Korea, and Spain, all of which report over 95% of children receiving a full course of polio vaccination by age 36 months. This protects both the children who receive the vaccination and slows the spread of polio, as it reduces the number of people who are vulnerable to infection.Recent disruptions to funding for vaccination efforts and broader health systems around the world will have an impact on polio infections. While WHO is asking for increased investment in polio control in the most vulnerable places around the world, including places that are affected by conflict or have poor access to already disrupted health systems, over $200m in financial support for the global effort to eradicate polio has been lost. In addition to the loss of funding, the effective dissolution of the United States Agency for International Development and the disruption of the United States President’s Emergency Plan for AIDS Relief, both of which provide funding, technical support, and logistical support to treatment and surveillance systems, will have a negative effect on global polio eradication efforts. With these disruptions, polio infections will continue to increase, especially in areas with the least comprehensive surveillance systems. The true effect of these funding disruptions will be unmeasured, but increased circulating polio infections, both wild-type and cVDPV, will inevitably reach places with robust surveillance where an increase will be measured. The WHO recommendations come at a time when they will be difficult to follow, but the global fight against polio will continue.\n\nThe gold standard of business intelligence.\n\nFind out more\n\nThe gold standard of business intelligence.\n\nFind out more\n\nGive your business an edge with our leading industry insights.\n\nGive your business an edge with our leading industry insights.\n\nVisit ourPrivacy Policyfor more information about our services, how we may use, process and share your personal data, including information on your rights in respect of your personal data and how you can unsubscribe from future marketing communications. Our services are intended for corporate subscribers and you warrant that the email address submitted is your corporate email address.\n\nView all newslettersfrom across the GlobalData Media network.\n\nHard data and deep insights on clinical trials strategy & operations\n\nPowered by\n\n© Verdict Media Limited 2025"
      },
      {
        "title": "WHO warns that polio cases are on the rise",
        "author": "GlobalData Healthcare",
        "publication_date": "2025-04-17T13:46:07+00:00"
      }
    ],
    "authors": [],
    "source": "Clinical Trials Arena",
    "image_url": "https://www.clinicaltrialsarena.com/wp-content/uploads/sites/22/2025/04/Polio-CW-feat-img.jpg",
    "url": "https://www.clinicaltrialsarena.com/analyst-comment/who-warns-polio-cases-on-the-rise/"
  },
  "markdown_content": "## Global Polio Status\\nThe World Health Organization (WHO) has released an update on polio following the March 2025 meeting of the International Health Regulations Emergency Committee. Polio, which can cause lifelong disability, has been eradicated in Europe, the Americas, much of the western Pacific, and most of Asia. Wild poliovirus, which occurs naturally in the environment, has also been eliminated from the African continent.\\n\\n## Current Endemic Regions\\nAt the time of writing, WHO recognises only two countries with endemic wild-type polio. Circulating vaccine-derived poliovirus (cVDPV), which results from mutations in populations treated with the oral polio vaccination who have not reached full immunity, has the potential to cause outbreaks in populations worldwide.\\n\\n## High-Risk Countries\\nWHO named five countries with a risk of international spread of their current polio outbreaks:\\n* Afghanistan and Pakistan with wild-type polio circulation\\n* Mozambique, the Democratic Republic of the Congo, French Guiana, and Guinea with cVDPV types 1 and 3\\n\\n## Vaccination Coverage\\nDuring 2018-2028, polio vaccination rates are projected to remain largely stable and consistently high in many markets, including:\\n* China\\n* Australia\\n* Italy\\n* Japan\\n* Russia\\n* South Korea\\n* Spain\\n\\nAll of these countries report over 95% of children receiving a full course of polio vaccination by age 36 months.\\n\\n## Funding Challenges\\nRecent disruptions to funding for vaccination efforts and broader health systems around the world will have an impact on polio infections. While WHO is asking for increased investment in polio control in the most vulnerable places around the world, over $200m in financial support for the global effort to eradicate polio has been lost."
}