{
  "title": "High-Sensitivity Troponin Tests Might Aid in Primary Prevention",
  "publication_date": "2025-04-15T00:00:00Z",
  "summary": "A new meta-analysis suggests that adding high-sensitivity cardiac troponin assays to conventional risk-prediction methods could improve primary cardiovascular disease prevention. The CAPRICE study, analyzing data from over 62,000 adults, found that both troponin T and I tests could help identify patients who might benefit from statin therapy, potentially preventing one CVD event per approximately 400-500 individuals screened.",
  "content": "Adding high-sensitivity cardiac troponin assays on top of conventional risk-prediction methods can potentially improve primary prevention efforts, according to a new meta-analysis.\n\nWhile best known for their ability to rule out or diagnose MI, these assays also can quantify very low concentrations of cardiac troponin T and I in otherwise healthy people. The study, published in the Journal of the American College of Cardiology, suggests there may be room for the tests in routine blood draws, especially for patients who are potential candidates for statin therapy.\n\nThe CAPRICE study included data from 62,150 adults without known CVD from 15 prospective longitudinal cohorts. High-sensitivity cardiac troponin T (hs-cTnT) was measured in 50,523 participants, while high-sensitivity cardiac troponin I (hs-cTnI) was used in 28,090 participants.\n\nOver a median follow-up of approximately 10-12 years, about 13-16% of patients had first onset CVD primary outcome events. The risk for these events increased with higher concentrations of both troponin types. Adding troponin assays to conventional risk factors increased overall predictive accuracy.\n\nResearchers estimated that hs-cTnT and hs-cTnI screening would prevent one additional CVD event for every 408 and 473 individuals without known CVD, respectively, based on reclassifying them to high risk and starting statin therapy.\n\nHowever, implementation challenges include physician awareness and cost barriers in lower-resourced areas. Experts suggest that wider adoption would require a significant mindset shift for clinicians who typically associate troponin assays with MI diagnosis only.",
  "category": "Health",
  "tags": [
    "medical research",
    "cardiovascular disease",
    "preventive medicine",
    "troponin tests",
    "clinical trials",
    "healthcare",
    "medical diagnostics"
  ],
  "location": "England",
  "source": {
    "title": "High-Sensitivity Troponin Tests Might Aid in Primary Prevention",
    "publication_date": 1744815600,
    "content": [
      {
        "title": "High-Sensitivity Troponin Tests Might Aid in Primary Prevention",
        "publication_date": "Unknown",
        "content": "Adding high-sensitivity cardiac troponin assays on top of conventional risk-prediction methods can potentially improve primary prevention efforts, according to a new meta-analysis.\n\nWhile best known for their ability to rule out or diagnose MI, these assays also can quantify very low concentrations of cardiac troponin T and I in otherwise healthy people. Authors of the study,publishedin the April 15, 2025, issue of theJournal of the American College of Cardiology, say that there may be room for the tests in routine blood draws, especially for patients who are potential candidates for statin therapy.\n\nTheir argument is akin to “repurposing” troponin assays given that they’re already accessible and relatively affordable, said Spencer J. Keene, PhD (University of Cambridge, England), joint first author of the paper along with Anoop S.V. Shah, MD, PhD (London School of Hygiene and Tropical Medicine, England).\n\n“We can now use them potentially for prognosis,” Keene told TCTMD, adding that the data “support maybe more use and also educating clinicians about using them in a different way.”\n\nInformation from a high-sensitivity troponin assay wouldn’t necessarily change treatment plans for patients already deemed high risk by conventional tools, but it could change the course for those at low or intermediate risk, Keene said. “We would still probably prefer that the high-risk group gets statins,” he explained. “The first step is that people should use risk-prediction models to support their decision-making, and then the next step would be looking at these add-on factors that could also support decision-making if there’s some uncertainty.”\n\nCommenting on the findings for TCTMD, Nicholas Marston, MD (Brigham and Women’s Hospital, Boston, MA), agreed that there is “less utility” for troponin assays in patients who already meet indications for statin therapy. Butcurrent guidelines, he said, support the use of “risk enhancers to help guide that discussion and make a decision about statins. Currently those are high-sensitivity CRP, eGFR for chronic kidney disease, [and] family history of early heart disease—these might be things that kind of push you over to starting statins in a patient. And I think high-sensitivity troponins could be one of those as well.”\n\nCAPRICE Data\n\nThe CAPRICE study included data from 62,150 adults (mean age 61 years; 48.5% women) without known CVD from 15 prospective longitudinal cohorts. High-sensitivity cardiac troponin T (hs-cTnT) was measured in 50,523 participants from 11 studies, while high-sensitivity cardiac troponin I (hs-cTnI) was used in 28,090 participants from six studies, with median concentrations of those two biomarkers recorded as 5.0 and 3.3 ng/L, respectively.\n\nOver a median follow-up of 11.8 years for the hs-cTnT and 9.8 years for the hs-cTnI groups, 16.1% and13.3% of patients, respectively, had first onset CVD primary outcome events—coronary heart disease or stroke. The risk for these events grew with each standard deviation higher concentration of hs-cTnT (HR 1.31; 95% CI 1.25-1.37) and hs-cTnI (HR 1.26; 95% CI 1.19-1.33).\n\nMoreover, adding troponin assays to conventional risk factors increased overall predictive accuracy. Using incidence rates from 2.1 million adults from the United Kingdom, the researchers estimated that hs-cTnT and hs-cTnI screening would prevent one additional CVD event for every 408 and 473 individuals without known CVD, respectively, based on reclassifying them to high risk and starting statin therapy.\n\nKeene said he was surprised to see that both troponin assays similarly improved risk prediction, though hs-cTnT had a “slight advantage” over hs-cTnI.  There has been “some controversyaround whether or not troponin I or troponin T is better,” he explained. “I think a lot of clinicians prefer troponin I and thought that it was a better prognostic marker than troponin T, and we essentially found that they’re either similar or even that troponin T is better.”\n\nRegardless, Keene argued in favor of more routine use of high-sensitivity troponins in primary prevention, but still thinks it’s worth initiating statins among patients whose risk might be down-classified by troponins. “I don’t think there’s enough evidence that troponins should be used to deny statins to people who are high risk,” he said.\n\nThe biggest challenges in the way of that approach right now include physician awareness and also cost barriers in lower-resourced areas, Keene said, adding that he’d like to see other studies confirm their findings and look at cost-effectiveness.\n\n‘Significant Mindset Shift’\n\nIn an accompanyingeditorial, Cian P. McCarthy, MBBCh (Massachusetts General Hospital and Harvard Medical School, Boston, MA), and colleagues write that the CAPRICE results “suggest incorporating hs-cTn into CVD risk-based primary treatment allocation has value both with respect to increasing the number of CVD events that may be prevented and, potentially, reducing overtreatment among individuals less likely to derive benefit.”\n\nHowever, this will necessitate a “significant mindset shift for clinicians” who typically think of troponin assays as tools for MI diagnosis, they add.\n\nMarston agreed, noting that his institutional software will prompt him with a warning when he tries to order a high-sensitivity troponin assay in a stable patient. While this alert is designed to call attention to patients who should not be treated in an outpatient clinic and instead transferred to the emergency department, it’s one example of a workflow change that might be needed for these tests to be more widely accepted outside of acute settings.\n\nMoving forward, he’d like to see studies demonstrate that, for example, patients with higher troponin levels also derive greater benefit from statin therapy. “Physicians really want to see that it can impact management and patient outcomes,” as theJUPITERtrial did for high sensitivity C-reactive protein, Marston added.\n\nYael L. Maxwell is Senior Medical Journalist for TCTMD and Section Editor of TCTMD'sFellows Forum. She served as the inaugural…\n\nShah ASV, Keene SJ, Pennells L, et al.Cardiac troponins and cardiovascular disease risk prediction: an individual-participant-data meta-analysis.J Am Coll Cardiol.2025;85:1471-1484.\n\nMcCarthy CP, McEvoy LW, Januzzi JL.Troponin testing for cardiovascular primary prevention decision making?J Am Coll Cardiol.2025;85:1485-1487.\n\nStay up-to-date with breaking news, conference slides, and topical videos covering the spectrum of CVD. Join our newsletter!\n\nRegister for TCTMD ®\n\nReceive the the latest news, research, and presentations from major meetings right to your inbox.\n\nTCTMD ® is produced by the Cardiovascular Research Foundation ® (CRF). CRF ®  is committed to igniting the next wave of innovation in research and education that will help doctors save and improve the quality of their patients’ lives. For more information, visit http://www.crf.org.\n\nNew atTCTMD?Register today!\n\nForgot Password\n\nEnter the email you used to register to reset your password.\n\nSign up to receive the most important cardiovascular news, research, and major meeting presentations.\n\nThis content is available for meeting attendees and/or Platinum Members"
      },
      {
        "title": "High-Sensitivity Troponin Tests Might Aid in Primary Prevention",
        "author": "Unknown Author",
        "publication_date": "Unknown"
      }
    ],
    "authors": [
      "Yael L. Maxwell"
    ],
    "source": "TCTMD.com",
    "image_url": "https://d14d5nk8lue86f.cloudfront.net/s3fs-public/styles/header_image/public/2025-04/High-Sensitivity%20Troponin%20Tests%20Might%20Aid%20in%20Primary%20Prevention.jpeg?itok=lmT8WOk_",
    "url": "https://www.tctmd.com/news/high-sensitivity-troponin-tests-might-aid-primary-prevention"
  },
  "markdown_content": "High-Sensitivity Troponin in Prevention\\n\\n## Study Findings\\nAdding high-sensitivity cardiac troponin assays on top of conventional risk-prediction methods can potentially improve primary prevention efforts, according to a new meta-analysis.\\n\\nWhile best known for their ability to rule out or diagnose MI, these assays also can quantify very low concentrations of cardiac troponin T and I in otherwise healthy people. The study, published in the *Journal of the American College of Cardiology*, suggests there may be room for the tests in routine blood draws, especially for patients who are potential candidates for statin therapy.\\n\\n## Study Details\\nThe CAPRICE study included data from 62,150 adults without known CVD from 15 prospective longitudinal cohorts:\\n* High-sensitivity cardiac troponin T (hs-cTnT) measured in 50,523 participants\\n* High-sensitivity cardiac troponin I (hs-cTnI) used in 28,090 participants\\n\\n## Outcomes\\nOver a median follow-up of approximately 10-12 years, about 13-16% of patients had first onset CVD primary outcome events. The risk for these events increased with higher concentrations of both troponin types. Adding troponin assays to conventional risk factors increased overall predictive accuracy.\\n\\nResearchers estimated that screening would prevent:\\n* One additional CVD event per 408 individuals using hs-cTnT\\n* One additional CVD event per 473 individuals using hs-cTnI\\nbased on reclassifying them to high risk and starting statin therapy.\\n\\n## Implementation Challenges\\nHowever, implementation faces several barriers:\\n* Physician awareness\\n* Cost barriers in lower-resourced areas\\n* Need for significant mindset shift among clinicians who typically associate troponin assays with MI diagnosis only"
}