{
  "title": "India tweaks gas procurement norms for fertiliser firms to cut costs",
  "publication_date": "2022-12-22T00:00:00Z",
  "summary": "India has modified its gas procurement policy for fertiliser companies, enabling them to purchase approximately 20% of their monthly gas requirements through the domestic spot market. This policy change aims to reduce government subsidy expenses.",
  "content": "NEW DELHI - India has introduced significant changes to its gas procurement policy affecting fertiliser companies, allowing them to source about 20% of their monthly gas requirements through the local spot market. The move represents a strategic shift in procurement practices aimed at reducing the government's substantial subsidy burden.\n\nThe policy adjustment comes as part of broader efforts to optimize costs in the fertiliser sector, where gas serves as a crucial raw material. Previously, fertiliser companies had more restricted procurement options, but this new flexibility could potentially lead to more cost-effective purchasing decisions.\n\nThe government sources indicate that this change is expected to result in meaningful savings on the national subsidy bill, which has been under pressure due to volatile global energy prices.",
  "category": "Business",
  "tags": [
    "fertiliser industry",
    "natural gas",
    "government policy",
    "subsidies",
    "energy markets",
    "India"
  ],
  "location": "New Delhi, India",
  "source": {
    "title": "India tweaks gas procurement norms for fertiliser firms to cut costs - sources",
    "publication_date": 1671666796,
    "content": "NEW DELHI, Dec 22 (Reuters) - India has tweaked the gas procurement policy for fertiliser companies, allowing them to buy about a fifth of their monthly needs through the local spot market to help the government cut its subsidy bill, two government s... [995 chars]",
    "source": "Reuters",
    "authors": [],
    "image_url": "https://www.reuters.com/pf/resources/images/reuters/reuters-default.png?d=124",
    "url": "https://www.reuters.com/world/india/india-tweaks-gas-procurement-norms-fertiliser-units-sources-2022-12-22/"
  },
  "markdown_content": "## Policy Changes in Indian Gas Procurement\\n\\nIndia has introduced significant changes to its gas procurement policy affecting fertiliser companies, allowing them to source about 20% of their monthly gas requirements through the local spot market. The move represents a strategic shift in procurement practices aimed at reducing the government's substantial subsidy burden.\\n\\nThe policy adjustment comes as part of broader efforts to optimize costs in the fertiliser sector, where gas serves as a crucial raw material. Previously, fertiliser companies had more restricted procurement options, but this new flexibility could potentially lead to more cost-effective purchasing decisions.\\n\\nThe government sources indicate that this change is expected to result in meaningful savings on the national subsidy bill, which has been under pressure due to volatile global energy prices."
}