{
  "title": "UNESCO Adds Ancient Indian Manuscripts to Memory of World Register",
  "publication_date": "2024-03-19T12:00:00Z",
  "summary": "UNESCO has inscribed the manuscripts of two significant ancient Indian texts - the Bhagavad Gita and Natyashastra - into its Memory of World Register, recognizing their historical and cultural significance.",
  "content": "The United Nations Educational, Scientific and Cultural Organization (UNESCO) has added the manuscripts of two foundational Indian texts to its prestigious Memory of World Register. The inscribed works include the Bhagavad Gita, one of Hinduism's most sacred philosophical texts, and the Natyashastra, an ancient treatise on the performing arts.\n\nThis recognition acknowledges these manuscripts' extraordinary cultural and historical importance in world heritage. The Memory of World Register serves as a global repository documenting humanity's documentary heritage.",
  "category": "World",
  "tags": [
    "UNESCO",
    "cultural heritage",
    "India",
    "manuscripts",
    "Bhagavad Gita",
    "Natyashastra",
    "world heritage",
    "Hinduism"
  ],
  "location": "India",
  "source": {
    "title": "Manuscripts of Bhagavad Gita, Natyashastra inscribed on UNESCO's Memory of World Register",
    "url": "https://www.ptinews.com/story/national/Manuscripts-of-Bhagavad-Gita--Natyashastra-inscribed-on-UNESCO-s-Memory-of-World-Register/2475168",
    "created_utc": 1744957555.0,
    "subreddit": "india",
    "media": [],
    "content": [
      {
        "title": "Press Trust Of India",
        "publication_date": "Unknown",
        "content": ""
      },
      {
        "title": "Press Trust Of India",
        "author": "Unknown Author",
        "publication_date": "Unknown"
      }
    ]
  },
  "markdown_content": "The United Nations Educational, Scientific and Cultural Organization (UNESCO) has added the manuscripts of two foundational Indian texts to its prestigious Memory of World Register. The inscribed works include the *Bhagavad Gita*, one of Hinduism's most sacred philosophical texts, and the *Natyashastra*, an ancient treatise on the performing arts.\\n\\nThis recognition acknowledges these manuscripts' extraordinary cultural and historical importance in world heritage. The Memory of World Register serves as a global repository documenting humanity's documentary heritage."
}