{
  "title": "Thug Life: Kamal Haasan apologises to fans for not collaborating with Mani Ratnam earlier",
  "publication_date": "2025-04-18T14:12:13+05:30",
  "summary": "Actor Kamal Haasan apologized to fans for the 37-year gap in collaboration with director Mani Ratnam since their 1987 film Nayakan. At the launch of Thug Life's single 'Jinguchaa' in Chennai, Haasan explained they were searching for better scripts. The duo is now reuniting for Thug Life, set to release on June 5.",
  "content": "Ace director Mani Ratnam and Indian star Kamal Haasan are reuniting on screen after 37 years, following their 1987 film Nayakan. Their new project Thug Life is scheduled for release on June 5. At Friday's launch event of the film's single 'Jinguchaa' in Chennai, Haasan addressed the long gap in their collaboration.\n\nHaasan expressed that nothing has changed between him and Mani Ratnam despite the years apart. He apologized for the long wait, explaining they were in search of better scripts. He credited the audience's desire to see them work together as the reason for their reunion.\n\nThe actor also drew parallels between Mani Ratnam and his mentor K Balachander's working styles. He revealed his nickname for Ratnam - 'Anju ara' (meaning 5:30 am) due to the director's early arrival during shoots.\n\nThe film features a strong cast including Trisha, Silambarasan, Joju George, Ashok Selvan, Nasser, and Abhirami. The technical team includes AR Rahman for music, Ravi K Chandran as cinematographer, and A Sreekar Prasad as editor. The project is a joint production of Raaj Kamal Films International, Madras Talkies, and Red Giant Movies.",
  "category": "Entertainment",
  "tags": [
    "Kamal Haasan",
    "Mani Ratnam",
    "Indian cinema",
    "Tamil films",
    "Thug Life",
    "AR Rahman",
    "Bollywood"
  ],
  "location": "Chennai, India",
  "source": {
    "title": "Internet is not feeling Disha Patani’s too-sultry recreation of Madhuri Dixit’s Dhak Dhak look: ‘It’s a no!’",
    "publication_date": 1744709603,
    "content": [
      {
        "title": "Thug Life: Kamal Haasan apologises to fans for not collaborating with Mani Ratnam earlier",
        "publication_date": "2025-04-18T14:12:13+05:30",
        "content": "Subscribe Now! Get features like\n\nAce directorMani Ratnamand Indian starKamal Haasanreuniting together on screen after a whopping 37 years is headline indeed. After the stunning Nayakan in 1987, the two stalwarts are back together for Thug Life which is all set to release on June 5. On Friday, the Thug Life team launched a single from the film called Jinguchaa was released at an event in Chennai. (Also read:Kamal Haasan reveals the similarity between Mani Ratnam's Thug Life and Nayakan)\n\nSpeaking at the event, Kamal Haasan opened up about why the two never got to work together again after Nayakan and even apologised. “Nothing has changed between Mani Ratnam and me even after all these years. It's our fault for waiting for so long to come together. We were in search of better scripts and it took this long for us to collaborate. We are now working together again because of you, the audience - who want us to work together again. We should have collaborated earlier. I’m sorry.”\n\nKamal Haasan, who has co-written Thug Life with Mani Ratnam, also added that he was reminded of working with renowned director K Balachander, who is his mentor and guru, when he worked with Mani Ratnam. “I am reminded of K Balachander when I see Mani Ratnam’s style of working. He knows what a huge compliment this is. This is our mutual respect. I even have a nickname for Mani Ratnam! ‘Anju ara’ Mani Ratnam (meaning 5.30 am Mani Ratnam) because of how early he was every single day during the shoot,” he said.\n\nOn Trisha and AbhiramiKamal Haasan who is known for his romances on screen also spoke about the two ladies in the film – Trisha and Abhirami – saying, “The two ladies don’t say ‘I love you’ to me – instead it is Joju George who does! He said ‘I Love you sir’ every day on set and I consoled myself with that,” he smiled jokingly.Thug Life also features Trisha, Silambarasan, Joju George, Ashok Selvan, Nasser, Abhirami and others. The music for the film is by maestro AR Rahman while the cinematographer is Ravi K Chandran and editor is A Sreekar Prasad. The film is jointly produced by Raaj Kamal Films International, Madras Talkies and Red Giant Movies.\n\nKamal Haasan who is known for his romances on screen also spoke about the two ladies in the film – Trisha and Abhirami – saying, “The two ladies don’t say ‘I love you’ to me – instead it is Joju George who does! He said ‘I Love you sir’ every day on set and I consoled myself with that,” he smiled jokingly.\n\nThug Life also features Trisha, Silambarasan, Joju George, Ashok Selvan, Nasser, Abhirami and others. The music for the film is by maestro AR Rahman while the cinematographer is Ravi K Chandran and editor is A Sreekar Prasad. The film is jointly produced by Raaj Kamal Films International, Madras Talkies and Red Giant Movies."
      },
      {
        "title": "Thug Life: Kamal Haasan apologises to fans for not collaborating with Mani Ratnam earlier",
        "author": "Unknown Author",
        "publication_date": "2025-04-18T14:12:13+05:30"
      }
    ],
    "authors": [
      "Zarafshan Shiraz"
    ],
    "source": "Hindustan Times",
    "image_url": "https://www.hindustantimes.com/ht-img/img/2025/04/15/550x309/Madhuri_Dixit_inspires_Disha_Patani_Dhak_Dhak_look_1744728934909_1744728935211.jpg",
    "url": "https://www.hindustantimes.com/lifestyle/fashion/madhuri-dixit-to-disha-patani-when-tribute-meets-tacky-diet-sabya-slams-dishas-bold-dhak-dhak-inspired-look-101744727017241.html"
  },
  "markdown_content": "## Reunion Announcement\\nAce director Mani Ratnam and Indian star Kamal Haasan are reuniting on screen after 37 years, following their 1987 film \"Nayakan.\" Their new project \"Thug Life\" is scheduled for release on June 5. At Friday's launch event of the film's single \"Jinguchaa\" in Chennai, Haasan addressed the long gap in their collaboration.\\n\\n## Haasan's Comments\\n> Nothing has changed between us despite the years apart.\\n\\nHaasan apologized for the long wait, explaining they were in search of better scripts. He credited the audience's desire to see them work together as the reason for their reunion.\\n\\nThe actor also drew parallels between Mani Ratnam and his mentor K Balachander's working styles. He revealed his nickname for Ratnam - \"Anju ara\" (meaning 5:30 am) due to the director's early arrival during shoots.\\n\\n## Cast and Crew\\n* Cast includes:\\n  - Trisha\\n  - Silambarasan\\n  - Joju George\\n  - Ashok Selvan\\n  - Nasser\\n  - Abhirami\\n\\n* Technical team:\\n  - Music: AR Rahman\\n  - Cinematographer: Ravi K Chandran\\n  - Editor: A Sreekar Prasad\\n  - Production: Joint venture of Raaj Kamal Films International, Madras Talkies, and Red Giant Movies"
}