{
  "title": "RBI Cancels License of Color Merchants Co-operative Bank in Ahmedabad",
  "publication_date": "2025-04-16T18:30:17+00:00",
  "summary": "The Reserve Bank of India has canceled the license of Ahmedabad-based Color Merchants Co-operative Bank due to insufficient capital and earning prospects. About 98.51% of depositors will receive full deposit insurance claims up to Rs 5 lakh from DICGC. The bank will cease operations from April 16, 2025.",
  "content": "The Reserve Bank took a major action on Wednesday by canceling the license of Ahmedabad-based Color Merchants Co-operative Bank. RBI cited insufficient capital and earning prospects as the primary reasons for this decision.\n\nAccording to the RBI, the bank's continuation would be detrimental to depositors' interests, as its current financial position would make it unable to repay depositors in full. The Registrar of Cooperative Societies, Gujarat, has been requested to issue a closure order and appoint a liquidator.\n\nRegarding depositors' funds, every account holder will be entitled to receive deposit insurance claims up to Rs 5 lakh from the Deposit Insurance and Credit Guarantee Corporation (DICGC). As per the bank's data, approximately 98.51% of depositors will receive their full deposit amounts. DICGC has already disbursed Rs 13.94 crore as of March 31, 2024.\n\nThe RBI explained that the cooperative bank failed to comply with certain Banking Regulation Act requirements, and allowing its continued operation would adversely affect public interest. The bank will cease all banking operations, including accepting and repaying deposits, from the close of business on Wednesday, April 16, 2025.",
  "category": "Business",
  "tags": [
    "banking",
    "RBI",
    "finance",
    "regulation",
    "cooperative banks",
    "DICGC",
    "bank license",
    "deposits"
  ],
  "location": "Ahmedabad, India",
  "source": {
    "title": "Bank license canceled: RBI canceled the license of this bank, know what will happen to the money deposite ...",
    "publication_date": 1744808417,
    "content": [
      {
        "title": "Bank license canceled: RBI canceled the license of this bank, know what will happen to the money deposited by the customers - informalnewz",
        "publication_date": "2025-04-16T18:30:17+00:00",
        "content": "The Reserve Bank took a big action on a bank on Wednesday and announced to cancel the license of the bank. RBI says that the bank does not have sufficient capital and earning prospects.\n\nRBI Action On Bank:The Reserve Bank has taken a big action on a bank on Wednesday and has announced to cancel the license of the bank. RBI says that the bank does not have sufficient capital and earning prospects. This bank is Ahmedabad-based ‘Color Merchants Co-operative Bank’. RBI has canceled the license of Color Merchants Co-operative Bank. RBI said, “The continuation of the bank will be detrimental to the depositors in future. With its current financial position, the bank will be unable to pay its current depositors in full.” In such a situation, bank customers are worried about what will happen to their deposited money now.\n\nWhat will happen to the customers’ money\n\nThe Reserve Bank of India (RBI) said in a statement that the Registrar of Cooperative Societies, Gujarat has also been requested to issue an order to close the bank and appoint a liquidator for the bank. Now as per the rule, every depositor will be entitled to receive deposit insurance claim amount of his deposits up to Rs 5 lakh only from the Deposit Insurance and Credit Guarantee Corporation (DICGC).\n\nRBI further said that as per the data submitted by the cooperative bank, about 98.51 per cent of the depositors are entitled to receive the full amount of their deposits from DICGC. As of March 31, 2024, DICGC has already paid Rs 13.94 crore out of the total insured deposits based on the wishes received from the respective depositors of the bank.\n\nWhat RBI said\n\nGiving reasons behind the cancellation of the license, RBI said that the bank does not have adequate capital and earning prospects. The cooperative bank has also failed to comply with certain requirements under the Banking Regulation Act. RBI also said that if the bank is allowed to continue its banking business further, it would adversely affect the public interest. After the cancellation of the license, the cooperative bank will stop banking business from the close of business on Wednesday (April 16, 2025). Banking business includes, among other things, accepting deposits and repayment of deposits."
      },
      {
        "title": "Bank license canceled: RBI canceled the license of this bank, know what will happen to the money deposited by the customers - informalnewz",
        "author": "Shyamu Maurya",
        "publication_date": "2025-04-16T18:30:17+00:00"
      }
    ],
    "authors": [
      "Shyamu Maurya"
    ],
    "source": "informalnewz",
    "image_url": "https://www.informalnewz.com/wp-content/uploads/2025/01/RBI-canceled-license.jpg",
    "url": "https://www.informalnewz.com/bank-license-canceled-rbi-canceled-the-license-of-this-bank-know-what-will-happen-to-the-money-deposited-by-the-customers/"
  },
  "markdown_content": "## License Cancellation\\nThe Reserve Bank took a major action on Wednesday by canceling the license of Ahmedabad-based Color Merchants Co-operative Bank. RBI cited insufficient capital and earning prospects as the primary reasons for this decision.\\n\\n## Financial Position\\nAccording to the RBI, the bank's continuation would be detrimental to depositors' interests, as its current financial position would make it unable to repay depositors in full. The Registrar of Cooperative Societies, Gujarat, has been requested to issue a closure order and appoint a liquidator.\\n\\n## Depositor Protection\\nRegarding depositors' funds, every account holder will be entitled to receive deposit insurance claims up to Rs 5 lakh from the Deposit Insurance and Credit Guarantee Corporation (DICGC). As per the bank's data, approximately 98.51% of depositors will receive their full deposit amounts. DICGC has already disbursed Rs 13.94 crore as of March 31, 2024.\\n\\n## Regulatory Details\\nThe RBI explained that the cooperative bank failed to comply with certain Banking Regulation Act requirements, and allowing its continued operation would adversely affect public interest. The bank will cease all banking operations, including accepting and repaying deposits, from the close of business on Wednesday, April 16, 2025."
}