{
  "title": "One dead, 12 infected in Legionnaires' disease outbreak in Sydney",
  "publication_date": "2024-04-17T16:04:26+00:00",
  "summary": "A Legionnaires' disease outbreak in central Sydney has resulted in one death and 12 infections. NSW Health reported that 11 of the infected individuals have been hospitalized. The outbreak is linked to people who spent time in central Sydney between March 13 and April 5. Health authorities are investigating cooling towers in the CBD area, with over 165 towers inspected and tested so far.",
  "content": "A person has died and 12 others have been infected after contracting Legionnaires' disease in an outbreak linked to central Sydney, the Department of Health in the Australian state of New South Wales announced on Thursday.\n\nThere are now 12 confirmed cases of Legionnaires' disease in people who spent time in central Sydney between March 13 and April 5, up from the six cases that had been diagnosed as of April 10. One of the confirmed cases died in the hospital, with 11 others requiring hospitalization for treatment.\n\nNSW Health urged anyone who spent time in central Sydney and surrounding areas in late March or early April to be aware of symptoms including fever, chills, a cough and shortness of breath.\n\nVicky Sheppeard, director of the southeast Sydney local public health unit, explained that outbreaks can occur when bacteria from environmental sources such as cooling towers atop large buildings become contaminated. Health authorities continue to work with the City of Sydney to identify, inspect and sample cooling towers in the CBD potentially linked to the outbreak.\n\nAccording to the World Health Organisation, the Legionnaires' disease mortality rate can be as high as 80 per cent in untreated immunosuppressed patients. Most people contract the disease by inhaling bacteria from water or soil, with older adults, smokers, and people with weakened immune systems being particularly susceptible.\n\nWhile the disease primarily affects the lungs, it can occasionally cause infections in wounds and other parts of the body, including the heart. A milder form known as Pontiac fever can produce fever, chills, headache and muscle aches, with symptoms usually clearing within two to five days.",
  "category": "Health",
  "tags": [
    "Legionnaires' disease",
    "public health",
    "disease outbreak",
    "Sydney",
    "NSW Health",
    "bacterial infection",
    "healthcare"
  ],
  "location": "Sydney, Australia",
  "source": {
    "title": "One dead, 12 infected in Legionnaires’ disease outbreak in Sydney",
    "publication_date": 1744886066,
    "content": [
      {
        "title": "One dead, 12 infected in Legionnaires' disease outbreak in Sydney - tennews.in: National News Portal",
        "publication_date": "2025-04-17T16:04:26+00:00",
        "content": "Publisher - Ten News Network\n\nSydney, April 17 (IANS) A person has died and 12 others have been infected after contracting Legionnaires’ disease in an outbreak linked to central Sydney, the Department of Health in the Australian state of New South Wales said on Thursday.\n\nThere are now 12 confirmed cases of Legionnaires’ disease in people who spent time in central Sydney between March 13 and April 5, up from the six cases that had been diagnosed as of April 10, the department said.\n\nIt said that one of the confirmed cases died in the hospital. Of the 12 reported cases, 11 have been hospitalised for treatment.\n\nNSW Health on Thursday urged anyone who spent time in central Sydney and surrounding areas in late March or early April to be aware of symptoms of Legionnaires’ disease, including fever, chills, a cough and shortness of breath.\n\nLegionnaires’ disease is a form of pneumonia caused by infection with Legionella bacteria, which is found naturally in fresh water. NSW Health said that symptoms can develop up to 10 days after exposure, Xinhua news agency reported.\n\n“Outbreaks sometimes occur when bacteria from environmental sources such as cooling towers atop large buildings become contaminated,” Vicky Sheppeard, director of the southeast Sydney local public health unit, said in a statement.\n\n“NSW Health continues to work closely with the City of Sydney to identify, inspect and sample any cooling towers in the CBD potentially implicated in the outbreak. To date, over 165 cooling towers have been inspected and tested,” she said.\n\nAccording to the World Health Organisation, the Legionnaires’ disease mortality rate can be as high as 80 per cent in untreated immunosuppressed patients.\n\nMost people catch Legionnaires’ disease by inhaling the bacteria from water or soil. Older adults, smokers, and people with weakened immune systems are particularly susceptible to Legionnaires’ disease.\n\nAlthough Legionnaires’ disease primarily affects the lungs, it occasionally can cause infections in wounds and in other parts of the body, including the heart.\n\nA mild form of Legionnaires’ disease — known as Pontiac fever — can produce fever, chills, headache and muscle aches. Pontiac fever doesn’t infect your lungs, and symptoms usually clear within two to five days.\n\n–IANS\n\nint/jk/vd\n\nSubscribe to get the latest posts sent to your email.\n\nPrev Post\n\nEmraan Hashmi shares ‘Ground Zero’ gives proper due to BSF’s courage and sacrifices\n\nNext Post\n\nDNA sequencing may become prime target for hackers, warns study\n\nEmbrace mindful eating and combat obesity: PM Modi on World Liver Day\n\nDelhi CM promises early creation of 1,139 Ayushman Arogya Mandirs with Centre’s help\n\nPaediatric thyroid cancer risk rises with early exposure to air, light pollution\n\nScientists create novel method to identify healthy and cancerous cells\n\nComments are closed."
      },
      {
        "title": "One dead, 12 infected in Legionnaires' disease outbreak in Sydney - tennews.in: National News Portal",
        "author": "TenNews Team",
        "publication_date": "2025-04-17T16:04:26+00:00"
      }
    ],
    "authors": [],
    "source": "tennews.in",
    "image_url": null,
    "url": "https://tennews.in/one-dead-12-infected-in-legionnaires-disease-outbreak-in-sydney/"
  },
  "markdown_content": "## Outbreak Update\\nA person has died and 12 others have been infected after contracting Legionnaires' disease in an outbreak linked to central Sydney, the Department of Health in the Australian state of New South Wales announced on Thursday.\\n\\nThere are now 12 confirmed cases of Legionnaires' disease in people who spent time in central Sydney between March 13 and April 5, up from the six cases that had been diagnosed as of April 10. One of the confirmed cases died in the hospital, with 11 others requiring hospitalization for treatment.\\n\\n## Public Health Advisory\\nNSW Health urged anyone who spent time in central Sydney and surrounding areas in late March or early April to be aware of symptoms including:\\n* Fever\\n* Chills\\n* Cough\\n* Shortness of breath\\n\\n## Official Response\\n> Outbreaks can occur when bacteria from environmental sources such as cooling towers atop large buildings become contaminated.\\n\\nsaid Vicky Sheppeard, director of the southeast Sydney local public health unit. Health authorities continue to work with the City of Sydney to identify, inspect and sample cooling towers in the CBD potentially linked to the outbreak.\\n\\n## Disease Information\\nAccording to the World Health Organisation, the Legionnaires' disease mortality rate can be as high as 80 per cent in untreated immunosuppressed patients. Most people contract the disease by inhaling bacteria from water or soil, with older adults, smokers, and people with weakened immune systems being particularly susceptible.\\n\\nWhile the disease primarily affects the lungs, it can occasionally cause infections in wounds and other parts of the body, including the heart. A milder form known as Pontiac fever can produce:\\n* Fever\\n* Chills\\n* Headache\\n* Muscle aches\\n\\nwith symptoms usually clearing within two to five days."
}