{
  "title": "U.S. Is Added to Human Rights Watchlist",
  "publication_date": "2025-03-09T00:00:00Z",
  "summary": "The United States has been added to the CIVICUS Monitor Watchlist due to concerns over democratic freedoms. The organization cites Trump administration's actions including cuts to foreign aid, crackdown on DEI programs, and restrictions on press freedom. The U.S. is now classified as \"narrowed\" in terms of civil liberties, joining countries like DRC, Italy, Pakistan, and Serbia.",
  "content": "The United States was added Sunday to the CIVICUS Monitor Watchlist, a research tool that publicizes the status of freedoms and threats to civil liberties worldwide.\n\nThe move comes amid President Donald Trump's \"assault on democratic norms and global cooperation,\" said CIVICUS—a global alliance and network of civil society groups, including Amnesty International, that advocates for greater citizen action in areas where civil liberties are limited. The organization cited the Administration's cut of more than 90% of its foreign aid contracts and its crackdown on diversity, equity, and inclusion (DEI) programs.\n\n\"The Trump Administration seems hellbent on dismantling the system of checks and balances which are the pillars of a democratic society,\" said Mandeep Tiwana, Interim Co-Secretary General of CIVICUS. The U.S. has been classified as \"narrowed,\" indicating that while most people can exercise their rights, there are some government attempts to violate these rights.\n\nThe watchlist addition comes amid several controversial developments, including crackdowns on pro-Palestinian protesters, changes to White House press pool selection procedures, and an ongoing lawsuit by the Associated Press over press access restrictions.\n\nThe White House has rejected CIVICUS' assessment, with Deputy Press Secretary Anna Kelly stating, \"This is nonsense: President Trump is leading the most transparent administration in history.\"",
  "category": "World",
  "tags": [
    "human rights",
    "civil liberties",
    "Trump administration",
    "politics",
    "democracy",
    "press freedom",
    "United States",
    "CIVICUS"
  ],
  "location": "Washington, DC, United States",
  "source": {
    "title": "U.S. Is Added to Human Rights Watchlist",
    "publication_date": 1741829400,
    "content": [
      {
        "title": "U.S. Is Added to Human Rights Watchlist",
        "publication_date": "Unknown",
        "content": "Reporter\n\nU.S. President Donald Trump addresses a joint session of Congress at the U.S. Capitol on March 04, 2025 in Washington, DC.\n\nReporter\n\nThe United States was added Sunday to the CIVICUS Monitor Watchlist, a research tool that publicizes the status of freedoms and threats to civil liberties worldwide.\n\nThe move comes amid President Donald Trump’s “assault on democratic norms and global cooperation,” said CIVICUS—a global alliance and network of civil society groups, including Amnesty International, that advocates for greater citizen action in areas where civil liberties are limited—in a press release. The organization also cited the Administration’s cut ofmore than 90% of its foreign aid contractsand its crackdown ondiversity, equity, and inclusion (DEI)—which Trump called “illegal and immoral discrimination programs”—through executive action.\n\nAdvertisement\n\nAdvertisement\n\n“The Trump Administration seems hellbent on dismantling the system of checks and balances which are the pillars of a democratic society,” said Mandeep Tiwana, Interim Co-Secretary General of CIVICUS, in a press release. “Restrictive Executive Orders, unjustifiable institutional cutbacks, and intimidation tactics through threatening pronouncements by senior officials in the Administration are creating an atmosphere to chill democratic dissent, a cherished American ideal.”\n\nMore From TIME\n\nOther countries on the watchlist include the Democratic Republic of Congo, Italy, Pakistan, and Serbia.\n\nCIVICUSoutlines the state of civil rights through five categories—open, narrowed, obstructed, repressed, and closed. “Open” is the highest ranking, meaning all people are able to practice liberties such as free speech, and the lowest is “closed.” Per CIVICUS, instances that result in a “decline in open civic space” include “repressive legislation that curtails free speech and dialogue, obstacles to civil society activities and operations and crackdowns on civil disobedience and peaceful demonstrations.”\n\nThe U.S. has been classified as “narrowed.” The “narrowed” label is CIVICUS’ assessment that while most people are able to exercise their rights of expression, free speech, and assembly, there are some attempts to violate these rights by the government. For example, CIVICUS citedcrackdowns on pro-Palestinian protestorsduring the Biden Administration, after advocates took to the streets and stagedcollege encampmentsto voice their discontent with the military assistance and funding the U.S. was sending to Israel. Students participated in demonstrations to demand their schoolsdivest from any companiesthat profit from or have a relationship with Israel.\n\n“We urge the United States to uphold the rule of law and respect constitutional and international human rights norms,” said Tiwana. “Americans across the political spectrum are appalled by the undemocratic actions of the current Administration.”\n\nThe White House has rejected CIVICUS’ assessment. “This is nonsense: President Trump is leading the most transparent administration in history,” said Deputy Press Secretary Anna Kelly in an email statement on Tuesday.\n\nThe \"narrowed\" category also reflects CIVICUS’ assessment that while there is an existing free press, there may be restrictions due to regulation or political pressure on media owners.\n\nThis comes at a time when the editorial decisions made by major media organizations and governing bodies have prompted much discussion.\n\nIn February, the Federal Communications Commission launched an investigation into NPR and PBS due to concerns that they were “violating federal law by airing commercials,” which bothnewsroom CEOs deny. The FCC chair alsospoke outagainst public funding for the two news sites.\n\nJeff Bezos, Amazon CEO and owner of the WashingtonPost, directed the organization to change the scope of its opinion pages in February, informing the team that they will be writing “in support and defense of two pillars: personal liberties and free markets.”\n\n“We’ll cover other topics too of course, but viewpoints opposing those pillars will be left to be published by others,” Bezos saidin his noteto thePostteam.\n\nThat same month, the White House announced its press team will pick the reporters who participate in the press pool—a move theWhite House press secretary Karoline Leavitt saidis about “restoring power back to the American people, who President Trump was elected to serve.” However, many journalism advocates criticized the act. “This move tears at the independence of a free press in the United States. It suggests the government will choose the journalists who cover the president. In a free country, leaders must not be able to choose their own press corps,” the White House Correspondents’ Association said in astatement on Feb. 25.\n\nThe White House is also currently ensnared in a lawsuit brought forward by the Associated Press. The news organization hassued three Trump Administration officials—including Leavitt—after it was barred from access to the White House press briefings because it refused to change its editorial style and refer to the Gulf of Mexico as the “Gulf of America,” after Trump renamed it in anExecutive Orderhe signed in January.\n\n©2025TIME USA, LLC. All Rights Reserved. Use of this site constitutes acceptance of ourTerms of Service,Privacy Policy (Your Privacy Rights)andDo Not Sell or Share My Personal Information.\n\nTIME may receive compensation for some links to products and services on this website. Offers may be subject to change without notice."
      },
      {
        "title": "U.S. Is Added to Human Rights Watchlist",
        "author": "Solcyré Burga",
        "publication_date": "Unknown"
      }
    ],
    "authors": [
      "Solcyre Burga"
    ],
    "source": "Time Magazine",
    "image_url": "https://api.time.com/wp-content/uploads/2025/03/GettyImages-2203341364.jpg",
    "url": "https://time.com/7266334/us-human-rights-watchlist-civil-liberties/"
  },
  "markdown_content": "## Civil Liberty Monitor Update\\nThe United States was added Sunday to the CIVICUS Monitor Watchlist, a research tool that publicizes the status of freedoms and threats to civil liberties worldwide.\\n\\nThe move comes amid President Donald Trump's \"assault on democratic norms and global cooperation,\" said CIVICUS—a global alliance and network of civil society groups, including Amnesty International, that advocates for greater citizen action in areas where civil liberties are limited. The organization cited the Administration's cut of more than 90% of its foreign aid contracts and its crackdown on diversity, equity, and inclusion (DEI) programs.\\n\\n> \"The Trump Administration seems hellbent on dismantling the system of checks and balances which are the pillars of a democratic society,\" said Mandeep Tiwana, Interim Co-Secretary General of CIVICUS.\\n\\nThe U.S. has been classified as \"narrowed,\" indicating that while most people can exercise their rights, there are some government attempts to violate these rights.\\n\\n## Recent Developments\\nThe watchlist addition comes amid several controversial developments, including:\\n* Crackdowns on pro-Palestinian protesters\\n* Changes to White House press pool selection procedures\\n* An ongoing lawsuit by the Associated Press over press access restrictions\\n\\n## White House Response\\n> \"This is nonsense: President Trump is leading the most transparent administration in history,\" stated Deputy Press Secretary Anna Kelly."
}