{
  "title": "How Much Protein Do I Really Need?",
  "publication_date": "2025-04-17T14:51:11-04:00",
  "summary": "UVA nutritionist Melanie Brede discusses daily protein requirements and dispels common misconceptions. The recommended dietary allowance is about 0.8 grams of protein per kilogram of body weight for healthy individuals. While athletes may need more, most people can meet their protein needs through regular meals without supplements.",
  "content": "New protein-enriched products are hitting grocery store shelves and being advertised seemingly every day, while diets prioritizing protein make the rounds on social media.\n\nWith this influx of products, plus sometimes contradictory nutritional advice, it may be hard to know whether you're meeting your nutritional needs. That's why UVA Today talked to Melanie Brede, a senior nutritionist at the University of Virginia's Student Health and Wellness Center, to learn the truth about protein.\n\nThe recommended dietary allowance for a \"basically healthy individual,\" is about a gram of protein for every two pounds of body weight, or 0.8 grams of protein per kilogram of body weight. A person who weighs 160 pounds, for example, would need to eat about 80 grams of protein per day.\n\nEndurance athletes training for events like a marathon probably need to up their protein to 1.2 to 1.6 grams of protein for every 2.2 pounds of body weight. Strength athletes – like bodybuilders – should get about 2 grams of protein for every 2.2 pounds of body weight.\n\nGood news for vegans and vegetarians: There are lots of good non-meat protein sources, such as nuts, beans, eggs and soy products like tofu. Even grain products like bread, rice and pasta contain protein.\n\nProtein bars, powders and shakes can be a convenient way to get protein, but when you opt for these over whole foods like scrambled eggs, you trade nutritional benefits for convenience. Brede emphasizes focusing on a food-first approach.",
  "category": "Health",
  "tags": [
    "nutrition",
    "protein",
    "diet",
    "health",
    "fitness",
    "vegetarian",
    "supplements"
  ],
  "location": "Virginia, United States",
  "source": {
    "title": "How Much Protein Do I Really Need?",
    "publication_date": 1744896071,
    "content": [
      {
        "title": "How Much Protein Do I Really Need?",
        "publication_date": "2025-04-17T14:51:11-04:00",
        "content": "Every week it seems there’s a new diet or protein-enriched snack to try. UVA nutritionist Melanie Brede offers tips to make sure you meet your nutritional needs. (Illustration by John DiJulio, University Communications)\n\nNew protein-enriched products are hitting grocery store shelves and being advertised seemingly every day, while diets prioritizing protein make the rounds on social media.\n\nWith this influx of products, plus sometimes contradictory nutritional advice, it may be hard to know whether you’re meeting your nutritional needs. That’s why UVA Today talked to Melanie Brede, a senior nutritionist at the University of Virginia’s Student Health and Wellness Center, to learn the truth about protein.\n\nThe recommended dietary allowance for a “basically healthy individual,” is about a gram of protein for every two pounds of body weight, or 0.8 grams of protein per kilogram of body weight, Brede said. A person who weighs 160 pounds, for example, would need to eat about 80 grams of protein per day.\n\nBrede teaches clients to use their hands to estimate portion sizes. For example, a hamburger about the size of someone’s palm is four or five ounces of beef, which adds up to about 40 grams of protein, with each ounce providing eight grams.\n\n“There’s half your protein needs in one day right there,” Brede says.\n\nPlant-based sources of protein, like beans and nuts, need to double in quantity to get a similar amount of protein.\n\nBrede says while it may be boring, the advice to eat three meals a day, plus snacks, is tried and true. (Contributed photo)\n\nFor most people, the answer is no. Typical forms of exercise, like walking the dog or light aerobics, don’t dramatically increase a person’s protein needs.\n\nEndurance athletes training for events like a marathon probably need to up their protein to 1.2 to 1.6 grams of protein for every 2.2 pounds of body weight. Strength athletes – like bodybuilders – should get about 2 grams of protein for every 2.2 pounds of body weight. But that may be temporary.\n\n“Our bodies get more efficient at using protein and building muscle as we increase our fitness, so it’s believed that we most need that extra protein when exercise is new,” Brede said.\n\nUsually, it’s relatively easy for people to meet their protein needs even with a new workout routine, because they’ll also be eating more calories to fuel those workouts.\n\nGood news for vegans and vegetarians: There are lots of good non-meat protein sources, Brede said, such as nuts, beans, eggs and soy products like tofu. Even grain products like bread, rice and pasta contain protein.\n\n“Even in carrots and broccoli and peppers, you can find a little bit of protein,” Brede said.\n\nVegans and vegetarians often need to eat a larger volume of food – not just to meet their protein needs, but also to ensure they’re consuming enough calories overall.\n\n“If you’re building something, you probably need a little more protein,” Brede said.\n\nThat applies to building muscle, but also the growth of new cells during pregnancy.\n\nThere’s some evidence that women in menopause should slightly increase their protein. Brede added that as people age, regardless of gender, it’s important to make sure they get their protein in “doses” throughout the day.\n\nBrede uses an analogy of building a wall. You might have all the bricks you need, but if someone asks you to build a wall in a minute, you won’t succeed. Protein works similarly – you might meet all your daily needs in one meal, but your body can’t use it as efficiently to build muscle. Instead, it might get stored or burned as energy.\n\n“It might sound like boring advice, but you should get three meals a day and some snacks,” Brede said.\n\nProtein bars, powders and shakes are seemingly everywhere. And they can certainly be a convenient way to get protein, Brede said.\n\n“Most often, those products are using whey protein, which is a protein in milk, or they use a pea protein or a soy protein,” Brede said. “They had to start with food.”\n\nWhen you opt for a protein bar over some scrambled eggs, you trade the nutritional benefits of “whole foods” for convenience, Brede said.\n\n“I’m always going to focus on a food-first approach,” Brede said.\n\nAlice Berry\n\nUniversity News AssociateOffice of University Communications\n\naberry@virginia.edu434-924-6861\n\nApril 19, 2025"
      },
      {
        "title": "How Much Protein Do I Really Need?",
        "author": "Unknown Author",
        "publication_date": "2025-04-17T14:51:11-04:00"
      }
    ],
    "authors": [],
    "source": "UVA Today",
    "image_url": "https://news.virginia.edu/sites/default/files/Header-SF-Protein-QA-JD.jpg",
    "url": "https://news.virginia.edu/content/how-much-protein-do-i-really-need"
  },
  "markdown_content": "New protein-enriched products are hitting grocery store shelves and being advertised seemingly every day, while diets prioritizing protein make the rounds on social media.\\n\\n## Recommended Protein Intake\\nThe recommended dietary allowance for a \"basically healthy individual,\" is about a gram of protein for every two pounds of body weight, or 0.8 grams of protein per kilogram of body weight. A person who weighs 160 pounds, for example, would need to eat about 80 grams of protein per day.\\n\\n## Athletic Requirements\\n* Endurance athletes training for events like a marathon probably need to up their protein to 1.2 to 1.6 grams of protein for every 2.2 pounds of body weight\\n* Strength athletes – like bodybuilders – should get about 2 grams of protein for every 2.2 pounds of body weight\\n\\n## Plant-Based Options\\nGood news for vegans and vegetarians: There are lots of good non-meat protein sources, such as:\\n* Nuts\\n* Beans\\n* Eggs\\n* Soy products like tofu\\n* Grain products like bread, rice and pasta\\n\\n## Expert Advice\\n> Protein bars, powders and shakes can be a convenient way to get protein, but when you opt for these over whole foods like scrambled eggs, you trade nutritional benefits for convenience.\\n\\nBrede emphasizes focusing on a food-first approach."
}