{
  "title": "Jaat Box Office Collection Day 8: 121% Higher Than Deva, Clocks 4th Highest Opening Week Of 2025 In Bollywood!",
  "publication_date": "2025-04-18T10:24:27+00:00",
  "summary": "Sunny Deol's film Jaat has completed its 8-day extended opening week with collections of 62.24 crores, marking the 4th highest opening week of 2025 in Bollywood. The film showed resilience despite mid-week blues, earning 4.27 crores on day 8. With a budget of 100 crores, the film has recovered 62.24% of its cost and faces new competition from Kesari Chapter 2.",
  "content": "Jaat has concluded its 8-day extended opening weekend at the box office. Sunny Deol starrer has maintained a decent run so far, but the real test begins today, with the arrival of Kesari Chapter 2.\n\nDespite the mid-week blues, Gopichand Malineni's directorial has maintained a good hold at the ticket windows. On day 8, it witnessed a slight improvement, with 4.27 crores in the kitty. Randeep Hooda co-starrer registered a growth of 5% compared to 4.05 crores earned on Wednesday.\n\nThe 8-day extended opening week concludes at 62.24 crores. Including taxes, the gross earnings stand at 70.40 crores. Sunny Deol's Jaat has scored the 4th highest opening week of 2025, surpassing Shahid Kapoor's Deva.\n\nAccording to multiple reports, Sunny Deol's film was mounted on a budget of 100 crores. In 8 days, it has recovered 62.24% of its estimated cost. It must maintain a strong pace in the coming days in order to achieve the breakeven stage.\n\nOwing to the favorable response for Jaat, producers Mythri Movie Makers have already confirmed a sequel is in the works. Gopichand Malineni will return as director, and Sunny Deol will reprise his lead role.",
  "category": "Entertainment",
  "tags": [
    "bollywood",
    "box office",
    "Sunny Deol",
    "Jaat",
    "movie business",
    "Indian cinema",
    "film collections"
  ],
  "location": "India",
  "source": {
    "title": "Jaat Box Office Collection Day 8: 121% Higher Than Deva, Clocks 4th Highest Opening Week Of 2025 In Bollywood!",
    "publication_date": 1744950267,
    "content": [
      {
        "title": "Jaat Box Office Collection Day 8: 121% Higher Than Deva, Clocks 4th Highest Opening Week Of 2025 In Bollywood!",
        "publication_date": "2025-04-18T10:24:27+00:00",
        "content": "Home»Box Office\n\nJaat has concluded its 8-day extended opening weekend at the box office. Sunny Deol starrer has maintained a decent run so far, but the real test begins today, with the arrival of Kesari Chapter 2. Scroll below to learn about the box office collections on day 8, budget recovery, and more!\n\nDespite the mid-week blues, Gopichand Malineni’s directorial has maintained a good hold at the ticket windows. On day 8, it witnessed a slight improvement, with4.27 croresin the kitty. Randeep Hooda co-starrer registered a growth of5%compared to4.05 croresearned on Wednesday.\n\nThe 8-day extended opening week concludes at62.24 crores. Including taxes, the gross earnings stand at70.40 crores. Sunny Deol’s Jaat has scored the 4th highest opening week of 2025, surpassing Shahid Kapoor’s Deva.\n\nTake a look at the highest opening-week collections of 2025 in Bollywood:\n\nAs visible, Jaat has clocked almost121%higher collections than Deva.\n\nAccording to multiple reports, Sunny Deol’s film was mounted on a budget of100 crores. In 8 days, it has recovered62.24%of its estimated cost. It must maintain a strong pace in the coming days in order to achieve the breakeven stage.\n\nToday, Jaat will enjoy a boost due to the Good Friday holiday, followed by an improvement in footfalls during the second weekend. However, it will now have to battle against Akshay Kumar’s Kesari Chapter 2 at the box office.\n\nOwing to the favorable response for Jaat, producers Mythri Movie Makers have already taken a step ahead. They confirmed the sequel is now in the works.Gopichand Malineniwill don the director’s hat again, and Sunny Deol will reprise his lead role.\n\nNote: Box office numbers are based on estimates and various sources. Numbers have not been independently verified by Koimoi.\n\nStay tuned to Koimoi for morebox office updates!\n\nMust Read:Kesari Chapter 2 Box Office Day 1 Morning Occupancy: Akshay Kumar Outshines Sky Force, A Good Friday Indeed!\n\nFollow Us:Facebook|Instagram|Twitter|YouTube|Google News\n\nSocial Network"
      },
      {
        "title": "Jaat Box Office Collection Day 8: 121% Higher Than Deva, Clocks 4th Highest Opening Week Of 2025 In Bollywood!",
        "author": "Jishika Madaan",
        "publication_date": "2025-04-18T10:24:27+00:00"
      }
    ],
    "authors": [
      "Jishika Madaan"
    ],
    "source": "Koimoi",
    "image_url": "https://www.koimoi.com/wp-content/new-galleries/2025/04/jaat-box-office-collection-day-8-121-higher-than-deva-clocks-4th-highest-opening-week-of-2025-in-bollywood.jpg",
    "url": "https://www.koimoi.com/box-office/jaat-box-office-collection-day-8-121-higher-than-deva-clocks-4th-highest-opening-week-of-2025-in-bollywood/"
  },
  "markdown_content": "## Box Office Performance\\nJaat has concluded its 8-day extended opening weekend at the box office. Sunny Deol starrer has maintained a decent run so far, but the real test begins today, with the arrival of Kesari Chapter 2.\\n\\nDespite the mid-week blues, Gopichand Malineni's directorial has maintained a good hold at the ticket windows. On day 8, it witnessed a slight improvement, with 4.27 crores in the kitty. Randeep Hooda co-starrer registered a growth of 5% compared to 4.05 crores earned on Wednesday.\\n\\n## Collection Figures\\n* 8-day extended opening week: 62.24 crores\\n* Gross earnings (including taxes): 70.40 crores\\n* Achievement: 4th highest opening week of 2025, surpassing Shahid Kapoor's Deva\\n\\n## Financial Analysis\\nAccording to multiple reports, Sunny Deol's film was mounted on a budget of 100 crores. In 8 days, it has recovered 62.24% of its estimated cost. It must maintain a strong pace in the coming days in order to achieve the breakeven stage.\\n\\n## Future Plans\\nOwing to the favorable response for \"Jaat,\" producers Mythri Movie Makers have already confirmed a sequel is in the works. Gopichand Malineni will return as director, and Sunny Deol will reprise his lead role."
}