{
  "title": "Meet the kids struggling to breathe in India's choked capital",
  "publication_date": "2023-12-13T12:36:02Z",
  "summary": "Parents in New Delhi face difficult decisions as air pollution reaches dangerous levels, forcing some families to relocate. The story follows Amrita Rosha, a mother of two children, who has chosen to leave the city due to health concerns related to the deteriorating air quality.",
  "content": "Families in New Delhi are grappling with severe air pollution that has turned the Indian capital into one of the world's most polluted cities. The crisis is particularly affecting children, leading parents to make tough choices about their future.\n\nAmrita Rosha, a 45-year-old mother, has decided to leave the city with her two children - 4-year-old Vanaaya and 9-year-old Abhiraj. The decision comes as pollution levels continue to pose serious health risks, especially to young developing lungs.\n\nThe city's air quality has deteriorated significantly, with pollution levels frequently reaching hazardous levels that far exceed World Health Organization guidelines. This environmental crisis has created a new category of pollution refugees - families forced to relocate simply to protect their children's health.",
  "category": "Health",
  "tags": [
    "air pollution",
    "public health",
    "environment",
    "India",
    "children",
    "urban crisis",
    "climate"
  ],
  "location": "New Delhi, India",
  "source": {
    "title": "Meet the kids struggling to breathe in India’s choked capital",
    "publication_date": 1734118162,
    "content": "By Aishwarya S Iyer, CNN\nNew Delhi (CNN) — As pollution worsens in the Indian capital, parents are facing an impossible choice: stay or go.\nAmrita Rosha, 45, is among those choosing to flee with her children. Both of them — Vanaaya, 4, and Abhiraj, 9... [7629 chars]",
    "source": "KRDO",
    "authors": [],
    "image_url": "https://krdo.b-cdn.net/2019/11/cropped-krdo-logo-32x32.png",
    "url": "https://krdo.com/news/2024/12/13/meet-the-kids-struggling-to-breathe-in-indias-choked-capital/"
  },
  "markdown_content": "## Air Quality Crisis\\nFamilies in New Delhi are grappling with severe air pollution that has turned the Indian capital into one of the world's most polluted cities. The crisis is particularly affecting children, leading parents to make tough choices about their future.\\n\\n## Impact on Families\\n> \"The decision comes as pollution levels continue to pose serious health risks, especially to young developing lungs,\" says Amrita Rosha, a 45-year-old mother who has decided to leave the city with her two children - 4-year-old Vanaaya and 9-year-old Abhiraj.\\n\\n## Environmental Exodus\\nThe city's air quality has deteriorated significantly, with pollution levels frequently reaching hazardous levels that far exceed World Health Organization guidelines. This environmental crisis has created a new category of pollution refugees - families forced to relocate simply to protect their children's health."
}