{
  "title": "12 Indians on the Cannes Lions 2025 Awarding Jury line-up",
  "publication_date": "2024-03-19T00:00:00Z",
  "summary": "Cannes Lions has announced its 2025 jury lineup, featuring 12 Indian professionals from advertising, media, and PR industries. The jury includes notable names like Josy Paul as jury president for Sustainable Development Goals Lions, and representatives across various categories including Brand Experience, Creative Data, Design, Entertainment, and more.",
  "content": "Cannes Lions has revealed the lineup of global experts selected to award the world's best creative and effective work this June. The Cannes Lions International Festival of Creativity will run from 16 to 20 June 2025.\n\n12 professionals from India's advertising, media, and PR industries have been named to the jury across various categories. Notable appointments include Josy Paul, chairperson and CCO of BBDO India, serving as jury president for the Sustainable Development Goals Lions. Russell Barrett from TBWA\\India joins the Brand Experience & Activation Lions jury, while Vikram Pandey of Leo will judge Creative Data Lions.\n\nOther prominent jury members include Mahima Mathur for Design Lions, Prasoon Joshi for Entertainment Lions, Harshad Rajadhyaksha for Entertainment Lions for Music, and Murtuza Madraswala for Entertainment Lions for Sport. The lineup also features Harman Dhillon, Prasanth Kumar, Pallavi Chakravarti, Archana Jain, and Mayuresh Dubhashi across different categories.\n\nSimon Cook, CEO of LIONS, emphasized the jury's vital role in setting global benchmarks for creative excellence. Marian Brannelly, global director of Awards, noted that jury members come from 52 markets, including first-time representation from Ivory Coast and Kazakhstan, with the highest-ever representation from Africa, Asia and the Middle East.",
  "category": "Entertainment",
  "tags": [
    "advertising",
    "media",
    "awards",
    "creativity",
    "cannes lions",
    "india",
    "jury"
  ],
  "location": "Cannes, France",
  "source": {
    "title": "12 Indians on the Cannes Lions 2025 Awarding Jury line-up",
    "publication_date": 1744925185,
    "content": [
      {
        "title": "12 Indians on the Cannes Lions 2025 Awarding Jury line-up",
        "publication_date": "Unknown",
        "content": "0\n\nBy clicking the button, I accept theTerms of Use of the serviceand itsPrivacy Policy, as well as consent to the processing of personal data.\n\nDon’t have an account?Signup\n\nPowered by :\n\nFollow Us\n\nCannes Lions has today revealed the line-up of global experts selected to award the world's very best creative and effective work and benchmark excellence this June. Work from across the globe will be judged, awarded and celebrated during the Cannes Lions International Festival of Creativity, running from 16 to 20 June 2025.\n\n12 professionals from India’s advertising, media, and PR industries have been named to the Cannes Lions 2024 jury across various categories.\n\nRepresenting India on the global stage this year are:\n\nJosy Paul, chairperson and CCO, BBDO India, who will serve as jury president for the Sustainable Development Goals Lions.\n\nRussell Barrett, chief creative experience officer, TBWA\\India, joins the Brand Experience & Activation Lions jury.\n\nVikram Pandey, CCO at Leo, is part of the Creative Data Lions jury.\n\nMahima Mathur, creative director, DDB Mudra Group, will contribute to the Design Lions category.\n\nPrasoon Joshi, chairman APAC, McCann Worldgroup, sits on the Entertainment Lions jury.\n\nHarshad Rajadhyaksha, CCO, Ogilvy India, joins the Entertainment Lions for Music jury.\n\nMurtuza Madraswala, head of marketing, content and communications, NBA India, will evaluate entries for Entertainment Lions for Sport.\n\nHarman Dhillon, executive director - beauty and wellbeing, Hindustan Unilever, will be part of the Glass: The Lion for Change jury.\n\nPrasanth Kumar, CEO South Asia, GroupM, will judge the Media Lions category.\n\nPallavi Chakravarti, founder and CCO, Fundamental, will serve on the Outdoor Lions jury.\n\nArchana Jain, CEO, PR Pundit Havas Red, is on the PR Lions jury.\n\nMayuresh Dubhashi, CCO, FCB India, will judge entries in the Social & Creator Lions category.\n\nThese selections highlight India’s growing influence across creative, media, and communication disciplines on the global awards circuit.\n\nSimon Cook, CEO, LIONS, said: “The Cannes Lions Awarding Jury plays a vital role in setting the global benchmark for creative excellence. This year’s line-up brings together some of the most highly respected and accomplished industry talent from around the world. Their expertise will help define the creative standards that continue to drive our industry forward and spotlight the power of creativity as a catalyst for meaningful business growth and transformation.”\n\nMarian Brannelly, global director of Awards, LIONS, added: “The Awarding Jury comprises some of the most respected talent from across the global industry. This year, we’re welcoming Jury members from 52 markets, including first-time representation from Ivory Coast and Kazakhstan and our highest-ever representation from Africa, Asia and the Middle East. We’re delighted to bring such a breadth of voices and perspectives into the Jury rooms, and we thank all of our Jurors in advance for the dedication and care they bring to the process.”\n\nSubscribe to our Newsletter!\n\nShare this article\n\nIf you liked this article share it with your friends.they will thank you later"
      },
      {
        "title": "12 Indians on the Cannes Lions 2025 Awarding Jury line-up",
        "author": "afaqs! news bureau",
        "publication_date": "Unknown"
      }
    ],
    "authors": [],
    "source": "afaqs!",
    "image_url": "https://img-cdn.publive.online/fit-in/640x430/filters:format(webp)/afaqs/media/media_files/2025/04/18/nLzd4i59XBV89VWiJT6N.png",
    "url": "https://www.afaqs.com/news/advertising/12-indians-on-the-cannes-lions-2025-awarding-jury-line-up-8974393"
  },
  "markdown_content": "## Jury Announcement\\nCannes Lions has revealed the lineup of global experts selected to award the world's best creative and effective work this June. The Cannes Lions International Festival of Creativity will run from 16 to 20 June 2025.\\n\\n## Indian Representation\\n12 professionals from India's advertising, media, and PR industries have been named to the jury across various categories. Notable appointments include:\\n\\n* Josy Paul, chairperson and CCO of BBDO India, serving as jury president for the Sustainable Development Goals Lions\\n* Russell Barrett from TBWA\\India joins the Brand Experience & Activation Lions jury\\n* Vikram Pandey of Leo will judge Creative Data Lions\\n\\n## Additional Jury Members\\nOther prominent jury members include:\\n\\n* Mahima Mathur for Design Lions\\n* Prasoon Joshi for Entertainment Lions\\n* Harshad Rajadhyaksha for Entertainment Lions for Music\\n* Murtuza Madraswala for Entertainment Lions for Sport\\n* Harman Dhillon\\n* Prasanth Kumar\\n* Pallavi Chakravarti\\n* Archana Jain\\n* Mayuresh Dubhashi\\n\\n## Leadership Comments\\n> Simon Cook, CEO of LIONS, emphasized the jury's vital role in setting global benchmarks for creative excellence.\\n\\n> Marian Brannelly, global director of Awards, noted that jury members come from 52 markets, including first-time representation from Ivory Coast and Kazakhstan, with the highest-ever representation from Africa, Asia and the Middle East."
}