{
  "title": "Millions misdiagnosed for decades; Experts confirm Type 5 diabetes",
  "publication_date": "2025-04-18T07:46:01+00:00",
  "summary": "The International Diabetes Federation has officially recognized Type 5 diabetes, a form of the disease caused by long-term undernutrition affecting young, lean individuals in low-income countries. Unlike Types 1 and 2, this variant stems from chronic undernutrition beginning before birth. An estimated 20-25 million people worldwide are affected, many previously misdiagnosed.",
  "content": "The International Diabetes Federation (IDF) has officially recognised Type 5 diabetes, a form of the disease caused by long-term undernutrition, primarily affecting young, lean individuals in low-income countries.\n\nUnlike Type 1 and Type 2, this type is not caused by high sugar intake or insulin resistance. Instead, it stems from chronic undernutrition, often beginning before birth. This form of diabetes mainly affects young, lean individuals in low- and middle-income countries. Until now, many patients have been misdiagnosed, leaving them without proper care. Experts estimate that 20 to 25 million people worldwide are living with this condition.\n\nType 5 diabetes is caused by long-term undernutrition, particularly during pregnancy and early childhood. It affects people who are typically thin and may not respond well to standard diabetes treatments. In some cases, insulin treatment can be harmful, causing dangerously low blood sugar levels.\n\nThe roots of Type 5 diabetes lie in early life nutrition. Poor maternal nutrition can affect the baby's future metabolic health. This pattern is common in parts of Asia and Africa, where a long history of poverty, famine, and intense physical labour has led to intergenerational undernutrition.\n\nThere are still no global treatment guidelines for Type 5 diabetes. Standard insulin therapy is often unsafe for these patients. Early studies suggest a careful mix of low-dose insulin and oral medication, along with nutritional support, may be effective, but more research is needed. An international working group under the IDF is now developing formal treatment and diagnostic protocols, expected in the next two years.",
  "category": "Health",
  "tags": [
    "diabetes",
    "healthcare",
    "medical research",
    "nutrition",
    "global health",
    "poverty",
    "public health"
  ],
  "location": "Global",
  "source": {
    "title": "Millions misdiagnosed for decades; Experts confirm Type 5 diabetes",
    "publication_date": 1744938961,
    "content": [
      {
        "title": "Millions misdiagnosed for decades; Experts confirm Type 5 diabetes",
        "publication_date": "2025-04-18T07:46:01+00:00",
        "content": "ENGLISH\n\nMALAYALAM\n\nNEWSPAPER\n\nE-Paper\n\nThe International Diabetes Federation (IDF) has officially recognised Type 5 diabetes, a form of the disease caused by long-term undernutrition, primarily affecting young, lean individuals in low-income countries.\n\nIn a major step towards better global health understanding, the International Diabetes Federation (IDF) has officially recognised a new form of diabetes—Type 5 diabetes. Unlike the more familiar Type 1 and Type 2, this type is not caused by high sugar intake or insulin resistance. Instead, it stems from chronic undernutrition, often beginning before birth.\n\nThis form of diabetes mainly affects young, lean individuals in low- and middle-income countries. Until now, many patients have been misdiagnosed, leaving them without the proper care. Experts estimate that 20 to 25 million people worldwide are living with this condition.\n\nWhy type 5 diabetes is different\n\nAlthough the symptoms of Type 5 diabetes—such as fatigue, weight loss, and blurred vision—can look similar to other types, the underlying causes and responses to treatment are very different.\n\nType 1 diabetes is an autoimmune disease where the body stops producing insulin. It usually begins in childhood and requires lifelong insulin therapy.Type 2 diabetes is mostly linked to obesity and insulin resistance and is common in adults.Type 5 diabetes, however, is caused by long-term undernutrition, particularly during pregnancy and early childhood. It affects people who are typically thin and may not respond well to standard diabetes treatments. In some cases, insulin treatment can be harmful, causing dangerously low blood sugar levels.\n\nDr Meredith Hawkins, professor of medicine and founding director of the Global Diabetes Institute, explains:\n\n“These patients aren’t insulin resistant like in Type 2, nor do they benefit from insulin like in Type 1. Instead, their bodies have a severely reduced ability to produce insulin at all.”\n\nA disease that begins before birth\n\nThe roots of Type 5 diabetes lie in early life nutrition. According to Dr CS Yajnik of KEM Hospital, Pune, poor maternal nutrition can affect the baby’s future metabolic health.\n\n“If a baby is undernourished in the womb and continues to face nutritional challenges after birth, the risk of malnutrition-related diabetes increases,” he says.\n\nThis pattern is common in parts of Asia and Africa, where a long history of poverty, famine, and intense physical labour has led to intergenerational undernutrition. And while some sections of society are now experiencing overnutrition due to urbanisation, large numbers of people continue to live with nutritional deficiencies.\n\nWhy this recognition matters\n\nFor decades, people living with this form of diabetes were either misdiagnosed or left untreated, as it didn’t fit the usual profiles of Type 1 or 2. Now that the IDF has formally classified Type 5 diabetes, it opens the door to better diagnosis, targeted treatments, and health policy reforms in affected countries.\n\nDr Peter Schwarz, President of the IDF, said:\n\n“For too long, this condition has gone unrecognised, affecting millions of people and depriving them of access to adapted care.”\n\nChallenges in treatment\n\nThere are still no global treatment guidelines for Type 5 diabetes. Standard insulin therapy is often unsafe for these patients. Early studies suggest a careful mix of low-dose insulin and oral medication, along with nutritional support, may be effective—but more research is needed.\n\nDr Hawkins believes diets higher in protein and essential micronutrients, and lower in carbohydrates, might help—but these approaches are difficult to implement in resource-poor areas.\n\nAn international working group under the IDF is now developing formal treatment and diagnostic protocols, expected in the next two years.\n\nA wake-up call for global health\n\nThe recognition of Type 5 diabetes highlights a major blind spot in how global health systems have addressed diabetes so far. It also shows how poverty and malnutrition can shape lifelong health in ways science is only beginning to understand.\n\nEven though treatment options remain limited, this recognition is an important first step in addressing a hidden health crisis affecting some of the world’s most vulnerable populations.\n\n3 min\n\nLifestyle\n\nHealth\n\nApr 14, 2025\n\n2 min\n\nLifestyle\n\nHealth\n\nApr 12, 2025\n\n2 min\n\nLifestyle\n\nLifestyle\n\nApr 9, 2025\n\n3 min\n\nLifestyle\n\nTravel\n\nApr 3, 2025\n\n2 min\n\nLifestyle\n\nHealth\n\nSep 26, 2024\n\n3 min\n\nLifestyle\n\nHealth\n\nApr 16, 2025\n\n3 min\n\nLifestyle\n\nHealth\n\nApr 16, 2025\n\n1 min\n\nLifestyle\n\nHealth\n\nMar 21, 2025\n\n3 min\n\n2 min\n\n3 min\n\n3 min\n\nNews\n\nKerala\n\n2 min\n\nMovies & Music\n\nNews\n\n3 min\n\nMovies & Music\n\nNews\n\n2 min\n\n+\n\n-\n\n+\n\n-\n\n+\n\n-\n\n+\n\n-\n\n+\n\n-\n\n+\n\n-\n\n+\n\n-\n\n+\n\n-\n\nClick on ‘Get News Alerts’ to get the latest news alerts from"
      },
      {
        "title": "Millions misdiagnosed for decades; Experts confirm Type 5 diabetes",
        "author": "Unknown Author",
        "publication_date": "2025-04-18T07:46:01+00:00"
      }
    ],
    "authors": [],
    "source": "Mathrubhumi English",
    "image_url": "https://english.mathrubhumi.com/image/contentid/policy:1.10519903:1744958205/diabetes.jpg?$p=6f0988d&f=1x1&w=1080&q=0.8",
    "url": "https://english.mathrubhumi.com/lifestyle/health/type-5-diabetes-global-health-crisis-1.10519899"
  },
  "markdown_content": "## New Classification in Diabetes Research\\n\\nThe International Diabetes Federation (IDF) has officially recognised Type 5 diabetes, a form of the disease caused by long-term undernutrition, primarily affecting young, lean individuals in low-income countries.\\n\\nUnlike Type 1 and Type 2, this type is not caused by high sugar intake or insulin resistance. Instead, it stems from chronic undernutrition, often beginning before birth. This form of diabetes mainly affects young, lean individuals in low- and middle-income countries. Until now, many patients have been misdiagnosed, leaving them without proper care. Experts estimate that 20 to 25 million people worldwide are living with this condition.\\n\\n## Characteristics and Causes\\n\\nType 5 diabetes is caused by long-term undernutrition, particularly during pregnancy and early childhood. It affects people who are typically thin and may not respond well to standard diabetes treatments. In some cases, insulin treatment can be harmful, causing dangerously low blood sugar levels.\\n\\n## Origins and Impact\\n\\nThe roots of Type 5 diabetes lie in early life nutrition. Poor maternal nutrition can affect the baby's future metabolic health. This pattern is common in parts of Asia and Africa, where a long history of poverty, famine, and intense physical labour has led to intergenerational undernutrition.\\n\\n## Treatment Challenges\\n\\nThere are still no global treatment guidelines for Type 5 diabetes. Standard insulin therapy is often unsafe for these patients. Early studies suggest a careful mix of low-dose insulin and oral medication, along with nutritional support, may be effective, but more research is needed. An international working group under the IDF is now developing formal treatment and diagnostic protocols, expected in the next two years."
}