{
  "title": "Shin Si Ah Impresses In Her Role As A First-Year Obstetrics And Gynecology Resident In \"Resident Playbook\"",
  "publication_date": "2025-04-18T02:02:20+00:00",
  "summary": "Shin Si Ah delivers a compelling performance as Pyo Nam Kyung, a first-year obstetrics and gynecology resident in tvN's \"Resident Playbook\", a spin-off of \"Hospital Playlist\". Her portrayal of the character's complex personality and emotional journey has earned praise from viewers.",
  "content": "Shin Si Ah is gaining recognition for her performance in \"Resident Playbook\", a tvN drama spin-off of \"Hospital Playlist\". The series follows the lives, growth, and friendships of residents at Yulje Medical Center's Jongro branch.\n\nIn her role as Pyo Nam Kyung, a first-year obstetrics and gynecology resident, Shin Si Ah portrays a character who appears smart and assertive but also shows vulnerability and clumsiness. Her natural portrayal of these complex characteristics has resonated with viewers.\n\nA standout moment includes her character's first day at the medical center, where she demonstrates strong chemistry with Oh Yi Young. Another notable scene involves a case of mistaken pregnancy diagnosis by Um Jae Il, which showcases Shin Si Ah's acting prowess.\n\nThe actress particularly excels in emotional scenes, such as when her character experiences intense anxiety believing a patient has died, followed by tears of relief upon discovering otherwise. Her realistic depiction of a first-year resident's exhaustion and emotional challenges has earned praise.\n\nThe series continues with its next episode scheduled to air on April 19 at 9:20 p.m. KST.",
  "category": "Entertainment",
  "tags": [
    "television",
    "korean drama",
    "acting",
    "medical drama",
    "tvN",
    "Shin Si Ah"
  ],
  "location": "South Korea",
  "source": {
    "title": "Shin Si Ah Impresses In Her Role As A First-Year Obstetrics And Gynecology Resident In “Resident Playbook”",
    "publication_date": 1744922180,
    "content": [
      {
        "title": "Shin Si Ah Impresses In Her Role As A First-Year Obstetrics And Gynecology Resident In “Resident Playbook” | Soompi",
        "publication_date": "2025-04-18T02:02:20+00:00",
        "content": "Shin Si Ah is impressing viewers with her performance in “Resident Playbook”!\n\nA spin-off of the hit series “Hospital Playlist,” tvN’s “Resident Playbook” is a new drama depicting the realistic and relatable hospital lives, growth, and heartwarming friendships of residents at the Jongro branch of Yulje Medical Center.\n\nShin Si Ah plays Pyo Nam Kyung, a first-year obstetrics and gynecology resident. At first glance, Pyo Nam Kyung appears smart and assertive, but she also goes through emotional ups and downs and has a clumsy side that makes her more relatable. Shin Si Ah portrays these complex aspects of Pyo Nam Kyung’s personality naturally and without exaggeration, delivering a performance that impresses viewers.\n\nOne of Pyo Nam Kyung’s most memorable scenes is her first day at Yulje Medical Center, where she shows great chemistry with Oh Yi Young (Go Youn Jung). But it was the episode where Um Jae Il (Kang You Seok) mistakes patient Yeom Mi So (Hyun Jin) for a pregnant woman that truly highlighted Shin Si Ah’s acting skills.\n\nWhen the attending physician for patient Yeom Mi So changes from Um Jae Il to Pyo Nam Kyung, she is thrown into a difficult routine, dealing with numerous tasks and the demanding needs of the patient. Shin Si Ah convincingly portrays Pyo Nam Kyung’s exhaustion as her workload piles up, realistically capturing the fatigue of a first-year resident.\n\nIn particular, in a scene where Pyo Nam Kyung mistakenly believes that Yeom Mi So has passed away and is filled with anxiety, only to shed tears of relief after confirming she’s alive, Shin Si Ah brilliantly conveys the character’s emotional shift, deeply moving viewers. Viewers are eagerly anticipating how her character will grow and evolve emotionally in the future.\n\nThe next episode of “Resident Playbook” will air on April 19 at 9:20 p.m. KST!\n\nSource (1)"
      },
      {
        "title": "Shin Si Ah Impresses In Her Role As A First-Year Obstetrics And Gynecology Resident In “Resident Playbook” | Soompi",
        "author": "cupid001",
        "publication_date": "2025-04-18T02:02:20+00:00"
      }
    ],
    "authors": [],
    "source": "Soompi",
    "image_url": "https://6.soompi.io/wp-content/uploads/image/20250417062947_shin-si-ah-2.jpg?s=900x600&e=t",
    "url": "https://www.soompi.com/article/1737675wpp/shin-si-ah-impresses-in-her-role-as-a-first-year-obstetrics-and-gynecology-resident-in-resident-playbook"
  },
  "markdown_content": "## Rising Star Performance\\nShin Si Ah is gaining recognition for her performance in \"Resident Playbook,\" a tvN drama spin-off of \"Hospital Playlist.\" The series follows the lives, growth, and friendships of residents at Yulje Medical Center's Jongro branch.\\n\\nIn her role as Pyo Nam Kyung, a first-year obstetrics and gynecology resident, Shin Si Ah portrays a character who appears smart and assertive but also shows vulnerability and clumsiness. Her natural portrayal of these complex characteristics has resonated with viewers.\\n\\n## Notable Scenes\\n* Her character's first day at the medical center, where she demonstrates strong chemistry with Oh Yi Young\\n* A case of mistaken pregnancy diagnosis by Um Jae Il, which showcases Shin Si Ah's acting prowess\\n\\n## Emotional Range\\nThe actress particularly excels in emotional scenes, such as when her character experiences intense anxiety believing a patient has died, followed by tears of relief upon discovering otherwise. Her realistic depiction of a first-year resident's exhaustion and emotional challenges has earned praise.\\n\\nThe series continues with its next episode scheduled to air on April 19 at 9:20 p.m. KST."
}