{
  "title": "Kochi police to interrogate Shine Tom Chacko tomorrow",
  "publication_date": "2025-04-18T17:10:00Z",
  "summary": "Malayalam actor Shine Tom Chacko will be interrogated by Kochi police regarding his dramatic escape from a hotel during an anti-narcotics raid. The actor allegedly fled through a third-floor window during a DANSAF raid at a Kaloor hotel. He's also facing allegations of misbehaving with a woman actor and was recently acquitted in a cocaine case.",
  "content": "Malayalam actor Shine Tom Chacko is set to face police interrogation over his escape from a hotel during a raid conducted by the District Anti-Narcotics Special Action Force (DANSAF). The Ernakulam North Police will summon the actor for questioning on Saturday at 10 am, with a team led by Central Assistant Commissioner of Police C Jayakumar conducting the interrogation.\n\nThe actor, currently in Tamil Nadu, will be questioned about his sudden exit from a Kaloor hotel during a DANSAF raid on April 16. CCTV footage reportedly shows Shine fleeing from the third floor, escaping through a window onto a sheet covering the floor below, then jumping into the swimming pool before departing on a passing motorcycle.\n\nIn addition to this incident, Shine faces allegations of misbehaving with actress Vincy Aloshious under the influence of drugs. His father, CP Chacko, has confirmed that the actor will cooperate with both this investigation and appear before the internal committee of the Soothravakkyam movie.\n\nMeanwhile, prosecutors plan to appeal the Ernakulam Additional Sessions Court's decision to acquit Shine in a cocaine case, which was Kerala's first reported cocaine case. The acquittal came after the prosecution failed to produce sufficient evidence against the actor and other accused parties.",
  "category": "Entertainment",
  "tags": [
    "crime",
    "entertainment",
    "bollywood",
    "drugs",
    "police",
    "legal",
    "Malayalam cinema"
  ],
  "location": "Kochi, Kerala, India",
  "source": {
    "title": "Kochi police to interrogate Shine Tom Chacko tomorrow",
    "publication_date": 1744956717,
    "content": [
      {
        "title": "Kochi police to interrogate Shine Tom Chacko today",
        "publication_date": "Unknown",
        "content": "Follow Whatsapp Channel\n\nOnmanorama Staff\n\nPublished: April 18 , 2025 05:10 PM ISTUpdated: April 19, 2025 07:06 AM IST\n\n2 minuteRead\n\nLink Copied\n\nKochi: Malayalam actor Shine Tom Chacko, who is facing allegations of misbehaving with a woman actor under the influence of drugs, has landed in fresh trouble as the Kochi police have decided to interrogate him over his dramatic escape from a hotel during a raid conducted by the District Anti-Narcotics Special Action Force (DANSAF).\n\nManorama News reported that the Ernakulam North Police will issue a summons to the actor, asking him to appear for an interrogation on Saturday at 10 am. A police team led by the Central Assistant Commissioner of Police, C Jayakumar, will question him at the North Police Station. Since the actor is currently in Tamil Nadu, the police handed over the notice to his parents in Thrissur.\n\nShine's father told reporters that the actor would appear before the Ernakulam North Police Station at 3 pm, adding that he was currently not at home but had informed the police that he would turn up at the scheduled time.\n\nAccording to reports, the police decided to summon the actor based on a report filed by DANSAF. Officials are expected to seek clarification from Shine regarding his sudden exit from the hotel during the raid. On the night of April 16, DANSAF raided a hotel in Kaloor as part of an ongoing crackdown on drug abuse. CCTV footage from the hotel reportedly shows Shine fleeing from the third floor when the DANSAF team began the raid. He is said to have evaded the police by escaping through a window.\n\nInvestigators stated that Shine jumped out of a third-floor window onto a sheet covering the floor below upon noticing the police presence. According to a PTI report, the sheet reportedly broke on impact, after which he leapt into the swimming pool and exited through the staircase. It is believed he fled the hotel premises by taking a lift on a passing bike.\n\nMeanwhile, Shine’s father, CP Chacko, told Manorama News that the actor will cooperate with the investigation into the misconduct allegations raised by his co-actor, Vincy Aloshious. He added that Shine will also appear before the internal committee of the Soothravakkyam movie on April 21.\n\nAmid this, the prosecution is planning to move an appeal in the High Court against the Ernakulam Additional Sessions Court’s order acquitting Shine in a cocaine case. The court acquitted the actor and the other accused in the case, citing that the probe team and prosecution failed to produce sufficient evidence to prove the charges. The case registered under the Narcotic Drugs and Psychotropic Substances (NDPS) Act, 1985, by Kochi police was the first cocaine case reported in Kerala. The other accused in the case are- Reshma Rangaswamy, Blessy Silverster, Tincy Babu, Sneha Babu, Okowe Chigozie Collins, Prithviraj and Jasbir Singh.\n\n© Copyright 2025 Onmanorama.  All rights reserved."
      },
      {
        "title": "Kochi police to interrogate Shine Tom Chacko today",
        "author": "Unknown Author",
        "publication_date": "Unknown"
      }
    ],
    "authors": [],
    "source": "Onmanorama",
    "image_url": "https://img.onmanorama.com/content/dam/mm/en/kerala/top-news/images/2025/4/17/actor-shine-tom-cctv-footage.jpg?w=1120&h=583",
    "url": "https://www.onmanorama.com/news/kerala/2025/04/18/shine-tom-chacko-summoned-for-interrogation-in-drug-raid-incident.html"
  },
  "markdown_content": "## Police Investigation Update\\nMalayalam actor Shine Tom Chacko is set to face police interrogation over his escape from a hotel during a raid conducted by the District Anti-Narcotics Special Action Force (DANSAF). The Ernakulam North Police will summon the actor for questioning on Saturday at 10 am, with a team led by Central Assistant Commissioner of Police C Jayakumar conducting the interrogation.\\n\\n## Incident Details\\nThe actor, currently in Tamil Nadu, will be questioned about his sudden exit from a Kaloor hotel during a DANSAF raid on April 16. CCTV footage reportedly shows Shine fleeing from the third floor, escaping through a window onto a sheet covering the floor below, then jumping into the swimming pool before departing on a passing motorcycle.\\n\\n## Additional Allegations\\nIn addition to this incident, Shine faces allegations of misbehaving with actress Vincy Aloshious under the influence of drugs. His father, CP Chacko, has confirmed that the actor will cooperate with both this investigation and appear before the internal committee of the Soothravakkyam movie.\\n\\n## Legal Proceedings\\nMeanwhile, prosecutors plan to appeal the Ernakulam Additional Sessions Court's decision to acquit Shine in a cocaine case, which was Kerala's first reported cocaine case. The acquittal came after the prosecution failed to produce sufficient evidence against the actor and other accused parties."
}