{
  "title": "Appendix Removal With Therapy May Help Maintain UC Remission",
  "publication_date": "2025-04-18T00:00:00Z",
  "summary": "A study shows that ulcerative colitis patients in remission who underwent laparoscopic appendicectomy combined with standard medical therapy experienced lower relapse rates after one year compared to those receiving standard treatment alone. The research, led by Dr. Eva Visser from the University of Amsterdam, suggests the appendix could be a therapeutic target for UC treatment.",
  "content": "Among patients with ulcerative colitis in remission who had been treated for a disease relapse, those who underwent laparoscopic appendicectomy combined with standard medical therapy had lower relapse rates at 1 year than those who received standard treatment alone.\n\nResearchers concluded that appendicectomy is a viable and safe strategy for reducing ulcerative colitis relapse rates compared with standard medical therapy at 1 year, offering a potential addition to standard medical therapies.\n\nThe study, led by Eva Visser, MD, from the University of Amsterdam, was published online in The Lancet Gastroenterology & Hepatology. The findings suggest that the appendix might not only influence ulcerative colitis inflammation but could also serve as a therapeutic target.\n\nHowever, the study had limitations, including the absence of a sham-surgery control group and potential participation bias, as only patients willing to undergo additional surgery were included. Not all patients received follow-up endoscopy to objectively determine relapse.\n\nThe research was funded by Fonds Nuts-Ohra and the National Institute for Health Research (NIHR) Efficacy and Mechanism Evaluation.",
  "category": "Health",
  "tags": [
    "medical research",
    "surgery",
    "ulcerative colitis",
    "gastroenterology",
    "clinical trials",
    "appendicectomy"
  ],
  "location": "Amsterdam, Netherlands",
  "source": {
    "title": "Appendix Removal With Therapy May Help Maintain UC Remission",
    "publication_date": 1744957821,
    "content": [
      {
        "title": "Appendix Removal With Therapy May Help Maintain UC Remission",
        "publication_date": "Unknown",
        "content": "April 18, 2025\n\nAmong patients withulcerative colitisin remission who had been treated for a disease relapse, those who underwent laparoscopicappendicectomycombined with standard medical therapy had lower relapse rates at 1 year than those who received standard treatment alone.\n\n\"Appendicectomy is a viable and safe strategy for reducing the relapse rate in patients with ulcerative colitis compared with standard medical therapy at 1 year, offering a potential addition to standard medical therapies,\" the authors concluded.\n\n\"These findings suggest that the appendix might not only influence ulcerative colitis inflammation but could also serve as a therapeutic target,\" authors of anaccompanying commentarywrote.\n\nThis study, led by Eva Visser, MD, from the University of Amsterdam, Amsterdam, the Netherlands, waspublished onlineon April 11, 2025, inThe Lancet Gastroenterology & Hepatology.\n\nThe absence of a sham-surgery control group may have introduced bias in the readouts of health-related quality-of-life measurements. Participation bias may have been present, as only patients in remission who were willing to undergo an additional surgery were included. Not all patients received follow-up endoscopy to objectively determine relapse.\n\nThis study was funded by Fonds Nuts-Ohra and the National Institute for Health Research (NIHR) Efficacy and Mechanism Evaluation. Several authors reported receiving speaker fees, presentation or lecture fees, research funding, travel support, or honoraria from multiple agencies, including pharmaceutical and healthcare companies, as well as the NIHR. Additionally, some authors reported serving on advisory boards for these agencies.\n\nThis article was created using several editorial tools, including AI, as part of the process. Human editors reviewed this content before publication.\n\nSend comments and news tips touknewsdesk@medscape.co.uk.\n\nACCURE Study Group. Appendicectomy plus standard medical therapy versus standard medical therapy alone for maintenance of remission in ulcerative colitis (ACCURE): A pragmatic, open-label, international, randomised trial. Lancet Gastroenterol Hepatol. Published online April 11, 2025. doi:10.1016/S2468-1253(25)00026-3"
      },
      {
        "title": "Appendix Removal With Therapy May Help Maintain UC Remission",
        "author": "Unknown Author",
        "publication_date": "Unknown"
      }
    ],
    "authors": [],
    "source": "Medscape",
    "image_url": "https://img.medscapestatic.com/vim/live/professional_assets/medscape/images/thumbnail_library/gty_250515_appendix_removal_800x450.jpg",
    "url": "https://www.medscape.com/viewarticle/appendix-removal-may-aid-remission-maintenance-uc-2025a100092k"
  },
  "markdown_content": "## Study Findings\\nPatients with ulcerative colitis in remission who underwent laparoscopic appendicectomy combined with standard medical therapy showed lower relapse rates at 1 year compared to those receiving standard treatment alone.\\n\\nResearchers concluded that appendicectomy provides a safe and viable approach to reducing ulcerative colitis relapse rates, potentially complementing existing standard medical therapies.\\n\\n## Research Details\\nThe study, led by Eva Visser, MD, from the University of Amsterdam, was published online in The Lancet Gastroenterology & Hepatology. The findings indicate that the appendix may not only influence ulcerative colitis inflammation but could also serve as a therapeutic target.\\n\\n## Limitations\\n* Absence of a sham-surgery control group\\n* Potential participation bias, as study only included patients willing to undergo additional surgery\\n* Not all patients received follow-up endoscopy to objectively determine relapse\\n\\n## Funding\\nResearch was supported by Fonds Nuts-Ohra and the National Institute for Health Research (NIHR) Efficacy and Mechanism Evaluation."
}