{
  "title": "Donald Trump says US will strike 'very good' trade deal with China as countries line up to negotiate tariffs",
  "publication_date": "2025-04-17T19:29:19+00:00",
  "summary": "Donald Trump expressed confidence in reaching a 'very good' trade deal with China amid ongoing tariff disputes. While several Asian countries including Japan, Vietnam, and Taiwan have begun negotiations with the US over tariffs, China remains notably absent from discussions. The US has imposed tariffs up to 245% on Chinese goods, while Beijing has retaliated with 125% tariffs on US imports.",
  "content": "The US will strike a \"very good\" trade deal with China, Donald Trump says, as both countries remain locked in a tariff war.\n\nSeveral Asian countries have started negotiations with the US over his levy policy but despite facing the highest tariffs China has not. A White House website page states that some Chinese goods face a 245 per cent tariff in the US. Beijing has slapped a 125 per cent tariff on US imports.\n\nTrump made the comments while meeting with Italian Prime Minister Giorgia Meloni in Washington. Earlier, he reported \"big progress\" in negotiations with Japan after meeting with their trade delegation.\n\nWhile Asia's major exporters including Japan, Vietnam and Taiwan open discussions with the Trump administration, China remains notably absent. Chinese President Xi Jinping has instead spent the week in South-East Asia, rallying support from neighboring countries amid the tariff war.\n\nJapan faces an additional 24% tariff plus an existing 25% automobile tax, affecting their crucial US export market. Vietnam, dealing with potential 46% duties, has offered to purchase more US products including defense equipment. Taiwan is negotiating to protect against tariffs up to 35%, particularly concerned about their semiconductor exports.\n\nOther nations including South Korea, Indonesia, Thailand, Singapore and Australia are also engaging in various stages of negotiation with the US administration to address tariff concerns.\n\nChina's commerce ministry spokesperson He Yongqian maintained that \"the unilateral tariff increases were entirely initiated by the United States,\" suggesting little appetite for immediate negotiations.",
  "category": "Business",
  "tags": [
    "trade",
    "tariffs",
    "international relations",
    "Donald Trump",
    "China",
    "economics",
    "diplomacy",
    "Asia"
  ],
  "location": "Washington, United States",
  "source": {
    "title": "Donald Trump says US will strike 'very good' trade deal with China as countries line up to negotiate tariffs",
    "publication_date": 1744898359,
    "content": [
      {
        "title": "Trump says 'very good' trade deal will be made with China",
        "publication_date": "2025-04-17T19:29:19+00:00",
        "content": "Search the news, stories & people\n\nPersonalise the news and\n\nstay in the know\n\nEmergency\n\nBackstory\n\nNewsletters\n\n中文新闻\n\nBERITA BAHASA INDONESIA\n\nTOK PISIN\n\nTopic:Trade\n\nDonald Trump has met with Japan as countries around the world begin negotations over his tariff policy.(Reuters: Kevin Lamarque, file photo)\n\nThe US will strike a \"very good\" trade deal with China, Donald Trump says.\n\nThe US president's comments came after a post which indicated Beijing was keen to meet to discuss American tariffs on Chinese goods.\n\nSeveral other Asian countries have begun similar negotiations to try and avoid President Trump's tariff regime.\n\nDonald Trump says the US will strike a \"very good\" trade deal with China, as both countries remain locked in a tariff war.\n\nSeveral Asian countries have started negotiations with the US over his levy policy but despite facing the highest tariffs China has not.\n\nA White House website page states that some Chinese goods face a245 per cent tariff in the US.\n\nBeijing has slapped a 125 per cent tariff on US imports.\n\n\"I think we're going to make a very good deal with China,\" he said at the White House on Thursday, US time, sitting opposite Italian Prime Minister Giorgia Meloni who was in Washington for talks on tariffs.\n\nEarlier, the US president said \"big progress\" had been made in negotiations with Japan on tariffs, after he met with the country's trade delegation this week.\n\nHe provided no further detail about how close a trade deal may or may not be with Tokyo and later added he was in \"no rush\" to announce deals.\n\n\"A Great Honor (sic) to have just met with the Japanese Delegation on Trade. Big Progress!\" President Trump posted on social media.\n\nA photo of Japan's lead trade negotiator Ryosei Akazawa and Donald Trump at the White House was posted on X shortly after the meeting.(X: The White House)\n\nWhile Asia's major exporters to the US, including Japan, Vietnam and Taiwan open discussions with the Trump administration on tariffs, China is notably absent from the offices of the White House.\n\nEarlier on Thursday, he posted on social media that China \"wants to meet!\", despite Beijing showing no signs it wants to negotiate.\n\nChina's President Xi Jinpinghas spent the week in South-East Asia, trying to rally support from neighbouring countries amid the tariff war.\n\nPresident Xi arrived in Cambodia on Thursday and said Cambodia should oppose \"hegemonism\" and \"protectionism\", echoing similar sentiments expressed in Malaysia and Vietnam earlier in the week.\n\nThe US has said it was up to China to start negotiations, but that did not look likely.\n\n\"The unilateral tariff increases were entirely initiated by the United States,\" He Yongqian, a Chinese commerce ministry spokesperson, told a weekly news conference.\n\nMs He, quoting an old Chinese proverb said, \"the person who tied the bell must be the one who unties it\".\n\nWhile the trade war continues between the US and China, here's what we know about other countries at the negotiating table with the Trump administration.\n\nJapanese negotiatorRyosei Akazawa met President Trump, Mr Greer and US Treasury Secretary Scott Bessent in Washington on Wednesday, US time, with no detailed progress report detailed by either side.\n\nA second meeting is scheduled for the end of April.\n\n\"The discussions ahead will not be easy, but the US president has expressed his willingness to give the highest priority to negotiations with Japan,\" Prime Minister Shigeru Ishiba has said, adding that he was ready to meet President Trump himself.\n\nJapan's car industry is heavily reliant on the US market, with tariffs causing deep concerns for the future of its export market.(Reuters: Issei Kato, file photo)\n\nA close ally of Washington and the leading source of foreign investment in the United States, Japan faces an additional 24 per cent tariff on its exports as well as an existing 25 per cent automobile tax.\n\nAutomobiles accounted for about 28 per cent of Japanese exports to the United States last year.\n\nJapan's Finance Minister Katsunobu Kato told Reuters he was \"deeply concerned\" about the global economic fall-out from the tariff chaos, saying they could have significant impacts on the country's economy.\n\nVietnam didn't wait for President Trump to announce a 90-day pause on tariffs above 10 per cent to start discussions.\n\nThe timing of his tour through South-East Asia couldn't be better for Xi, who is trying to court as many countries as possible to form a united diplomatic front against Trump's tariffs.\n\nDeputy Prime Minister Ho Duc Phoc had already been in Washington for several days before the start of the pause, meeting US Trade Representative Jamieson Greer.\n\nThreatened with additional import duties of 46 per cent, Hanoi said it wanted to buy more US products, including defence equipment.\n\nThe South-East Asian manufacturing powerhouse has the fourth-largest trade surplus with the United States, coming in at $123.5 billion ($193b) in 2024.\n\nTo reach a compromise, Hanoi may have to overcome Washington's suspicion that Vietnam is helping China circumvent US tariffs.\n\nTaiwan said it held an initial video conference with US officials on April 11.\n\nPresident Lai Ching-te said the island, which hopes to protect its exporters from tariffs of up to 35 per cent, was \"on the US government's first negotiation list\".\n\nAfter the Trump administration exempted smartphones and semiconductors from tariffs, the president backtracked and warned no one was \"getting off the hook\".\n\nWashington is the main guarantor of Taiwan's security in the face of China, which claims the island democracy as its own.\n\nPresident Trump has not hesitated to link Washington's security relations with Taipei to the trade issue.\n\nAbout 60 per cent of Taiwan's exports to the United States are tech products, such as semiconductors.\n\nUnder pressure, top Taiwanese chip maker TSMC has unveiled plans to invest a further $US100 billion ($156 billion) in the United States.\n\n\"We will strive for a fair and competitive tariff for our industry,\" Taiwan's Economy Minister Kuo Jyh-huei said this week.\n\nSeoul has announced billions in dollars of aid for its semiconductor and automobile companies as a buffer against the tariffs.\n\nHowever, South Korea is also counting on talks, with Finance Minister Choi Sang-mok set to meet US Treasury Secretary Scott Bessent next week.\n\nKim Dae-jong, an economics expert at South Korea's Sejong University, said Seoul would need to \"expand trade centred on the US and reduce our reliance on exports to China to less than half of current levels\" to try and appease the Trump administration.\n\nIndonesia's Economy Minister Airlangga Hartarto is leading a week-long trade delegation to the United States that started on Wednesday.\n\nChinese factories are trying to sell directly to American consumers on social media platforms in a bid to bypass the 145 per cent tariff hike imposed by Donald Trump.\n\nJakarta, which is threatened with 32 per cent duties, plans to boost purchases of US products such as hydrocarbons to reduce its $17.9 billion ($28.3b) surplus with Washington.\n\nThailand's Finance Minister Pichai Chunhavajira is travelling to Washington from Thursday, with Bangkok poised to commit to buying more US agricultural and energy products.\n\nThai Prime Minister Paetongtarn Shinawatra said on Thursday that Bangkok has \"strong offers\" that Mr Chunhavajira will raise during negotiations on April 23.\n\nSingapore's Deputy Prime Minister Gan Kim Yong, said he spoke with Mr Greer, the US trade representative, on April 15 to explain the city-state's \"unique status as a small open economy\".\n\n\"We just have to explain this and continue to explain this, and hopefully the US will better understand our situation,\" Mr Gan said. \"We do have a trade deficit with the US.\"\n\nIn Australia, Prime Minister Anthony Albanese said Canberra had made a proposal to the United States.\n\n\"We'll engage diplomatically,\" he said during theABC leaders debatewith opposition leader Peter Dutton.\n\nHe vowed to defend Australia's national interests in the face of the 10 per cent tariff in place.\n\nABC/wires\n\nTopic:Drownings\n\nTopic:Federal Government\n\nTopic:Housing Policy\n\nTopic:Elections\n\nTopic:World Politics\n\nTopic:Tariffs\n\nTopic:Tariffs\n\nTopic:Air Transport Industry\n\nAsia\n\nIndonesia\n\nJapan\n\nKorea, Republic Of\n\nSingapore\n\nTaiwan\n\nTariffs\n\nThailand\n\nTrade\n\nTrade Agreements\n\nUnited States\n\nTopic:Drownings\n\nTopic:Federal Government\n\nTopic:Housing Policy\n\nTopic:Elections\n\nTopic:World Politics\n\nTopic:World Politics\n\nTopic:Science and Technology\n\nTopic:Drownings\n\nTopic:A-League Women\n\nWe acknowledge Aboriginal and Torres Strait Islander peoples as the First Australians and Traditional Custodians of the lands where we live, learn, and work.\n\nThis service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced.\n\nAEST= Australian Eastern Standard Time which is 10 hours ahead of GMT (Greenwich Mean Time)"
      },
      {
        "title": "Trump says 'very good' trade deal will be made with China",
        "author": "Unknown Author",
        "publication_date": "2025-04-17T19:29:19+00:00"
      }
    ],
    "authors": [
      "Patrick Martin"
    ],
    "source": "Australian Broadcasting Corporation",
    "image_url": "https://live-production.wcms.abc-cdn.net.au/da447953765f2223a6c4d08161b03792?impolicy=wcms_crop_resize&cropH=2421&cropW=4304&xPos=0&yPos=221&width=862&height=485",
    "url": "https://www.abc.net.au/news/2025-04-18/donald-trump-says-us-will-make-very-good-trade-deal-with-china/105190570"
  },
  "markdown_content": "## Trade Relations Update\\n\\nThe US will strike a \"very good\" trade deal with China, Donald Trump says, as both countries remain locked in a tariff war.\\n\\nSeveral Asian countries have started negotiations with the US over his levy policy but despite facing the highest tariffs China has not. A White House website page states that some Chinese goods face a 245 per cent tariff in the US. Beijing has slapped a 125 per cent tariff on US imports.\\n\\n## Diplomatic Developments\\n\\nTrump made the comments while meeting with Italian Prime Minister Giorgia Meloni in Washington. Earlier, he reported \"big progress\" in negotiations with Japan after meeting with their trade delegation.\\n\\nWhile Asia's major exporters including Japan, Vietnam and Taiwan open discussions with the Trump administration, China remains notably absent. Chinese President Xi Jinping has instead spent the week in South-East Asia, rallying support from neighboring countries amid the tariff war.\\n\\n## Current Tariff Situation\\n\\n* Japan faces an additional 24% tariff plus an existing 25% automobile tax, affecting their crucial US export market\\n* Vietnam, dealing with potential 46% duties, has offered to purchase more US products including defense equipment\\n* Taiwan is negotiating to protect against tariffs up to 35%, particularly concerned about their semiconductor exports\\n\\nOther nations including South Korea, Indonesia, Thailand, Singapore and Australia are also engaging in various stages of negotiation with the US administration to address tariff concerns.\\n\\n## Chinese Response\\n\\n> \"The unilateral tariff increases were entirely initiated by the United States,\" maintained He Yongqian, China's commerce ministry spokesperson, suggesting little appetite for immediate negotiations."
}