{
  "title": "Occurrence of Paraneoplastic Syndrome in Bronchogenic Carcinoma Patients in a Tertiary Care Centre in Chennai",
  "publication_date": "2025-03-17T14:28:22Z",
  "summary": "A medical study conducted at a tertiary care center in Chennai examining the occurrence of paraneoplastic syndrome in patients with bronchogenic carcinoma. The study appears to be a clinical investigation focused on understanding the relationship between these conditions.",
  "content": "The study investigates the occurrence of paraneoplastic syndrome among patients diagnosed with bronchogenic carcinoma at a tertiary care facility in Chennai. While the complete content details are not provided in the source material, the research appears to be a clinical investigation examining the correlation between bronchogenic carcinoma and associated paraneoplastic syndromes. The study was conducted in a healthcare setting specializing in advanced medical care and treatment.\n\nThe research aims to contribute to the understanding of paraneoplastic manifestations in lung cancer patients, which could potentially aid in early diagnosis and improved patient care.",
  "category": "Health",
  "tags": [
    "medical research",
    "oncology",
    "lung cancer",
    "paraneoplastic syndrome",
    "clinical study",
    "healthcare"
  ],
  "location": "Chennai, India",
  "source": {
    "title": "Occurrence of Paraneoplastic Syndrome in Bronchogenic Carcinoma Patients in a Tertiary Care Centre in Chennai",
    "publication_date": 1744874902,
    "content": [
      {
        "title": "Clinical and Radiological Significance of Anatomical Variations in Paranasal Sinuses: A Retrospective CT-Based Study",
        "publication_date": "Unknown",
        "content": "Why publish in Cureus? Click below to find out.\n\nUnlock discounted publishing that highlights your organization and the peer-reviewed research and clinical experiences it produces.\n\nFind out how channels are organized and operated, including details on the roles and responsibilities of channel editors.\n\nOffering a variety of advertising and sponsorship options for reaching influential specialists from targeted demographic splits.\n\nCureus provides an equitable, efficient publishing and peer reviewing experience without sacrificing publication times.\n\nGenerate broad awareness and deliver relevant, peer-reviewed clinical experiences directly to potential customers.\n\nDedicated Cranial Radiosurgery: Clinical Experience with New & Innovative SRS Technologies\n\nSponsored by Zap Surgical Systems\n\nReal-Time Adaptive Motion Management on Helical and Robotic RT Platforms\n\nSponsored by Accuray, Inc.\n\nWhy publish in Cureus? Click below to find out.\n\nUnlock discounted publishing that highlights your organization and the peer-reviewed research and clinical experiences it produces.\n\nFind out how channels are organized and operated, including details on the roles and responsibilities of channel editors.\n\nOffering a variety of advertising and sponsorship options for reaching influential specialists from targeted demographic splits.\n\nCureus provides an equitable, efficient publishing and peer reviewing experience without sacrificing publication times.\n\nGenerate broad awareness and deliver relevant, peer-reviewed clinical experiences directly to potential customers.\n\nDedicated Cranial Radiosurgery: Clinical Experience with New & Innovative SRS Technologies\n\nSponsored by Zap Surgical Systems\n\nReal-Time Adaptive Motion Management on Helical and Robotic RT Platforms\n\nSponsored by Accuray, Inc.\n\nPlease note that by doing so you agree to be added to our monthly email newsletter distribution list.\n\nBy joining Cureus, you agree to ourPrivacy PolicyandTerms of Use."
      },
      {
        "title": "Clinical and Radiological Significance of Anatomical Variations in Paranasal Sinuses: A Retrospective CT-Based Study",
        "author": "Unknown Author",
        "publication_date": "Unknown"
      }
    ],
    "authors": [],
    "source": "Cureus",
    "image_url": "https://assets.cureus.com/uploads/figure/file/1444969/article_river_ff595080117311f084713faaa7f2037c-Screenshot-2025-04-04-at-10.11.13-PM.png",
    "url": "https://www.cureus.com/articles/354515-occurrence-of-paraneoplastic-syndrome-in-bronchogenic-carcinoma-patients-in-a-tertiary-care-centre-in-chennai"
  },
  "markdown_content": "## Study Overview\\nThe study investigates the occurrence of paraneoplastic syndrome among patients diagnosed with bronchogenic carcinoma at a tertiary care facility in Chennai.\\n\\n## Research Context\\nWhile the complete content details are not provided in the source material, the research appears to be a clinical investigation examining the correlation between bronchogenic carcinoma and associated paraneoplastic syndromes. The study was conducted in a healthcare setting specializing in advanced medical care and treatment.\\n\\n## Research Objectives\\nThe research aims to contribute to the understanding of paraneoplastic manifestations in lung cancer patients, which could potentially aid in early diagnosis and improved patient care."
}