{
  "title": "Vance to meet Modi, Meloni during trip to India and Italy with wife Usha",
  "publication_date": "2025-04-16T14:39:47",
  "summary": "Vice President JD Vance and his wife Usha will embark on a diplomatic trip to Italy and India from Friday to April 24. The journey includes stops in Rome, New Delhi, Jaipur, and Agra. In Rome, Vance will meet with Prime Minister Meloni and Vatican officials, while in India he will meet with Prime Minister Modi. The trip holds special significance as Usha Vance is the daughter of South Indian immigrants.",
  "content": "Vice President JD Vance and his family will travel to Italy and India this week and next to meet with leaders and visit cultural sites.\n\nVance's office said Wednesday his trip from Friday to April 24 will include visits to Rome and New Delhi along with the Indian cities of Jaipur and Agra.\n\nThe trip comes as Vance has taken on a prime role in the White House's engagements abroad. The Republican vice president and his wife, Usha Vance, traveled to Greenland last month, and he went to Paris and Munich in February.\n\nPresident Donald Trump is expected to make his first foreign trip in May to Saudi Arabia.\n\nIn Rome this week, Vance is expected to meet with Prime Minister Giorgia Meloni, who is due to visit the White House on Thursday. Vance, who converted to Catholicism in 2019, will also meet with Vatican Secretary of State Cardinal Pietro Parolin, according to his office, and is expected to participate in ceremonies around Easter Sunday.\n\nVance's visit to India marks his first trip to the country, which has added significance for the second family. Usha Vance is the daughter of immigrants from South India.\n\nWhile in India next week, Vance is expected to meet with Prime Minister Narendra Modi, who met with Trump at the White House in February.",
  "category": "World",
  "tags": [
    "politics",
    "diplomacy",
    "JD Vance",
    "India",
    "Italy",
    "Vatican",
    "international relations",
    "White House"
  ],
  "location": "Washington, USA",
  "source": {
    "title": "Protesters in cities across the US rally against Trump's policies, Project 2025 and Elon Musk",
    "publication_date": 1738722600,
    "content": [
      {
        "title": "Vance to meet Modi, Meloni during trip to India and Italy with wife Usha",
        "publication_date": "2025-04-16T14:39:47",
        "content": "Copyright 2025 The Associated Press. All Rights Reserved.\n\nCopyright 2025 The Associated Press. All Rights Reserved.\n\nVice President JD Vance watches as President Donald Trump welcomes the 2025 College Football National Champions, the Ohio State University football team, on the South Lawn of the White House, Monday, April 14, 2025, in Washington. (AP Photo/Alex Brandon)\n\nVice President JD Vance arrives before President Donald Trump speaks during an event to announce new tariffs in the Rose Garden of the White House, Wednesday, April 2, 2025, in Washington. (AP Photo/Evan Vucci)\n\nWASHINGTON (AP) —Vice President JD Vanceand his family will travel to Italy and India this week and next to meet with leaders and visit cultural sites.\n\nVance’s office said Wednesday his trip from Friday to April 24 will include visits to Rome and New Delhi along with the Indian cities of Jaipur and Agra.\n\nThe trip comes as Vance has taken on a prime role in the White House’s engagements abroad. The Republican vice president and his wife, Usha Vance,traveled to Greenlandlast month, and hewent to Paris and Munichin February.\n\nPresident Donald Trump is expected to make his first foreign trip in May to Saudi Arabia.\n\nIn Rome this week, Vance is expected to meet withPrime Minister Giorgia Meloni, who is due to visit the White House on Thursday. Vance, who converted to Catholicism in 2019, will also meet with Vatican Secretary of State Cardinal Pietro Parolin, according to his office, and is expected to participate in ceremonies around Easter Sunday.\n\nVance’s visit to India marks his first trip to the country, which has added significance for the second family.Usha Vanceis the daughter of immigrants from South India.\n\nWhile in India next week, Vance is expected to meet with Prime MinisterNarendra Modi, who met with Trump at the White House in February.\n\nCopyright 2025 The Associated Press. All Rights Reserved."
      },
      {
        "title": "Vance to meet Modi, Meloni during trip to India and Italy with wife Usha",
        "author": "Unknown Author",
        "publication_date": "2025-04-16T14:39:47"
      }
    ],
    "authors": [],
    "source": "AP News",
    "image_url": "https://dims.apnews.com/dims4/default/ea14898/2147483647/strip/true/crop/5087x3391+0+0/resize/599x399!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2F37%2F98af04712ae26cd1bd37c69876af%2Fe48366c2e6e546248b2ff661c910571d",
    "url": "https://apnews.com/article/50501-protests-project-2025-trump-state-capitols-ddd341171a54ba9b498cbfe7530e18ab"
  },
  "markdown_content": "## Official Travel Announcement\\nVice President JD Vance and his family will travel to Italy and India this week and next to meet with leaders and visit cultural sites.\\n\\nVance's office said Wednesday his trip from Friday to April 24 will include visits to Rome and New Delhi along with the Indian cities of Jaipur and Agra.\\n\\nThe trip comes as Vance has taken on a prime role in the White House's engagements abroad. The Republican vice president and his wife, Usha Vance, traveled to Greenland last month, and he went to Paris and Munich in February.\\n\\n## Upcoming Presidential Travel\\nPresident Donald Trump is expected to make his first foreign trip in May to Saudi Arabia.\\n\\n## Italy Itinerary\\nIn Rome this week, Vance is expected to meet with Prime Minister Giorgia Meloni, who is due to visit the White House on Thursday. Vance, who converted to Catholicism in 2019, will also meet with Vatican Secretary of State Cardinal Pietro Parolin, according to his office, and is expected to participate in ceremonies around Easter Sunday.\\n\\n## India Visit\\nVance's visit to India marks his first trip to the country, which has added significance for the second family. Usha Vance is the daughter of immigrants from South India.\\n\\nWhile in India next week, Vance is expected to meet with Prime Minister Narendra Modi, who met with Trump at the White House in February."
}