{
  "title": "3 Altcoins to Sell Now as Fed's Powell Warns Tariffs Will Fuel Inflation",
  "publication_date": "2025-04-17T14:03:25+00:00",
  "summary": "Federal Reserve Chair Jerome Powell warns that US tariffs may increase inflation, causing concern in crypto markets. The article identifies three altcoins - Mantra (OM), Pi Network (PI), and Trump (TRUMP) - as cryptocurrencies investors should consider selling due to bearish market conditions and specific risks associated with each token.",
  "content": "The crypto market has been under bearish pressure because of President Trump's tariff policy. The Federal Reserve Chair Jerome Powell has sparked concerns after his recent remarks revealed that US inflation may rise because of these tariffs.\n\nAccording to Powell, the ongoing tariff war will have a negative impact on inflation. Reuters reported that experts are also expressing concerns about US economic growth. One expert noted that Powell is confirming investors' worries about slowing economic growth and stubborn inflation resulting from tariffs.\n\nUS President Trump attributes the financial market wrangles to Powell's hawkish stance on inflation. Trump noted on Truth Social that other central banks were lowering their rates to stimulate economic growth.\n\nDespite concerns, CME FedWatchTool data shows 87% of investors believe interest rates will remain unchanged after next month's FOMC meeting. The harsh macroeconomic situation has identified three altcoins as particularly vulnerable: Mantra (OM), which has crashed 92% from its all-time high, Pi Network (PI), facing significant token unlocks, and Trump (TRUMP), showing predominantly negative funding rates.\n\nMantra's RSI remains historically low at 27, indicating bearish momentum. Pi Network faces pressure from over 10M tokens being added to circulation next month. TRUMP's negative funding rates suggest traders are taking long positions, further showing bearish momentum.",
  "category": "Business",
  "tags": [
    "cryptocurrency",
    "inflation",
    "federal reserve",
    "tariffs",
    "economic policy",
    "altcoins",
    "trading",
    "market analysis"
  ],
  "location": "United States",
  "source": {
    "title": "3 Altcoins to Sell Now as Fed’s Powell Warns Tariffs Will Fuel Inflation",
    "publication_date": 1744879498,
    "content": [
      {
        "title": "3 Altcoins to Sell Now as Fed's Powell Warns Tariffs Will Fuel Inflation",
        "publication_date": "2025-04-17T14:03:25+00:00",
        "content": "+Plus500\n\nHighlights\n\nThe crypto market has been under bearish pressure because of President Trump’s tariff policy. The Federal Reserve Chair Jerome Powell has also sparked concerns after his recent remarks revealed that US inflation may also rise because of these tariffs. This article explores the top altcoins that crypto traders should sell as the economic climate flips bearish.\n\nAccording to Powell, the ongoing tariff war will have a negative impact on inflation. Following these remarks, Reuters reported that experts are also expressing concerns about US economic growth. One expert noted,\n\n“Powell is confirming what investors have been worried about, and that is the likelihood of slowing economic growth and more stubborn inflation as a result of the tariffs.”\n\nMeanwhile, US President Donald Trump attributes the wrangles in the financial markets toPowell’s hawkish stance on inflation. In his recent post on Truth Social, Trump noted that other central banks were lowering their rates to stimulate economic growth.\n\nDespite the mounting concerns,data from CME FedWatchToolshows that 87% of investors believe that interest rates will remain the same next month after the FOMC meeting. If this happens, the crypto market faces volatility, hence the need for traders to seek the best altcoins to sell to minimize risks.\n\nThe harsh macroeconomic situation is spooking crypto investors, and some are looking for the best altcoins to sell. The top altcoins to sell amid growing concerns are Mantra (OM), Pi Network (PI), and Trump (TRUMP)\n\nOne of the top altcoins to sell to avoid losses is Mantra. This token recently recorded one of the worst crashes in crypto history, and it is now down by 92% from its all-time high recorded only two months ago.\n\nDespite this dip, the RSI remains historically low at 27, which highlights a bearish momentum. At the same time, the ADX line is rising, which is a sign that the downtrend is gaining strength. This technical outlook supports a bearishMantra price prediction.\n\nPi Network (PI) is also another altcoin to sell due to upcoming token unlocks. On-chain data shows that over 10M PI Coin tokens will be added to the circulating supply in the next month.\n\nAccording to anX post by analyst Dr Altcoin, these unlocks are the main reason that the Pi Coin price is falling. These events have led to the Pi Coin market being flooded by more sellers than buyers, which is having a bearish effect on the price.\n\nTRUMP is also one of the top altcoins to sell as traders remain concerned about inflation and tariffs. Data from Coinglass shows that TRUMP’s funding rates have been predominantly negative in the last month. This indicates that many traders are taking long positions, further showing bearish momentum.\n\nThe Federal Reserve Chair Jerome Powell has warned that US inflation may rise again due to tariffs. His remarks have drawn criticism but have also caused concerns in the crypto industry about a possible downtrend. If the market starts to drop, the top altcoins to sell are Mantra (OM), Pi Network (PI), and the TRUMP meme coin.\n\nPremium Partners\n\nSign Up Now\n\nJoin Presale\n\nJoin to Win\n\n3-minute daily crypto updates to your inbox\n\nFollow us\n\nNews\n\nPopular\n\nFeatured\n\nAbout"
      },
      {
        "title": "3 Altcoins to Sell Now as Fed's Powell Warns Tariffs Will Fuel Inflation",
        "author": "muthoni",
        "publication_date": "2025-04-17T14:03:25+00:00"
      }
    ],
    "authors": [],
    "source": "CoinGape",
    "image_url": "https://coingape.com/wp-content/uploads/2025/04/3-Altcoins-to-Sell-Now-as-Feds-Powell-Warns-Tariffs-Will-Fuel-Inflation.webp",
    "url": "https://coingape.com/markets/3-altcoins-to-sell-now-as-feds-powell-warns-tariffs-will-fuel-inflation/"
  },
  "markdown_content": "## Market Overview\\nThe crypto market has been under bearish pressure because of President Trump's tariff policy. The Federal Reserve Chair Jerome Powell has sparked concerns after his recent remarks revealed that US inflation may rise because of these tariffs.\\n\\n## Federal Reserve Response\\nAccording to Powell, the ongoing tariff war will have a negative impact on inflation. Reuters reported that experts are also expressing concerns about US economic growth. \\n\\n> One expert noted that Powell is confirming investors' worries about slowing economic growth and stubborn inflation resulting from tariffs.\\n\\n## Political Response\\nUS President Trump attributes the financial market wrangles to Powell's hawkish stance on inflation. Trump noted on Truth Social that other central banks were lowering their rates to stimulate economic growth.\\n\\n## Market Outlook\\nDespite concerns, CME FedWatchTool data shows 87% of investors believe interest rates will remain unchanged after next month's FOMC meeting. The harsh macroeconomic situation has identified three altcoins as particularly vulnerable:\\n\\n* Mantra (OM), which has crashed 92% from its all-time high\\n* Pi Network (PI), facing significant token unlocks\\n* Trump (TRUMP), showing predominantly negative funding rates\\n\\n## Technical Analysis\\n* Mantra's RSI remains historically low at 27, indicating bearish momentum\\n* Pi Network faces pressure from over 10M tokens being added to circulation next month\\n* TRUMP's negative funding rates suggest traders are taking long positions, further showing bearish momentum"
}