{
  "title": "Already facing Trump administration cuts, US colleges risk losses from another revenue source: foreign students",
  "publication_date": "2025-04-18T09:00:36.726Z",
  "summary": "US colleges face potential financial strain as international student enrollment shows signs of decline amid Trump administration's visa restrictions and policy demands. Over 1.1 million international students enrolled in US institutions last year, contributing significant funding through full tuition payments. Recent visa revocations, particularly affecting Chinese students, combined with geopolitical tensions and warnings from China, threaten this crucial revenue stream for American universities.",
  "content": "In a matter of days, millions of students will be finalizing one of the biggest decisions of their lives: what college they will attend.\n\nThe choice could prove to be even more daunting for international students hoping to study in the United States, as the Trump administration revokes hundreds of student visas and admonishes colleges that don't adhere to its policy demands, threatening to pull billions in funding.\n\nThe previous academic year, more than 1.1 million international students enrolled at American higher education institutions – a record high. Foreign students, who are more likely to pay full tuition compared to their American counterparts, bring significant funding to colleges.\n\nMore than 1,000 international students or recent graduates have had their visas revoked or statuses terminated since Trump took office in January. International students are more likely to pay full tuition at US colleges, in part because most aren't eligible for federal financial aid.\n\nMore than three-quarters of international students primarily fund their education themselves, through their family or through current employment. Less than one-fifth received primary funding from their US college or university.\n\nOne-quarter of international students in the US hail from China, surpassed only by India, whose nationals account for 29% of international students. China has issued warnings to its citizens about studying in the US amid deteriorating economic relations.\n\nCommon App reported the number of first-year international applicants for the approaching school year was down 1% compared to last year, while domestic applications rose 5%. Some Canadian universities have seen increased interest from American students, potentially due to the current political climate.\n\nExperts warn this could become more than just a trickle, potentially turning into a flood if current trends continue, as the US loses its position as the primary destination for international education.",
  "category": "Education",
  "tags": [
    "education",
    "international students",
    "Trump administration",
    "higher education",
    "immigration",
    "visa policy",
    "foreign students",
    "universities",
    "China-US relations"
  ],
  "location": "United States",
  "source": {
    "title": "Already facing Trump administration cuts, US colleges risk losses from another revenue source: foreign students",
    "publication_date": 1744973820,
    "content": [
      {
        "title": "Already facing Trump administration cuts, US colleges risk losses from another revenue source: foreign students | CNN",
        "publication_date": "2025-04-18T09:00:36.726000+00:00",
        "content": "Follow:\n\nIn a matter of days, millions of students will be finalizing one of the biggest decisions of their lives: what college they will attend.\n\nThe choice could prove to be even more daunting for international students hoping to study in the United States, as the Trump administrationrevokeshundreds of student visas and admonishes colleges that don’t adhere to its policy demands, threatening to pullbillions of dollars in fundingand at least one school’sability to host foreign students.\n\nThe previous academic year, more than 1.1 million international students enrolled at American higher education institutions – a record high, according to areportfrom the nonprofit Institute of International Education.\n\nAnd foreign students, who are more likely to pay full tuition compared to their American counterparts, bring significant funding to colleges.\n\nIf they choose to take their dollars elsewhere, it could spell financial trouble for the US colleges that rely on them.\n\nRelated articleHarvard weighs its next moves amid the federal funding standoff\n\n“A lot of universities are already under financial strain from a variety of reasons (including) the recent efforts by the Trump administration against certain elite institutions to claw back federal aid to those institutions,” Stephen Yale-Loehr, a retired Cornell University immigration law professor, told CNN. “So a drop in international students will hurt those institutions even more.”\n\nWhile it’s too soon to know whether international student enrollment will decline this upcoming year – a clearer picture will emerge beyond May 1, college decision day – “it seems like a lot of students are more skittish about coming to the United States,” Yale-Loehr said.\n\nEven before college decision day,one companythat handles applications says it has seen a slight dip in international applications, and China, which supplies25%of foreign students, has issued a warning to its citizens about studying in the US.\n\nMore than 1,000international students or recent graduates have had theirvisas revokedor statuses terminated since Trump took office in January – some high-profile cases accuse students of supporting terror organizations, while others have involved relatively minor offenses such as years-old misdemeanors.\n\nA visa revocation would terminate a student’s legal status in the US, forcing them to step away from their studies – even though some students have already paid thousands in tuition dollars.\n\nInternational students are more likely to pay full tuition at US colleges, in part because mostaren’t eligible for federal financial aid.\n\nAlso, many universities focus their own financial aid primarily on domestic students, Yale-Loehr said, and “because of that, international students bring in more dollars per student than the tuition that domestic students pay.”\n\nSome universities believe their commitments should lie with in-state and American students since their families pay taxes, said William Brustein, a higher education global strategist. He’s served as the chief international officer at several public universities and in top leadership positions for groups supporting international students.\n\nRelated articleAttorneys for more than 100 international students argue in court against revoked visas\n\n“Now, for international students, (colleges) felt that they didn’t have that same commitment. And to be honest with you, they felt that this could serve as almost a cash cow for many of these universities. If these students were willing, their families were willing to pay two and sometimes three times as much,” he told CNN.\n\nMore than three-quarters of international students primarily fund their education themselves, through their family or through current employment,the Institute of International Education found. Less than one-fifth received primary funding from their US college or university.\n\nAnd an increase in foreign students at public research universities led to pronounced tuition revenue gains, a research paper published in theAmerican Economic Journalsays – much-needed gains, the paper found, which helped offset falling state funding appropriations.\n\nAmerican universities are already seeing other types of financial pains: This week,the federal government frozemore than $2 billion in multiyear grants and $60 million in multiyear contracts at Harvard after the Ivy League university refused to change itshiring and other practices.\n\nAnd on Wednesday, the Department of Homeland Securitythreatened to strip Harvardof its ability to enroll foreigners if it doesn’t turn over records on “illegal and violent activities” of its current international students. International students make upmore than a quarter of Harvard’s enrollment.\n\nWhile Harvard and other elite schools could suffer financially from a decline in foreign students, others – like public research universities with endowments that aren’t as deep – could feel it even more keenly, Brustein said.\n\nOne-quarter of international students in the UShail from China, surpassed only by India, whose nationals account for 29% of international students.\n\nBut amid a massive trade war and what it calls the deterioration of “China-U.S. economic and trade relations and the security situation within the United States,” China issued a stark warning to its students hoping to study abroad in the US.\n\nThis month,China’s Ministry of Culture and Tourismand itsMinistry of Educationreleased statements telling Chinese citizens visiting and studying in the United States to travel with caution.\n\nJayson Ma, a 24-year-old Chinese national who has been in the United States since 2016 on a valid student visa, learned his student visa was revoked by the federal government earlier this month.\n\nMa said he learned about it when his school called with the news. But details about the reason for the revocation weren’t available; his attorneysaidhe hadn’t received any official documentation ordering him to leave the United States. Ma has no criminal record or convictions; he has a previous DUI charge that was dismissed in court and expunged from his record after completing a court-ordered course, his attorney said.\n\nIn response to questions about Ma’s situation, a State Department spokesperson told CNN: “We don’t go into the rationale for what happens with individual visas.”\n\n“The geopolitical environment over the last 10 to 15 years, particularly with respect to the US-China relationship, has really dampened the prospects for choosing the US,” Brustein said, with Covid-19 and its aftermath exacerbating the political climate.\n\nIn 2020, the USrevoked visasfor more than 1,000 Chinese students and researchers deemed security risks. When President Joe Biden took office, many of those Trump-era policies were kept in place –making it difficultfor Chinese graduate students and researchers to secure a visa.\n\nAmerican schools saw a 4% drop in Chinese international students enrolled last academic year,according tothe Institute of International Education.\n\nWali Khan, a Michigan State University journalism student from Hong Kong and Singapore, came to the United States about four years ago in search of a freer press. He said he fled Singapore after he was interrogated for hours without access to a lawyer afterhis reportingon accusations of a top university mishandling sexual abuse cases.\n\nThe Trump administration’s immigration crackdown hasn’t changed the 24-year-old’s plans – he wants to stay in the US after finishing school. And while it hasn’t stopped him from reporting, he said he’s received worried calls from friends, has considered privatizing his social media accounts and tries to spend more time in public and less in secluded places.\n\n“I’ve built a life here,” he told CNN.  “I’ve been uprooted once, and that was difficult enough. So it also feels like this crushing weight.”\n\nCommon App, a college admission platform serving hundreds of colleges and processing millions of applications,reportedthe number of first-year international applicants for the approaching school year was down 1% as of March 1 compared to the same date last year. That contrasts with a 5% rise in first-year domestic applicants – marking the first time since 2019 that growth in domestic applications exceeded international growth, the company said.\n\nThe recent treatment of foreign students could serve as “accelerants” for an eventual decline in international enrollment, Brustein said, stemming from concerns he’s been increasingly hearing from international families for years: The rising price tag of an American college education combined with increasing reputations of universities outside the US.\n\n“The US isn’t the shining beacon on the hill here anymore,” he told CNN. “If you want to get a top-notch education that positions you well for your career, there are other choices now.”\n\nSome signs point to even US citizens increasingly looking to Canada for their education: Reutersreportedat least three Canadian universities had seen an uptick in interest and applications from American students. One official from the University of British Columbia’s Vancouver campus attributed the spike to the Trump administration’s visa revocations and increased scrutiny of their social media activity.\n\n“This could become just not a trickle,” Brustein warned. “It could become, if we continue down the road we are today, maybe more of a flood.”\n\nCNN’s Gloria Pazmino contributed to this report.\n\nCorrection: A previous version of this story misspelled the first name of Stephen Yale-Loehr.\n\n© 2025 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.CNN Sans ™ & © 2016 Cable News Network."
      },
      {
        "title": "Already facing Trump administration cuts, US colleges risk losses from another revenue source: foreign students | CNN",
        "author": "Celina  Tebor",
        "publication_date": "2025-04-18T09:00:36.726000+00:00"
      }
    ],
    "authors": [
      "Celina Tebor"
    ],
    "source": "CNN",
    "image_url": "https://media.cnn.com/api/v1/images/stellar/prod/ap25102463918433.jpg?c=16x9&q=h_833,w_1480,c_fill",
    "url": "https://www.cnn.com/2025/04/18/us/international-students-universities-funding-trump/index.html"
  },
  "markdown_content": "## International Student Enrollment Trends\\n\\nIn a matter of days, millions of students will be finalizing one of the biggest decisions of their lives: what college they will attend.\\n\\nThe choice could prove to be even more daunting for international students hoping to study in the United States, as the Trump administration revokes hundreds of student visas and admonishes colleges that don't adhere to its policy demands, threatening to pull billions in funding.\\n\\nThe previous academic year, more than 1.1 million international students enrolled at American higher education institutions – a record high. Foreign students, who are more likely to pay full tuition compared to their American counterparts, bring significant funding to colleges.\\n\\n## Visa Status and Funding\\n\\n* More than 1,000 international students or recent graduates have had their visas revoked or statuses terminated since Trump took office in January\\n* International students are more likely to pay full tuition at US colleges, in part because most aren't eligible for federal financial aid\\n* More than three-quarters of international students primarily fund their education themselves, through their family or through current employment\\n* Less than one-fifth received primary funding from their US college or university\\n\\n## Demographics and Global Impact\\n\\nOne-quarter of international students in the US hail from China, surpassed only by India, whose nationals account for 29% of international students. China has issued warnings to its citizens about studying in the US amid deteriorating economic relations.\\n\\n## Shifting Application Patterns\\n\\n* Common App reported the number of first-year international applicants for the approaching school year was down 1% compared to last year, while domestic applications rose 5%\\n* Some Canadian universities have seen increased interest from American students, potentially due to the current political climate\\n\\nExperts warn this could become more than just a trickle, potentially turning into a flood if current trends continue, as the US loses its position as the primary destination for international education."
}