{
  "title": "Bernard Arnault: Blame Brussels if tariffs push LVMH to move production to US",
  "publication_date": "2025-04-17T16:29:35+00:00",
  "summary": "French billionaire Bernard Arnault warns that LVMH might move production to the US if trade tensions escalate due to Trump's proposed tariffs on the EU. During LVMH's annual shareholder meeting, Arnault criticized Brussels' handling of trade negotiations and stated that any production offshoring would be the EU's fault. He advocates for a free-trade zone between the EU and US.",
  "content": "French billionaire Bernard Arnault has warned that iconic luxury goods giant LVMH could offshore production to the United States in the event of a trade war as a result of President Donald Trump's proposed tariffs on the European Union.\n\nDuring the conglomerate's annual shareholder meeting, Arnault declared \"It will be Brussels' fault if this happens.\" The warning comes after the White House announced sweeping global tariffs that would have affected hundreds of billions of euros worth of goods, before suspending them for 90 days following market turmoil.\n\nThe EU has paused its retaliation against Trump's steel and aluminum tariffs, hoping to negotiate a deal within the three-month window. While analysts largely blame the Trump administration for creating uncertainty, Arnault points to the European Union as responsible for finding a protective deal without raising tariffs.\n\nThe U.S. represents a major market for LVMH, making the company particularly vulnerable to any trade war between Brussels and Washington. Arnault warned that without an agreement, higher tariffs would force LVMH and other European companies to relocate operations to the United States.\n\nArnault, who attended Trump's inauguration, supports the president's plans to reduce taxes and regulations to attract manufacturers. He criticized the EU as a \"bureaucratic power\" focused on creating regulations that burden member countries and economic sectors.\n\nAdvocating for a \"free-trade zone\" between the EU and U.S., Arnault's position aligns with similar calls from other business leaders. European Commission President Ursula von der Leyen has indicated the bloc proposed a zero-for-zero tariff deal on industrial goods.",
  "category": "Business",
  "tags": [
    "trade war",
    "luxury goods",
    "LVMH",
    "European Union",
    "tariffs",
    "manufacturing",
    "Bernard Arnault",
    "international trade",
    "Trump administration"
  ],
  "location": "France",
  "source": {
    "title": "Bernard Arnault: Blame Brussels if tariffs push LVMH to move production to US",
    "publication_date": 1744891140,
    "content": [
      {
        "title": "Bernard Arnault: Blame Brussels if tariffs push LVMH to move production to US",
        "publication_date": "2025-04-17T16:29:35+00:00",
        "content": "The French billionaire says the EU needs to look out for the bloc’s manufacturers.\n\nAI generated Text-to-speech\n\nFrench billionaire Bernard Arnault has warned that iconic luxury goods giant LVMH could offshore production to the United States in the event of a trade war as a result of President Donald Trump's proposed tariffs on the European Union.\n\n\"It will be Brussels' fault if this happens,\" the LVMH headsaid Thursdayduring the conglomerate's annual shareholder meeting.\n\nAfter slapping a 10 percent universal tariff on all trading partners and 25 percent levies on cars, steel and aluminum, the White House in early April announced sweeping global tariffs that would have affectedhundreds of billions of euros worth of goods— only to suspend them for 90 days after global market chaos ensued.\n\nThe EU has already paused its retaliation against Trump’s steel and aluminum tariffs in the hopes of negotiating a deal within the three-month window, even as some of the U.S. tariffs remain in place.Earlier this month, French President Emmanuel Macron called on European companies to pause investments in the United States until the situation could be \"clarified.\"\n\nWhile most analysts attribute the investment-chilling uncertainty to the Trump administration and its nebulous trade goals, Arnault says it is the European Union that must shoulder the responsibility to find a deal that protects its interests without raising tariffs.\n\nThe U.S. is a major market for LVMH, so the firm would be uniquely exposed to a trade war between Brussels and Washington. Arnault said that if the two sides don't reach an agreement, higher tariffs would push LVMH and other European companies to move operations to the United States.\n\n\"If Europe cannot negotiate intelligently, there will be consequences for many businesses,\" Arnault said.\n\nArnault, who attended Trump's inauguration in January,is an outspoken fanof the president's plan to slash taxes and red tape to entice manufacturers to move production stateside. On Thursday he criticized the EU as a \"bureaucratic power that spends its time issuing regulations that unfortunately are imposed on all member countries ... and that penalize our economic sectors.\"\n\nArnault also said he wants the EU and the U.S. to enact a \"free-trade zone,\" similar to a call from fellow billionaire Elon Muskearlier this month. European Commission President Ursula von der Leyen said the blochad proposed a zero-for-zero tariff deal on industrial goods.\n\nEU leaders hope the Italian PM can convey their trade concerns to the U.S. president when she visits Washington.\n\n“This is a wake-up call on trade agreements,” French Trade Minister Laurent Saint-Martin tells POLITICO.\n\nStéphane Séjourné says he expected “good news,” which will provide succor for the French booze industry.\n\nPARIS —The trade war with the United States might prevent France from bringing down its sky-high budget deficit, French Economy and Finance Minister Eric Lombard said on …"
      },
      {
        "title": "Bernard Arnault: Blame Brussels if tariffs push LVMH to move production to US",
        "author": "Unknown Author",
        "publication_date": "2025-04-17T16:29:35+00:00"
      }
    ],
    "authors": [
      "Giorgio Leali"
    ],
    "source": "politico.eu",
    "image_url": "https://www.politico.eu/cdn-cgi/image/width=1160,height=773,quality=80,onerror=redirect,format=auto/wp-content/uploads/2025/04/17/GettyImages-2210044256-scaled.jpg",
    "url": "https://www.politico.eu/article/bernard-arnault-higher-tariff-push-lvmh-move-production-united-states-brussels-fault/"
  },
  "markdown_content": "## Trade War Concerns\\n\\nFrench billionaire Bernard Arnault has warned that iconic luxury goods giant LVMH could offshore production to the United States in the event of a trade war as a result of President Donald Trump's proposed tariffs on the European Union.\\n\\nDuring the conglomerate's annual shareholder meeting, Arnault declared:\\n\\n> \"It will be Brussels' fault if this happens.\"\\n\\nThe warning comes after the White House announced sweeping global tariffs that would have affected hundreds of billions of euros worth of goods, before suspending them for 90 days following market turmoil.\\n\\n## Diplomatic Negotiations\\n\\nThe EU has paused its retaliation against Trump's steel and aluminum tariffs, hoping to negotiate a deal within the three-month window. While analysts largely blame the Trump administration for creating uncertainty, Arnault points to the European Union as responsible for finding a protective deal without raising tariffs.\\n\\n## Impact on LVMH\\n\\nThe U.S. represents a major market for LVMH, making the company particularly vulnerable to any trade war between Brussels and Washington. Arnault warned that without an agreement, higher tariffs would force LVMH and other European companies to relocate operations to the United States.\\n\\n## Political Stance\\n\\nArnault, who attended Trump's inauguration, supports the president's plans to reduce taxes and regulations to attract manufacturers. He criticized the EU as a \"bureaucratic power\" focused on creating regulations that burden member countries and economic sectors.\\n\\nAdvocating for a \"free-trade zone\" between the EU and U.S., Arnault's position aligns with similar calls from other business leaders. European Commission President Ursula von der Leyen has indicated the bloc proposed a zero-for-zero tariff deal on industrial goods."
}