{
  "title": "Judge: Google Illegally Engaged In Anticompetitive Monopolistic Ad Tech Practices",
  "publication_date": "2025-04-17T00:00:00Z",
  "summary": "A US judge ruled that Google illegally maintained a monopoly in ad tech markets through anticompetitive practices. Judge Leonie Brinkema found Google willfully engaged in monopolistic behavior by tying its publisher ad server and ad exchange together. The Department of Justice and 17 states seek to force Google to sell its network ad business. Google plans to appeal part of the ruling while accepting other aspects.",
  "content": "A US judge ruled Google acted illegally to maintain a monopoly in some ad tech. This is the second time a judge ruled Google willfully engaged in monopolistic practices. The ruling, issued by U.S. District Judge Leonie Brinkema in Alexandria, Virginia, found that Google has engaged in anticompetitive acts to maintain monopoly power in publisher ad server and ad exchange markets for over a decade.\n\nGoogle responded on social media, stating they \"won half of this case and will appeal the other half\" of the US antitrust ruling, expressing disagreement with the decision on publisher tools.\n\nThe court document concluded that Google tied its publisher ad server and ad exchange together through contractual policies and technological integration, enabling the company to establish and protect its monopoly power. The judge found that this conduct substantially harmed Google's publisher customers, the competitive process, and consumers.\n\nThe DOJ and 17 US states that brought the antitrust case are seeking to force Google to sell off its \"network\" ad business, which represents approximately 12% of Alphabet's total revenue.\n\nThe ruling also highlighted concerning practices, including Google's internal messaging system automatically deleting employee chats unless explicitly preserved, and alleged misuse of attorney-client privilege. These actions occurred during the federal government's antitrust investigation.\n\nThe case has significant implications for the tech industry, with remedies still being determined. The court dismissed Count III regarding monopolization of the advertiser ad network market but found Google liable for monopolization of the publisher ad server market, ad exchange market, and unlawful tying of AdX and DFP.",
  "category": "Technology",
  "tags": [
    "Google",
    "antitrust",
    "technology",
    "advertising",
    "legal",
    "monopoly",
    "DOJ",
    "digital advertising",
    "business regulation"
  ],
  "location": "Alexandria, Virginia, United States",
  "source": {
    "title": "Judge: Google Illegally Engaged In Anticompetitive Monopolistic Ad Tech Practices",
    "publication_date": 1744884300,
    "content": [
      {
        "title": "Google Illegally Engaged In Anticompetitive Monopolistic Ad Tech Practices",
        "publication_date": "Unknown",
        "content": "A US judgeruledGoogle acted illegally to maintain a monopoly in some ad tech. This is the second time a judge ruled Google willfully engaged in monopolistic practices.  The remedies for these rulings are still being worked out but may strengthen the case to have Google's business broken up.\n\nThe 115 pagePDF court documentconcluded, \"Google has willfully engaged in a series of anticompetitive\n\nacts to acquire and maintain monopoly power in the publisher ad server and ad exchange markets\n\nfor open-web display advertising.\"\n\nGoogle quickly responded onXsaying, \"we won half of this case and we will appeal the other half\" of the US antitrust ruling, and \"we disagree\" with the decision on its publisher tools.\n\nHere is the full conclusion written by U.S. District Judge Leonie Brinkema in Alexandria, Virginia:\n\nPlaintiffs have proven that Google has willfully engaged in a series of anticompetitive\n\nacts to acquire and maintain monopoly power in the publisher ad server and ad exchange markets\n\nfor open-web display advertising. For over a decade, Google has tied its publisher ad server and\n\nad exchange together through contractual policies and technological integration, which enabled\n\nthe company to establish and protect its monopoly power in these two markets. Google further\n\nentrenched its monopoly power by imposing anticompetitive policies on its customers and\n\neliminating desirable product features. In addition to depriving rivals of the ability to compete, this exclusionary conduct substantially harmed Google’s publisher customers, the competitive\n\nprocess, and, ultimately, consumers of information on the open web. Accordingly, Google is\n\nliable under Sections 1 and 2 of the Sherman Act.\n\nFor the foregoing reasons, by an Order to be issued with this Memorandum Opinion,\n\nCount III (monopolization of the advertiser ad network market) will be dismissed, and the parties\n\nwill be ordered to submit a joint proposed schedule for briefing and arguing their positions as to\n\nthe remedies that should be imposed in light of Google have been found liable for\n\nmonopolization of the publisher ad server market (Count I), monopolization of the ad exchange\n\nmarket (Count II), and unlawful tying of AdX and DFP (Count IV).\n\nLast August,Google also was ruled a monopoly, which we covered.\n\nThere are a number ofremediesbeing explored over these rulings. According toAxios, The DOJ and 17 US states that brought the antitrust case seek to force Google to sell off its \"network\" ad business, which is about 12% of Alphabet's total revenue.\n\nThe ruling goes on to read:\n\nGoogle evolved from a garage-based startup to a multitrillion dollar company in little\n\nmore than twenty years. Much of that growth was funded by digital advertising. In keeping with\n\nits professed mission to “organize the world’s information and make it universally accessible and\n\nuseful,” Google provides many of its key services at no financial cost to Internet users.\n\nOver the past two decades, Google has established increasingly detailed knowledge about the billions of people who have used its products, including by collecting data pertaining to their web browsing, search activity, physical location, demographic characteristics, app usage, communications, shopping activity, and device and network information.\n\nIn sum, Plaintiffs have shown that Google engaged in “willful acquisition or maintenance\n\nof [its monopoly] power as distinguished from growth or development as a consequence of a\n\nsuperior product, business acumen, or historic accident” by tying DFP to AdX and committing a\n\nseries of exclusionary and anticompetitive acts to entrench its monopoly power in two adjacent\n\nproduct markets. Kodak, 504 U.S. at 481 (quoting Grinnell, 384 U.S. at 570–71). The\n\nprocompetitive justifications that Google proffers for its anticompetitive conduct are both invalid\n\nand insufficient, and any procompetitive benefits of this conduct were far outweighed by its\n\nanticompetitive effects. Therefore, Google cannot evade liability under Sections 1 and 2 of the\n\nSherman Act.\n\nIt looks even more evil:\n\nGoogle’s internal messaging application deleted records of chats between employees\n\nunless an employee explicitly turned on “chat history,” and the application’s user interface made\n\nit difficult for employees to turn on chat history for every conversation they had. Chat deletions occurred when employees discussed substantive topics at issue in this litigation and continued after the federal government began an antitrust investigation into Google’s conduct.\n\nGoogle employees and executives also misused the attorney-client privilege.\n\nGoogle’s systemic disregard of the evidentiary rules regarding spoliation of evidence and\n\nits misuse of the attorney-client privilege may well be sanctionable.\n\nThis is a big deal and a lot of the folks in our industry were waiting for this to drop.\n\nAgain, what will these rulings lead to exactly is still not known.\n\nHere is the first thing I saw Google respond with so far:\n\n“We won half of this case and we will appeal the other half. The Court found that our advertiser tools and our acquisitions, such as DoubleClick, don’t harm competition. We disagree with the Court’s decision regarding our publisher tools. Publishers have many options and they…— News from Google (@NewsFromGoogle)April 17, 2025\n\n“We won half of this case and we will appeal the other half. The Court found that our advertiser tools and our acquisitions, such as DoubleClick, don’t harm competition. We disagree with the Court’s decision regarding our publisher tools. Publishers have many options and they…\n\nHere is some commentary:\n\n!!! \"this exclusionary ****** conduct substantially harmed Google’s publisher customers******, the competitive process, and, ultimately, consumers of information on the open web.\" /2pic.twitter.com/zR5u902Lph— Jason Kint (@jason_kint)April 17, 2025\n\n!!! \"this exclusionary ****** conduct substantially harmed Google’s publisher customers******, the competitive process, and, ultimately, consumers of information on the open web.\" /2pic.twitter.com/zR5u902Lph\n\nMajor loss for Google, and major win for anti-trust law, as federal judge rules that Google is a monopolist in case brought by the Trump DOJ, continued by the Biden DOJ, and now pursued by the new Trump DOJ (same with the current anti-trust suit against Meta):https://t.co/02Hs51TATd— Glenn Greenwald (@ggreenwald)April 17, 2025\n\nMajor loss for Google, and major win for anti-trust law, as federal judge rules that Google is a monopolist in case brought by the Trump DOJ, continued by the Biden DOJ, and now pursued by the new Trump DOJ (same with the current anti-trust suit against Meta):https://t.co/02Hs51TATd\n\nFrom the NYT article about the Google ruling: “In addition to depriving rivals of the ability to compete, this exclusionary conduct substantially harmed Google’s publisher customers, the competitive process, and, ultimately, consumers of information on the open web,” said Judge…https://t.co/ElH2Rg7rWs— Glenn Gabe (@glenngabe)April 17, 2025\n\nFrom the NYT article about the Google ruling: “In addition to depriving rivals of the ability to compete, this exclusionary conduct substantially harmed Google’s publisher customers, the competitive process, and, ultimately, consumers of information on the open web,” said Judge…https://t.co/ElH2Rg7rWs\n\nForum discussion atX.\n\nThe content atthe Search Engine Roundtableare the sole opinion of the authors and\n            in no way reflect views of RustyBrick ®, IncCopyright © 1994-2025RustyBrick ®, Inc.Web DevelopmentAll Rights Reserved.This work by Search Engine Roundtable is licensed under aCreative Commons Attribution 3.0 United States License.Creative Commons License and YouTube videos underYouTube's\n                ToS."
      },
      {
        "title": "Google Illegally Engaged In Anticompetitive Monopolistic Ad Tech Practices",
        "author": "Barry Schwartz",
        "publication_date": "Unknown"
      }
    ],
    "authors": [
      "Barry Schwartz"
    ],
    "source": "Search Engine Roundtable",
    "image_url": "https://images.seroundtable.com/google-logo-broken-up-1744903748.jpg",
    "url": "https://www.seroundtable.com/google-monopoly-ruling-two-39258.html"
  },
  "markdown_content": "## Legal Ruling\\nA US judge ruled Google acted illegally to maintain a monopoly in some ad tech. This is the second time a judge ruled Google willfully engaged in monopolistic practices. The ruling, issued by U.S. District Judge Leonie Brinkema in Alexandria, Virginia, found that Google has engaged in anticompetitive acts to maintain monopoly power in publisher ad server and ad exchange markets for over a decade.\\n\\n## Google's Response\\n> \"Won half of this case and will appeal the other half\"\\n\\nGoogle expressed disagreement with the decision on publisher tools via social media.\\n\\n## Key Findings\\nThe court document concluded that Google tied its publisher ad server and ad exchange together through contractual policies and technological integration, enabling the company to establish and protect its monopoly power. The judge found that this conduct substantially harmed:\\n* Google's publisher customers\\n* The competitive process\\n* Consumers\\n\\n## Legal Actions\\nThe DOJ and 17 US states that brought the antitrust case are seeking to force Google to sell off its \"network\" ad business, which represents approximately 12% of Alphabet's total revenue.\\n\\n## Concerning Practices\\nThe ruling highlighted troubling behaviors including:\\n* Google's internal messaging system automatically deleting employee chats unless explicitly preserved\\n* Alleged misuse of attorney-client privilege\\nThese actions occurred during the federal government's antitrust investigation.\\n\\n## Case Implications\\nThe case has significant implications for the tech industry, with remedies still being determined. The court dismissed Count III regarding monopolization of the advertiser ad network market but found Google liable for:\\n* Monopolization of the publisher ad server market\\n* Monopolization of ad exchange market\\n* Unlawful tying of AdX and DFP"
}