{
  "title": "Tamil Nadu CM Stalin Responds to PM Modi's 'Crying for Funds' Comment",
  "publication_date": "2025-04-18T03:21:00+05:30",
  "summary": "Tamil Nadu Chief Minister M.K. Stalin responded to Prime Minister Modi's remarks about Tamil Nadu 'crying for funds' by reminding him of similar statements he made as Gujarat CM. Stalin challenged Union Home Minister Amit Shah on issues including NEET exemption, Hindi imposition, and delimitation impacts on Tamil Nadu's representation. The CM also inaugurated over 6,700 projects worth ₹1,166 crore in Tiruvallur district.",
  "content": "Tamil Nadu Chief Minister M.K. Stalin has responded to Prime Minister Narendra Modi's recent comments about Tamil Nadu 'crying for funds' during his visit to Rameswaram. During a government function in Tiruvallur district, Stalin reminded the Prime Minister of his own statements as Gujarat Chief Minister.\n\n\"With complete humility and respect, I want to remind the Prime Minister, it was you who said that the States were not beggars to extend hands to the Union government for funds,\" Stalin stated, referencing Modi's previous stance as Gujarat CM when he accused the Union government of running a parallel government through Governors and showing partisan behavior in fund allocation.\n\nAddressing Union Home Minister Amit Shah's claims about raising diversionary issues, Stalin challenged him to provide guarantees on several matters affecting Tamil Nadu. \"Can you say that Tamil Nadu would be exempted from the ambit of NEET? Can you guarantee that you would not impose Hindi? Can you assure that the representation of Tamil Nadu would not go down after the delimitation process?\" he questioned.\n\nDuring the event, Stalin inaugurated over 6,700 completed projects in Tiruvallur district costing ₹1,166 crore, laid foundation for 7,300 new projects, and launched welfare measures benefiting over 2.02 lakh recipients.",
  "category": "World",
  "tags": [
    "politics",
    "government",
    "funding",
    "state rights",
    "Tamil Nadu",
    "India",
    "Modi",
    "Stalin"
  ],
  "location": "Chennai, Tamil Nadu, India",
  "source": {
    "title": "T.N. CM Stalin hits back at PM Modi over ‘crying for funds’ remark, reminds his statements as Gujarat CM",
    "url": "https://www.thehindu.com/news/national/tamil-nadu/tn-cm-stalin-hits-out-at-pm-modi-over-crying-for-funds-remark-reminds-his-statements-as-gujarat-cm/article69463985.ece",
    "created_utc": 1744981876.0,
    "subreddit": "india",
    "media": [
      "https://external-preview.redd.it/JvAAcFVSdPI4rmVmzWEuLK1IMnVZQ7CUmKDWqQEvwHA.jpg?auto=webp&s=75ef93e592ad36c95a0cb93fadc0f94cf1342290"
    ],
    "content": [
      {
        "title": "T.N. CM Stalin hits back at PM Modi over ‘crying for funds’ remark, reminds his statements as Gujarat CM",
        "publication_date": "2025-04-18T08:49:07+00:00",
        "content": "April 18, 2025e-Paper\n\nThe View From IndiaLooking at World Affairs from the Indian perspective.\n\nKarnataka TodayYour daily dose of news highlights from Karnataka\n\nFirst Day First ShowNews and reviews from the world of cinema and streaming.\n\nToday's CacheYour download of the top 5 technology stories of the day.\n\nScience For AllThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\n\nData PointDecoding the headlines with facts, figures, and numbers\n\nHealth MattersRamya Kannan writes to you on getting to good health, and staying there\n\nThe Hindu On BooksBooks of the week, reviews, excerpts, new titles and features.\n\nApril 18, 2025e-Paper\n\nUpdated- April 18, 2025 03:21 pm IST - CHENNAI\n\nTamil Nadu Chief Minister M.K. Stalin. File \n                                          | Photo Credit: S. Siva Saravanan\n\nTamil Nadu Chief Minister M.K. Stalin on Friday (April 18, 2025) reminded Prime Minister Narendra Modi about his statements as Gujarat Chief Minister over seeking funds from the Union government. He also asked if Union Home Minister Amit Shah could guarantee that delimitation would not reduce Tamil Nadu’s representation, exempt the State from the ambit of NEET, and assure that Hindi would not be imposed.\n\nDuring a government function at Ponneri in Tiruvallur district, Mr. Stalin recalledMr. Modi’s commentsmade during his recent visit to Rameswaram that those in Tamil Nadu were “crying” for funds, Mr. Stalin: “What did he say? How much ever is given, those here are crying. He is saying we were crying irrespective of how much ever they give us.”\n\nMr. Stalin said: “With complete humility and respect, I want to remind the Prime Minister, it was you [Mr. Modi] who said that the States were not beggars to extend hands to the Union government for funds. I am only reminding you.”\n\nRecalling more statements, Mr. Stalin said: “What did you speak while being the Gujarat Chief Minister? That they were running a parallel government through the Governors? Who said it then? Modi said it when he was the Gujarat Chief Minister. He said the Union government was partisan in allocating funds to States run by parties [that were in opposition to the Union government.”\n\nTo get today’s top stories from the State in your inbox, subscribe to ourTamil Nadu Today newsletter\n\nPointing out Tamil Nadu’s demands to the Union government for funds, Mr. Stalin said: “When we ask the same, how is to justified to say we are crying for funds? My asking is not crying but the right of Tamil Nadu. I am neither the one for crying nor the one who crawls and falls at someone’s feet. Let us extend our hands to our relations and voice out for our rights. Who taught us this? It was our leader Kalaignar [Karunanidhi]. I am following in his footsteps.”\n\nDuring his recent visit to Chennai,Union Home Minister Amit Shah claimedthat we were raising certain issues only as a diversionary tactic, Mr. Stalin recalled and further contended: “Who has said this? Union Home Minister Amit Shah. Tamil Nadu is fighting for all the States in India. Is it wrong to ask for the rights of the State? Only because you did not do anything, we moved the Supreme Court against the Governor and obtained ahistoric judgment.”\n\nNot only the people of Tamil Nadu but those in the rest of the country too were aware of the struggle led by the DMK, Mr. Stalin said. “When this is the truth, those who are digressing from their path, need not lament that we are diverting. Honourable Union Home Minister Amit Shah! Can you say that Tamil Nadu would beexempted from the ambit of NEET? Can you guarantee that you would not impose Hindi? Can you list out how much funds you have sanctioned for Tamil Nadu so far?”\n\n“Can you assure that therepresentation of Tamil Nadu would not go down after the delimitation process? If what we ask for is diversion, why have not you given a clear explanation to the people of Tamil Nadu over these?” Mr. Stalin questioned.\n\nThe CM inaugurated over 6,700 projects that have been completed in Tiruvallur district at a total cost of ₹1,166 crore. He also laid the foundation for over 7,300 new projects and launched the distribution of welfare measures to over 2.02 lakh beneficiaries.\n\nMinister S.M. Nasar; MPs S. Jagathrakshakan and Sasikanth Senthil; legislators T.J. Govindarajan, Durai Chandrasekar, S. Chandran, V.G. Raajendran, A. Krishnaswamy, K. Ganapathy, S. Sudharsanam; Tiruvallur Collector M. Prathap and senior officials were present on the occasion.\n\nPublished- April 18, 2025 02:19 pm IST\n\nTamil Nadu/Hindi/Tamil/language/Delimitation\n\nCopyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\n\nBACK TO TOP\n\nTerms & conditions|Institutional Subscriber\n\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by ourcommunity guidelinesfor posting your comments.\n\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
      },
      {
        "title": "T.N. CM Stalin hits back at PM Modi over ‘crying for funds’ remark, reminds his statements as Gujarat CM",
        "author": "Unknown Author",
        "publication_date": "2025-04-18T08:49:07+00:00"
      }
    ]
  },
  "markdown_content": "## Political Exchange\\n\\nTamil Nadu Chief Minister M.K. Stalin has responded to Prime Minister Narendra Modi's recent comments about Tamil Nadu 'crying for funds' during his visit to Rameswaram. During a government function in Tiruvallur district, Stalin reminded the Prime Minister of his own statements as Gujarat Chief Minister.\\n\\n> \"With complete humility and respect, I want to remind the Prime Minister, it was you who said that the States were not beggars to extend hands to the Union government for funds,\" Stalin stated, referencing Modi's previous stance as Gujarat CM when he accused the Union government of running a parallel government through Governors and showing partisan behavior in fund allocation.\\n\\n## Challenges to Union Home Minister\\n\\nAddressing Union Home Minister Amit Shah's claims about raising diversionary issues, Stalin challenged him to provide guarantees on several matters affecting Tamil Nadu:\\n\\n* Can you say that Tamil Nadu would be exempted from the ambit of NEET?\\n* Can you guarantee that you would not impose Hindi?\\n* Can you assure that the representation of Tamil Nadu would not go down after the delimitation process?\\n\\n## Development Initiatives\\n\\nDuring the event, Stalin inaugurated over 6,700 completed projects in Tiruvallur district costing ₹1,166 crore, laid foundation for 7,300 new projects, and launched welfare measures benefiting over 2.02 lakh recipients."
}