{
  "title": "Indian telescopes shed light on elusive 'middleweight' black holes",
  "publication_date": "2024-01-15T12:34:31Z",
  "summary": "Astrophysicists from ARIES have detected an intermediate black hole in galaxy NGC 4395, located 4.3 million light-years from Earth. Using India's largest optical telescope, they found gas clouds orbiting the black hole at 545 km/s. The black hole weighs 22,000 times the Sun's mass and consumes matter at 6% of its maximum theoretical rate.",
  "content": "Astrophysicists from Aryabhatta Research Institute of Observational Sciences (ARIES), an autonomous institute of the Department of Science and Technology (DST), have successfully detected and measured the properties of an intermediate black hole (IMBH).\n\nIMBH which has remained elusive is found in a faint galaxy called NGC 4395 about 4.3 million light-years away from Earth.\n\nUsing the 3.6m Devasthal Optical Telescope (DOT) -- India's largest optical telescope --, the team found that gas clouds orbit the black hole at a distance of 125 light-minutes (around 2.25 billion kilometre) with a velocity dispersion of 545 km per second.\n\nIMBHs are thought to be the seeds that grow into supermassive black holes. However, their faint nature and location in small galaxies make them extremely difficult to observe. Unlike their larger counterparts, they don't generate bright emissions unless they're actively pulling in matter.\n\nThe team of astrophysicists, led by Shivangi Pandey studied NGC 4395 -- a low-luminosity active galaxy hosting one of the faintest actively feeding black holes ever observed. They used the 3.6m DOT, and its indigenously developed spectrograph and camera ADFOSC, along with the smaller 1.3m Devasthal Fast Optical Telescope (DFOT).\n\nThe results, published in the Astrophysical Journal, showed that the IMBH weighs about 22,000 times the Sun's mass, making it one of the most precisely measured intermediate-mass black holes. The black hole consumes matter at just 6 per cent of its maximum theoretical rate.",
  "category": "Science",
  "tags": [
    "astronomy",
    "black holes",
    "space research",
    "astrophysics",
    "telescopes",
    "ARIES",
    "India"
  ],
  "location": "Nainital, India",
  "source": {
    "title": "Indian telescopes shed light on elusive ‘middleweight’ black holes",
    "publication_date": 1744871671,
    "content": [
      {
        "title": "Indian telescopes shed light on elusive ‘middleweight’ black holes",
        "publication_date": "Unknown",
        "content": "0\n\nPowered by :\n\nNew Delhi: Astrophysicists from Aryabhatta Research Institute of Observational Sciences (ARIES), an autonomous institute of the Department of Science and Technology (DST), have successfully detected and measured the properties of an intermedia black hole (IMBH).\n\nIMBH which has remained elusive is found in a faint galaxy called NGC 4395 about 4.3 million light-years away from Earth.\n\nUsing the 3.6m Devasthal Optical Telescope (DOT) -- India's largest optical telescope --, the team found that gas clouds orbit the black hole at a distance of 125 light-minutes (around 2.25 billion kilometre) with a velocity dispersion of 545 km per second.\n\n“The discovery refines our understanding about how black holes, especially those that weigh between 100 and 100,000 Suns, grow and interact with their surroundings,” the scientists said.\n\nFor decades, astronomers have searched for a missing link in the cosmic black hole family: the elusive Intermediate-Mass Black Holes (IMBHs).\n\nIMBHs are thought to be the seeds that grow into supermassive black holes. However, their faint nature and location in small galaxies make them extremely difficult to observe.\n\nUnlike their larger counterparts, they don’t generate bright emissions unless they’re actively pulling in matter, making advanced observational techniques essential.\n\nThe team of astrophysicists, led by Shivangi Pandey studied NGC 4395 -- a low-luminosity active galaxy hosting one of the faintest actively feeding black holes ever observed.\n\nThey used the 3.6m DOT, and its indigenously developed spectrograph and camera ADFOSC, along with the smaller 1.3m Devasthal Fast Optical Telescope (DFOT) located at the Devasthal Observatory of ARIES in Uttarakhand’s Nainital.\n\nThe team monitored the object continuously for two nights using both telescopes and applied a special technique called spectrophotometric reverberation mapping.\n\nThis technique measures the delay between light emitted by the black hole's accretion disk and the surrounding gas clouds (broad-line region). This delay, or time lag, revealed the region's size and helped calculate the black hole’s mass, said the team.\n\nThe results, published in the Astrophysical Journal, showed that “the IMBH weighs about 22,000 times the Sun's mass, making it one of the most precisely measured intermediate-mass black holes. The black hole consumes matter at just 6 per cent of its maximum theoretical rate”.\n\n“The hunt for more IMBHs is far from over. Larger telescopes and advanced instruments will be key to uncovering these cosmic middleweights,” said Dr Suvendu Rakshit, a scientist at ARIES.\n\n(IANS)\n\nJoin and get latest news updates delivered to you via WhatsApp\n\nSubscribe to our Newsletter!"
      },
      {
        "title": "Indian telescopes shed light on elusive ‘middleweight’ black holes",
        "author": "Sambad English Bureau",
        "publication_date": "Unknown"
      }
    ],
    "authors": [],
    "source": "Sambad English",
    "image_url": "https://img-cdn.publive.online/fit-in/853x480/filters:format(webp)/sambad-english/media/media_files/2025/04/17/iv4d9pJBSHzWaqMIRc7d.jpg",
    "url": "https://sambadenglish.com/national-international-news/indian-telescopes-shed-light-on-elusive-middleweight-black-holes-8972777"
  },
  "markdown_content": "## Discovery Details\\nAstrophysicists from Aryabhatta Research Institute of Observational Sciences (ARIES), an autonomous institute of the Department of Science and Technology (DST), have successfully detected and measured the properties of an intermediate black hole (IMBH).\\n\\nIMBH which has remained elusive is found in a faint galaxy called NGC 4395 about 4.3 million light-years away from Earth.\\n\\n## Technical Observations\\nUsing the 3.6m Devasthal Optical Telescope (DOT) -- India's largest optical telescope --, the team found that gas clouds orbit the black hole at a distance of 125 light-minutes (around 2.25 billion kilometre) with a velocity dispersion of 545 km per second.\\n\\n## Scientific Context\\nIMBHs are thought to be the seeds that grow into supermassive black holes. However, their faint nature and location in small galaxies make them extremely difficult to observe. Unlike their larger counterparts, they don't generate bright emissions unless they're actively pulling in matter.\\n\\n## Research Details\\nThe team of astrophysicists, led by Shivangi Pandey studied NGC 4395 -- a low-luminosity active galaxy hosting one of the faintest actively feeding black holes ever observed. They used:\\n* The 3.6m DOT and its indigenously developed spectrograph and camera ADFOSC\\n* The smaller 1.3m Devasthal Fast Optical Telescope (DFOT)\\n\\n## Findings\\nThe results, published in the Astrophysical Journal, revealed:\\n* The IMBH weighs about 22,000 times the Sun's mass, making it one of the most precisely measured intermediate-mass black holes\\n* The black hole consumes matter at just 6 per cent of its maximum theoretical rate"
}