{
  "title": "Smartphone use linked to slower cognitive decline in older adults; CT scans may contribute to 5% of U.S. cancer cases; the health effects of e-cigarette use – Morning Medical Update",
  "publication_date": "2025-01-15T00:00:00Z",
  "summary": "A study of 400,000 older adults shows regular smartphone and internet use correlates with slower cognitive decline. CT scans may be responsible for 5% of U.S. cancer cases annually due to radiation exposure. Research also indicates e-cigarette use increases risks of COPD and potential hypertension, though traditional cigarettes pose greater health risks.",
  "content": "Older adults who regularly use smartphones, computers or the internet demonstrated slower rates of cognitive decline, according to an analysis of more than 400,000 people over 50. Published in Nature Human Behavior, the study found no support for the idea of \"digital dementia\" and suggests that mentally active, socially connected technology use may benefit cognitive health.\n\nA new study in JAMA Internal Medicine estimates that CT scans could account for 103,000 U.S. cancer diagnoses annually — about 5% of all cases — due to radiation exposure from the 93 million scans performed each year. Researchers urge more careful use of imaging and dose optimization, especially for low-value or unnecessary scans.\n\nA Johns Hopkins-led analysis of nearly 250,000 adults found exclusive e-cigarette use to be associated with a higher risk of developing COPD and, in adults aged 30-70, a slightly increased risk of hypertension. Published in Nicotine & Tobacco Research, the study adds to growing evidence of vaping's health risks — though use of traditional cigarettes remains more strongly linked to chronic disease.",
  "category": "Health",
  "tags": [
    "healthcare",
    "medical research",
    "smartphones",
    "cognitive health",
    "CT scans",
    "cancer",
    "e-cigarettes",
    "COPD",
    "aging",
    "technology"
  ],
  "location": "United States",
  "source": {
    "title": "Smartphone use linked to slower cognitive decline in older adults; CT scans may contribute to 5% of U.S. cancer cases; the health effects of e-cigarette use – Morning Medical Update",
    "publication_date": 1744882200,
    "content": [
      {
        "title": "Smartphone use linked to slower cognitive decline in older adults; CT scans may contribute to 5% of U.S. cancer cases; the health effects of e-cigarette use – Morning Medical Update",
        "publication_date": "Unknown",
        "content": "News\n\nArticle\n\nAuthor(s):\n\nThe top news stories in medicine today.\n\n© Rido - stock.adobe.com\n\nSmartphone use linked to slower cognitive decline in older adults\n\nOlder adults who regularly use smartphones, computers or the internet demonstrated slower rates of cognitive decline, according to an analysis of more than 400,000 people over 50. Published inNature Human Behavior,the study found no support for the idea of “digital dementia” and suggests that mentally active, socially connected technology use may benefit cognitive health.The Guardianhas more.\n\nCT scans may contribute to 5% of U.S. cancer cases\n\nA new study inJAMA Internal Medicineestimates that CT scans could account for 103,000 U.S. cancer diagnoses annually — about 5% of all cases — due to radiation exposure from the 93 million scans performed each year. Researchers urge more careful use of imaging and dose optimization, especially for low-value or unnecessary scans. Read more fromNPR.\n\nE-cigarette use linked to COPD, possible rise in blood pressure\n\nA Johns Hopkins-led analysis of nearly 250,000 adults found exclusive e-cigarette use to be associated with a higher risk of developing COPD and, in adults aged 30-70, a slightly increased risk of hypertension. Published inNicotine & Tobacco Research, the study adds to growing evidence of vaping’s health risks — though use of traditional cigarettes remains more strongly linked to chronic disease.\n\n1 in 4 physicians support a TikTok ban, citing health misinformation\n\nEp. 60: Strategic planning with Stephen A. Dickens of SVMIC\n\nBruker launches two-photon miniscope for freely behaving animal imaging\n\nEp. 59: AI and claim denials with Neal K. Shah, co-founder of Counterforce Health\n\nWhat health care organizations should look for in an interoperability partner\n\nProtecting your family beyond practice: Why physicians need a digital estate debt strategy\n\n1 in 4 physicians support a TikTok ban, citing health misinformation\n\nEp. 60: Strategic planning with Stephen A. Dickens of SVMIC\n\nBruker launches two-photon miniscope for freely behaving animal imaging\n\nEp. 59: AI and claim denials with Neal K. Shah, co-founder of Counterforce Health\n\nWhat health care organizations should look for in an interoperability partner\n\nProtecting your family beyond practice: Why physicians need a digital estate debt strategy\n\n2 Commerce DriveCranbury, NJ 08512\n\n609-716-7777"
      },
      {
        "title": "Smartphone use linked to slower cognitive decline in older adults; CT scans may contribute to 5% of U.S. cancer cases; the health effects of e-cigarette use – Morning Medical Update",
        "author": "Unknown Author",
        "publication_date": "Unknown"
      }
    ],
    "authors": [],
    "source": "Medical Economics",
    "image_url": null,
    "url": "https://www.medicaleconomics.com/view/smartphone-use-linked-to-slower-cognitive-decline-in-older-adults-ct-scans-may-contribute-to-5-of-u-s-cancer-cases-the-health-effects-of-e-cigarette-use-morning-medical-update"
  },
  "markdown_content": "## Health Technology & Cognition\\nRegular use of smartphones, computers, and internet access is associated with slower cognitive decline rates, according to an analysis of over 400,000 people aged 50+. Published in *Nature Human Behavior*, the study found no evidence supporting \"digital dementia\" concerns. Instead, findings suggest that mentally engaging and socially connected technology use may support cognitive health.\\n\\n## Medical Imaging Risks\\nA new study in *JAMA Internal Medicine* reveals CT scans may be responsible for approximately 103,000 U.S. cancer diagnoses annually—roughly 5% of all cases. This risk stems from radiation exposure across the 93 million scans performed yearly. Researchers advocate for:\\n* More selective use of imaging\\n* Optimization of radiation doses\\n* Reduction of low-value or unnecessary scans\\n\\n## E-Cigarette Health Impacts\\nA comprehensive Johns Hopkins-led study analyzing nearly 250,000 adults has identified new health risks associated with vaping. Published in *Nicotine & Tobacco Research*, the findings show:\\n* Exclusive e-cigarette users face elevated COPD risk\\n* Adults aged 30-70 show slightly increased hypertension risk\\n* Traditional cigarettes still pose greater chronic disease risks overall"
}