{
  "title": "GST on UPI transactions over ₹2,000? Government denies reports",
  "publication_date": "2025-04-18T15:44:51+05:30",
  "summary": "The Indian Finance Ministry has strongly denied media reports suggesting the implementation of GST on UPI transactions exceeding ₹2,000. The ministry clarified that no such proposal is under consideration, emphasizing their commitment to promoting digital payments through UPI with continued incentive schemes for small merchants.",
  "content": "The government has denied media reports claiming it is considering proposals to levy goods and services tax (GST) on unified payments interface (UPI) transactions exceeding ₹2,000. The finance ministry clarified on April 18 that such claims are \"completely false, misleading, and without any basis.\"\n\nEarlier reports had suggested that digital payments made via UPI exceeding the ₹2,000 threshold might face an 18% GST rate. However, the finance ministry emphasized that since no Merchant Discount Rate (MDR) is currently charged on UPI transactions, no GST is consequently applicable.\n\nThe government maintains its commitment to promoting digital payments via UPI through various incentive schemes operational since FY 2021-22. The scheme specifically targets low-value UPI Person-to-Merchant transactions, with increasing allocations over the years:\n\n- FY2021-22: ₹1,389 crore\n- FY2022-23: ₹2,210 crore\n- FY2023-24: ₹3,631 crore\n\nIndia's digital payment ecosystem has shown remarkable growth, accounting for 49% of global real-time transactions in 2023. UPI transaction values have grown exponentially from ₹21.3 lakh crore in FY 2019-20 to ₹260.56 lakh crore by March 2025, with Person-to-Merchant transactions reaching ₹59.3 lakh crore.",
  "category": "Business",
  "tags": [
    "UPI",
    "GST",
    "digital payments",
    "finance",
    "India",
    "government policy",
    "banking"
  ],
  "location": "India",
  "source": {
    "title": "7 unseen NASA images that redefine the beauty of space",
    "publication_date": 1744925958,
    "content": [
      {
        "title": "GST on UPI transactions over  ₹2,000? Here’s what you need to know | Mint",
        "publication_date": "2025-04-18T15:44:51+05:30",
        "content": "GST on UPI payments:The government has denied media reports claiming it is considering proposals to levygoods and services tax (GST)onunified payments interface (UPI)transactions exceeding₹2,000. The finance ministry clarified on April 18 that claims that it is considering levying GST on UPI transactions over₹2,000 are “completely false, misleading, and without any basis.” Currently, no such proposal is before the government.\n\nEarlier today, certain media reports claimed thatdigital paymentsmade via UPI exceeding the₹2,000 threshold in a single transaction may be brought under the GST framework for compliance. This aimed to enhance tax compliance and bring more digital transactions into the formal economy.\n\n“If approved, an 18 per cent GST, the standard rate for most digital services, could be levied on high-value transactions. The proposal is still under consideration. The move could significantly shift India’s UPI ecosystem, which has been a cost-free, user-friendly platform,” claimed the reports.\n\nThe finance ministry said that GST is levied on charges, such as the Merchant Discount Rate (MDR), relating to payments made using certain instruments. Effective January 2020, theCentral Board of Direct Taxes (CBDT)has removed the MDR on Person-to-Merchant (P2M) UPI transactions through the Gazette Notification dated December 30, 2019.\n\nSince no MDR is currently charged on UPI transactions, no GST is consequently applicable. The government remainscommittedto promoting digital payments via UPI. A government-led incentive scheme has been operational from FY 2021-22 to support and sustain UPI's growth.\n\n“This scheme targets low-value UPI (P2M) transactions, benefiting small merchants by alleviating transaction costs and promoting wider participation and innovation in digital payments,” said the finance ministry.\n\nThe total incentive payouts under this scheme over the years reflect the Government’s sustained commitment to promoting UPI-based digital payments. Allocation under the scheme over the years has been:\n\n• FY2021-22:₹1,389 crore\n\n• FY2022-23:₹2,210 crore\n\n• FY2023-24:₹3,631 crore\n\nThese measures have significantly contributed to India’s robust digital payments ecosystem. According to the ACI Worldwide Report 2024, India accounted for 49 per cent of global real-time transactions in 2023, reaffirming its position as a global leader in digital payments innovation.\n\nUPI transactionvalues have increased exponentially, from₹21.3 lakh crore in FY 2019-20 to₹260.56 lakh crore by March 2025. Specifically, P2M transactions have reached₹59.3 lakh crore, reflecting growing merchant adoption and consumer confidence in digital payment methods.\n\nCatch all theBusiness News,Economy news,Breaking NewsEvents andLatest NewsUpdates on Live Mint. Download TheMint News Appto get Daily Market Updates.\n\nDownload the Mint app and read premium stories\n\nLog in to our website to save your bookmarks. It'll just take a moment."
      },
      {
        "title": "GST on UPI transactions over  ₹2,000? Here’s what you need to know | Mint",
        "author": "Livemint",
        "publication_date": "2025-04-18T15:44:51+05:30"
      }
    ],
    "authors": [
      "Moushumi Mahanta"
    ],
    "source": "Mint",
    "image_url": "https://www.livemint.com/lm-img/img/2025/04/18/900x1600/pexels-miriamespacio-110854_1744964824184_1744964829354.jpg",
    "url": "https://www.livemint.com/web-stories/7-unseen-nasa-images-that-redefine-the-beauty-of-space-visual-story-11744964748060.html"
  },
  "markdown_content": "## Government Statement\\nThe government has denied media reports claiming it is considering proposals to levy goods and services tax (GST) on unified payments interface (UPI) transactions exceeding ₹2,000. The finance ministry clarified on April 18 that such claims are \"completely false, misleading, and without any basis.\"\\n\\nEarlier reports had suggested that digital payments made via UPI exceeding the ₹2,000 threshold might face an 18% GST rate. However, the finance ministry emphasized that since no Merchant Discount Rate (MDR) is currently charged on UPI transactions, no GST is consequently applicable.\\n\\n## Incentive Schemes\\nThe government maintains its commitment to promoting digital payments via UPI through various incentive schemes operational since FY 2021-22. The scheme specifically targets low-value UPI Person-to-Merchant transactions, with increasing allocations over the years:\\n\\n* FY2021-22: ₹1,389 crore\\n* FY2022-23: ₹2,210 crore\\n* FY2023-24: ₹3,631 crore\\n\\n## Growth Metrics\\nIndia's digital payment ecosystem has shown remarkable growth, accounting for 49% of global real-time transactions in 2023. UPI transaction values have grown exponentially from ₹21.3 lakh crore in FY 2019-20 to ₹260.56 lakh crore by March 2025, with Person-to-Merchant transactions reaching ₹59.3 lakh crore."
}