{
  "title": "Inside the Luxurious Residence of SRH Owners Kalanithi and Kavya Maran",
  "publication_date": "2025-04-17T17:54:00Z",
  "summary": "Kalanithi Maran, founder of Sun Group and owner of Sunrisers Hyderabad, owns a Rs 100 crore mansion acquired from HSBC in 2001. The property features high walls, sprawling grounds, and connects to his business headquarters at Murasoli Maran Towers, where he operates his vast media empire spanning television, radio, and publications.",
  "content": "Kalanithi Maran, the founder and chairman of Sun Group, inhabits a luxurious mansion valued at approximately Rs 100 crore, equivalent to the cost of 20 premium three-bedroom apartments in upscale Chennai neighborhoods.\n\nThe property, acquired through an HSBC auction in 2001, is characterized by its imposing walls and expansive open areas. The family's business operations are conducted from the 11th floor of the Murasoli Maran Towers in MRC Nagar, where Maran arrives in his Bentley, part of a fleet of family vehicles bearing the distinctive registration number 1515.\n\nMaran's office occupies nearly the entire top floor, accessed via a private elevator. The workspace features multiple television monitors for overseeing his media empire, which includes 21 channels broadcasting in Tamil, Telugu, Malayalam, and Kannada. The Sun Group's holdings extend to 45 FM radio stations, various publications, a cable TV network, and DTH broadcasting services.\n\nKavya Maran, Kalanithi's daughter, serves as the CEO of Sunrisers Hyderabad since 2018, with both father and daughter sharing ownership of the cricket franchise.",
  "category": "Business",
  "tags": [
    "real estate",
    "media industry",
    "business tycoons",
    "cricket",
    "Indian business",
    "luxury property",
    "Sun Group"
  ],
  "location": "Chennai, India",
  "source": {
    "title": "Mukesh Ambani and Nita Ambani to vacate their Rs 15000 crore luxurious residence Antilia? Politician claims…",
    "publication_date": 1744858104,
    "content": [
      {
        "title": "Step inside SRH owner Kalanithi Maran and daughter Kavya Maran's luxurious house, it's worth Rs...",
        "publication_date": "Unknown",
        "content": "click this icon for latest updates\n\nclick this icon for latest updates\n\nPublished: April 17, 2025, 5:54 PM IST\n\nByAkshat Jain\n\nIn this collection of pictures we shall take a look into SRH owner Kalanithi Maran and daughter Kavya Maran's luxurious house.\n\nKalanithi Maran, the founder and chairman of Sun Group, is a prominent figure in the Indian media industry. His vast empire spans television networks, print media, weekly publications, FM radio channels, direct-to-home (DTH) services, a cricket franchise, Sunrisers Hyderabad and a film production house. Additionally, between 2010 and 2015, he held a major share in the Indian airline SpiceJet.\n\nThe mansion is valued at approximately Rs 100 crore according to indextap report, a sum that could purchase around 20 three-bedroom apartments in the premium neighborhoods of Poes Garden and Nungambakkam.\n\nThe bungalow was acquired via an auction from HSBC back in 2001, the property is enclosed by towering walls. As the gates swing open, they reveal a sprawling open area that greets visitors.\n\nKalanithi Maran conducts business from the 11th floor of the Murasoli Maran Towers located in MRC Nagar. He arrives in his Bentley at work, with all family vehicles bearing the registration number 1515. Upon arrival, he uses a private elevator that takes him directly to his expansive office, which spans nearly the whole top floor.\n\nThe walls of his office are adorned with multiple television monitors, enabling him to keep an eye on the 21 channels he operates across four regional languages—Tamil, Telugu, Malayalam, and Kannada. His vast media empire further encompasses 45 FM radio stations, several publications, a cable TV network, and a direct-to-home (DTH) broadcasting service.\n\nKavya Maran serves as the Chief Executive Officer of Sunrisers Hyderabad. She is the daughter of Kalanithi Maran, the founder and head of the Sun Group. As per various media sources, both Kalanithi and Kavya jointly hold ownership of the SRH team. Kavya took over the role of CEO for the franchise back in 2018.\n\nBy clicking “Accept All Cookies”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts.Cookies Policy."
      },
      {
        "title": "Step inside SRH owner Kalanithi Maran and daughter Kavya Maran's luxurious house, it's worth Rs...",
        "author": "Unknown Author",
        "publication_date": "Unknown"
      }
    ],
    "authors": [
      "Victor Dasgupta"
    ],
    "source": "India.Com",
    "image_url": "https://static.india.com/wp-content/uploads/2025/04/India.com-2025-04-13T160626.710.jpg?impolicy=Medium_Resize&w=1200&h=800",
    "url": "https://www.india.com/news/india/mukesh-ambani-antilia-nita-ambani-waqf-law-reliance-industries-anant-ambani-vantara-akash-ambani-campa-cola-asaduddin-owaisi-aimim-kareem-bhai-ibrahim-currimbhoy-ebrahim-khoja-yateemkhana-7760770/"
  },
  "markdown_content": "## The Sun Group Empire\\n\\nKalanithi Maran, the founder and chairman of Sun Group, inhabits a luxurious mansion valued at approximately Rs 100 crore, equivalent to the cost of 20 premium three-bedroom apartments in upscale Chennai neighborhoods.\\n\\nThe property, acquired through an HSBC auction in 2001, is characterized by its imposing walls and expansive open areas. The family's business operations are conducted from the 11th floor of the Murasoli Maran Towers in MRC Nagar, where Maran arrives in his Bentley, part of a fleet of family vehicles bearing the distinctive registration number 1515.\\n\\n## Corporate Headquarters\\n\\nMaran's office occupies nearly the entire top floor, accessed via a private elevator. The workspace features multiple television monitors for overseeing his media empire, which includes:\\n\\n* 21 channels broadcasting in Tamil, Telugu, Malayalam, and Kannada\\n* 45 FM radio stations\\n* Various publications\\n* Cable TV network\\n* DTH broadcasting services\\n\\n## Leadership\\n\\nKavya Maran, Kalanithi's daughter, serves as the CEO of Sunrisers Hyderabad since 2018, with both father and daughter sharing ownership of the cricket franchise."
}