{
  "title": "Inside SRH Owner Kalanithi Maran and Kavya Maran's Luxurious Residence",
  "publication_date": "2025-04-17T17:54:00Z",
  "summary": "A glimpse into the Rs 100 crore mansion of Sun Group founder Kalanithi Maran and his daughter Kavya Maran, owners of Sunrisers Hyderabad cricket team. The property, acquired from HSBC in 2001, features extensive grounds and high walls. Kalanithi operates from Murasoli Maran Towers, arriving in his Bentley, while overseeing his vast media empire.",
  "content": "Kalanithi Maran, the founder and chairman of Sun Group, resides in a luxurious mansion valued at approximately Rs 100 crore. The property, which was acquired through an auction from HSBC in 2001, could equal the value of 20 three-bedroom apartments in premium Chennai neighborhoods like Poes Garden and Nungambakkam.\n\nThe mansion is characterized by its towering walls and sprawling open area that welcomes visitors as they enter through the gates. \n\nKalanithi Maran conducts his business operations from the 11th floor of the Murasoli Maran Towers in MRC Nagar. He commutes in his Bentley, with all family vehicles sporting the registration number 1515. His office space occupies nearly the entire top floor, accessible via a private elevator.\n\nHis office features multiple television monitors on the walls, allowing him to monitor his 21 channels broadcasting in four regional languages: Tamil, Telugu, Malayalam, and Kannada. His media conglomerate includes 45 FM radio stations, various publications, a cable TV network, and a DTH broadcasting service.\n\nHis daughter, Kavya Maran, serves as the Chief Executive Officer of Sunrisers Hyderabad cricket team since 2018, with both father and daughter sharing ownership of the franchise.",
  "category": "Business",
  "tags": [
    "real estate",
    "luxury homes",
    "business tycoons",
    "media industry",
    "cricket",
    "IPL",
    "Sun Group",
    "Sunrisers Hyderabad"
  ],
  "location": "Chennai, India",
  "source": {
    "title": "Sara Tendulkar enjoys vacation with star cricketer's daughter, they are partying in...",
    "publication_date": 1744949116,
    "content": [
      {
        "title": "Step inside SRH owner Kalanithi Maran and daughter Kavya Maran's luxurious house, it's worth Rs...",
        "publication_date": "Unknown",
        "content": "click this icon for latest updates\n\nclick this icon for latest updates\n\nPublished: April 17, 2025, 5:54 PM IST\n\nByAkshat Jain\n\nIn this collection of pictures we shall take a look into SRH owner Kalanithi Maran and daughter Kavya Maran's luxurious house.\n\nKalanithi Maran, the founder and chairman of Sun Group, is a prominent figure in the Indian media industry. His vast empire spans television networks, print media, weekly publications, FM radio channels, direct-to-home (DTH) services, a cricket franchise, Sunrisers Hyderabad and a film production house. Additionally, between 2010 and 2015, he held a major share in the Indian airline SpiceJet.\n\nThe mansion is valued at approximately Rs 100 crore according to indextap report, a sum that could purchase around 20 three-bedroom apartments in the premium neighborhoods of Poes Garden and Nungambakkam.\n\nThe bungalow was acquired via an auction from HSBC back in 2001, the property is enclosed by towering walls. As the gates swing open, they reveal a sprawling open area that greets visitors.\n\nKalanithi Maran conducts business from the 11th floor of the Murasoli Maran Towers located in MRC Nagar. He arrives in his Bentley at work, with all family vehicles bearing the registration number 1515. Upon arrival, he uses a private elevator that takes him directly to his expansive office, which spans nearly the whole top floor.\n\nThe walls of his office are adorned with multiple television monitors, enabling him to keep an eye on the 21 channels he operates across four regional languages—Tamil, Telugu, Malayalam, and Kannada. His vast media empire further encompasses 45 FM radio stations, several publications, a cable TV network, and a direct-to-home (DTH) broadcasting service.\n\nKavya Maran serves as the Chief Executive Officer of Sunrisers Hyderabad. She is the daughter of Kalanithi Maran, the founder and head of the Sun Group. As per various media sources, both Kalanithi and Kavya jointly hold ownership of the SRH team. Kavya took over the role of CEO for the franchise back in 2018.\n\nBy clicking “Accept All Cookies”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts.Cookies Policy."
      },
      {
        "title": "Step inside SRH owner Kalanithi Maran and daughter Kavya Maran's luxurious house, it's worth Rs...",
        "author": "Unknown Author",
        "publication_date": "Unknown"
      }
    ],
    "authors": [
      "Devadyuti Das"
    ],
    "source": "India.Com",
    "image_url": "https://st1.photogallery.ind.sh/wp-content/uploads/indiacom/sara-tendulkar-enjoys-vacation-with-star-cricketers-daughter-they-are-partying-in-202504-1744968462.jpg",
    "url": "https://www.india.com/photos/sports/sara-tendulkar-enjoys-vacation-with-star-cricketers-daughter-they-are-partying-in-grace-hayden-matthew-hayden-438484/"
  },
  "markdown_content": "## Property Details\\nThe founder and chairman of Sun Group, Kalanithi Maran, resides in a luxurious mansion valued at approximately Rs 100 crore. The property, which was acquired through an auction from HSBC in 2001, could equal the value of 20 three-bedroom apartments in premium Chennai neighborhoods like Poes Garden and Nungambakkam.\\n\\nThe mansion is characterized by its towering walls and sprawling open area that welcomes visitors as they enter through the gates.\\n\\n## Business Operations\\nKalanithi Maran conducts his business operations from the 11th floor of the Murasoli Maran Towers in MRC Nagar. He commutes in his Bentley, with all family vehicles sporting the registration number 1515. His office space occupies nearly the entire top floor, accessible via a private elevator.\\n\\n## Media Empire\\nHis office features multiple television monitors on the walls, allowing him to monitor his 21 channels broadcasting in four regional languages:\\n* Tamil\\n* Telugu\\n* Malayalam\\n* Kannada\\n\\nHis media conglomerate includes:\\n* 45 FM radio stations\\n* Various publications\\n* A cable TV network\\n* A DTH broadcasting service\\n\\n## Family Business Involvement\\nHis daughter, Kavya Maran, serves as the Chief Executive Officer of Sunrisers Hyderabad cricket team since 2018, with both father and daughter sharing ownership of the franchise."
}