{
  "title": "Apple will spend more than $500 billion in the U.S. over the next four years",
  "publication_date": "2025-02-24T00:00:00Z",
  "summary": "Apple announces its largest-ever spending commitment of $500 billion in the US over four years. The investment includes a new manufacturing facility in Houston, doubling the Advanced Manufacturing Fund to $10 billion, and expanding R&D initiatives. Plans include AI development, silicon engineering, and establishing a Manufacturing Academy in Detroit. The company will create thousands of jobs and support advanced manufacturing across multiple states.",
  "content": "Apple today announced its largest-ever spend commitment, with plans to spend and invest more than $500 billion in the U.S. over the next four years. This new pledge builds on Apple's long history of investing in American innovation and advanced high-skilled manufacturing, and will support a wide range of initiatives that focus on artificial intelligence, silicon engineering, and skills development.\n\nAs part of this package of U.S. investments, Apple and partners will open a new advanced manufacturing facility in Houston to produce servers that support Apple Intelligence. Apple will also double its U.S. Advanced Manufacturing Fund, create an academy in Michigan to train the next generation of U.S. manufacturers, and grow its research and development investments.\n\nThe $500 billion commitment includes work with thousands of suppliers across all 50 states, direct employment, Apple Intelligence infrastructure and data centers, corporate facilities, and Apple TV+ productions in 20 states. Apple currently supports more than 2.9 million jobs across the country.\n\nThe company plans to hire around 20,000 people, primarily focused on R&D, silicon engineering, software development, and AI/machine learning. The Advanced Manufacturing Fund will increase from $5 billion to $10 billion, including a multibillion-dollar commitment to produce advanced silicon in TSMC's Arizona facility.\n\nTo support skills development, Apple will open the Apple Manufacturing Academy in Detroit, offering free courses and consulting services for small and medium-sized businesses on AI and smart manufacturing techniques.",
  "category": "Business",
  "tags": [
    "Apple",
    "technology",
    "manufacturing",
    "investment",
    "jobs",
    "artificial intelligence",
    "silicon",
    "education",
    "economy",
    "innovation"
  ],
  "location": "United States",
  "source": {
    "title": "Apple will spend more than $500 billion in the U.S. over the next four years",
    "publication_date": 1740364200,
    "content": [
      {
        "title": "Apple will spend more than $500 billion in the U.S. over the next four years",
        "publication_date": "Unknown",
        "content": "Text of this article\n\nFebruary 24, 2025\n\nPRESS RELEASE\n\nApple will spend more than $500 billion in the U.S. over the next four years\n\nTeams and facilities to expand in Michigan, Texas, California, Arizona, Nevada, Iowa, Oregon, North Carolina, and WashingtonPlans include a new factory in Texas, doubling the U.S. Advanced Manufacturing Fund, a manufacturing academy, and accelerated investments in AI and silicon engineering\n\nCUPERTINO, CALIFORNIAApple today announced its largest-ever spend commitment, with plans to spend and invest more than $500 billion in the U.S. over the next four years. This new pledge builds on Apple’s long history of investing in American innovation and advanced high-skilled manufacturing, and will support a wide range of initiatives that focus on artificial intelligence, silicon engineering, and skills development for students and workers across the country.\n\n“We are bullish on the future of American innovation, and we’re proud to build on our long-standing U.S. investments with this $500 billion commitment to our country’s future,” said Tim Cook, Apple’s CEO. “From doubling our Advanced Manufacturing Fund, to building advanced technology in Texas, we’re thrilled to expand our support for American manufacturing. And we’ll keep working with people and companies across this country to help write an extraordinary new chapter in the history of American innovation.”\n\nAs part of this package of U.S. investments, Apple and partners will open a new advanced manufacturing facility in Houston to produce servers that support Apple Intelligence, the personal intelligence system that helps users write, express themselves, and get things done. Apple will also double its U.S. Advanced Manufacturing Fund, create an academy in Michigan to train the next generation of U.S. manufacturers, and grow its research and development investments in the U.S. to support cutting-edge fields like silicon engineering.\n\nThe $500 billion commitment includes Apple’s work with thousands of suppliers across all 50 states, direct employment, Apple Intelligence infrastructure and data centers, corporate facilities, and Apple TV+ productions in 20 states. Apple remains one of the largest U.S. taxpayers, having paid more than $75 billion in U.S. taxes over the past five years, including $19 billion in 2024 alone.\n\nToday, Apple supports more than 2.9 million jobs across the country through direct employment, work with U.S.-based suppliers and manufacturers, and developer jobs in the thriving iOS app economy.\n\nOpening a New Manufacturing Facility in Houston\n\nAs part of its new U.S. investments, Apple will work with manufacturing partners to begin production of servers in Houston later this year. A 250,000-square-foot server manufacturing facility, slated to open in 2026, will create thousands of jobs.\n\nPreviously manufactured outside the U.S., the servers that will soon be assembled in Houston play a key role in powering Apple Intelligence, and are the foundation of Private Cloud Compute, which combines powerful AI processing with the most advanced security architecture ever deployed at scale for AI cloud computing. The servers bring together years of R&D by Apple engineers, and deliver the industry-leading security and performance of Apple silicon to the data center.\n\nTeams at Apple designed the servers to be incredibly energy efficient, reducing the energy demands of Apple data centers — which already run on 100 percent renewable energy. As Apple brings Apple Intelligence to customers across the U.S., it also plans to continue expanding data center capacity in North Carolina, Iowa, Oregon, Arizona, and Nevada.\n\nDoubling Apple’s U.S. Advanced Manufacturing Fund\n\nAs part of this new investment, Apple is doubling its U.S. Advanced Manufacturing Fund, which was created in 2017 to support world-class innovation and high-skilled manufacturing jobs across America. The growing commitment will increase the fund from $5 billion to $10 billion, focused on promoting advanced manufacturing and skills development throughout the country.\n\nThe fund’s expansion includes a multibillion-dollar commitment from Apple to produce advanced silicon in TSMC’s Fab 21 facility in Arizona. Apple is the largest customer at this state-of-the-art facility, which employs more than 2,000 workers to manufacture the chips in the United States. Mass production of Apple chips began last month.\n\nSilicon used by Apple is designed to bring Apple users incredible features, performance, and power efficiency across their devices. Apple’s suppliers already manufacture silicon in 24 factories across 12 states, including Arizona, Colorado, Oregon, and Utah. The company’s investments in the sector help create thousands of high-paying jobs across the country at U.S. companies like Broadcom, Texas Instruments, Skyworks, and Qorvo.\n\nTo date, Apple’s U.S. Advanced Manufacturing Fund has supported projects in 13 states — including Kentucky, Pennsylvania, Texas, and Indiana — that have helped build local businesses, train workers, and create a wide range of innovative manufacturing processes and materials for Apple products.\n\nGrowing R&D Investments Across the U.S.\n\nApple continues to expand its R&D across the U.S. In the past five years, Apple has nearly doubled its U.S.-based advanced R&D spend, and it will continue to accelerate its growth.\n\nRecently, Apple announced the newest addition to its iPhone lineup, iPhone 16e. iPhone 16e delivers fast, smooth performance and breakthrough battery life, thanks to the industry-leading efficiency of the A18 chip and the new Apple C1 — the first cellular modem designed by Apple, and the most power-efficient modem ever on an iPhone. Apple C1 adds a new chapter to the story of Apple silicon and is the result of years of R&D investment, bringing together the work of thousands of engineers. Apple C1 is the start of a long-term strategy that will allow Apple to innovate and optimize the modem system for additional Apple products.\n\nIn the next four years, Apple plans to hire around 20,000 people, of which the vast majority will be focused on R&D, silicon engineering, software development, and AI and machine learning. The expanded commitment includes significant investment in Apple’s R&D hubs across the country. This includes growing teams across the U.S. focused on areas including custom silicon, hardware engineering, software development, artificial intelligence, and machine learning.\n\nSupporting American Businesses with a New Manufacturing Academy in Detroit\n\nTo help companies transition to advanced manufacturing, Apple will open the Apple Manufacturing Academy in Detroit. Apple engineers, along with experts from top universities such as Michigan State, will consult with small- and medium-sized businesses on implementing AI and smart manufacturing techniques. The academy will also offer free in-person and online courses, with a skills development curriculum that teaches workers vital skills like project management and manufacturing process optimization. The courses will help drive productivity, efficiency, and quality in companies’ supply chains.\n\nApple has long been committed to investing in education and skills development for American workers and students. That includes ongoing and expanding grant programs for organizations like 4-H, Boys & Girls Clubs of America, and FIRST, which work closely with Apple in communities across the country to create free programming that helps young people learn vital skills like coding.\n\nApple’s support for the next generation of innovators also includes efforts like the company’s New Silicon Initiative, which prepares students for careers in hardware engineering and silicon chip design. Last year, this program expanded to students at Georgia Tech, and it now reaches students at eight schools across the country. Apple is continuing to expand the initiative, including a new collaboration with UCLA’s Center for Education of Microchip Designers (CEMiD) beginning this year.\n\nPress Contacts\n\nNick Leahy\n\nApple\n\nnleahy@apple.com\n\nAnna Mitchell\n\nApple\n\nanna_m@apple.com\n\nApple Media Helpline\n\nmedia.help@apple.com\n\nImages in this article\n\nApple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, AirPods, Apple Watch, and Apple Vision Pro. Apple’s six software platforms — iOS, iPadOS, macOS, watchOS, visionOS, and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay, iCloud, and Apple TV+. Apple’s more than 150,000 employees are dedicated to making the best products on earth and to leaving the world better than we found it.\n\nNick Leahy\n\nApple\n\nnleahy@apple.com\n\nAnna Mitchell\n\nApple\n\nanna_m@apple.com\n\nApple Media Helpline\n\nmedia.help@apple.com\n\nThe latest news and updates,direct from Apple.\n\nRead more"
      },
      {
        "title": "Apple will spend more than $500 billion in the U.S. over the next four years",
        "author": "Unknown Author",
        "publication_date": "Unknown"
      }
    ],
    "authors": [],
    "source": "Apple",
    "image_url": "https://www.apple.com/newsroom/images/2025/02/apple-will-spend-more-than-500-billion-usd-in-the-us-over-the-next-four-years/article/Apple-US-investment-Austin-research-facility-01_big.jpg.large.jpg",
    "url": "https://www.apple.com/newsroom/2025/02/apple-will-spend-more-than-500-billion-usd-in-the-us-over-the-next-four-years/"
  },
  "markdown_content": "## Investment Overview\\nApple today announced its largest-ever spend commitment, with plans to spend and invest more than $500 billion in the U.S. over the next four years. This new pledge builds on Apple's long history of investing in American innovation and advanced high-skilled manufacturing, and will support a wide range of initiatives that focus on artificial intelligence, silicon engineering, and skills development.\\n\\n## Manufacturing and Infrastructure\\nAs part of this package of U.S. investments, Apple and partners will open a new advanced manufacturing facility in Houston to produce servers that support Apple Intelligence. Apple will also double its U.S. Advanced Manufacturing Fund, create an academy in Michigan to train the next generation of U.S. manufacturers, and grow its research and development investments.\\n\\n## Economic Impact\\nThe $500 billion commitment includes:\\n* Work with thousands of suppliers across all 50 states\\n* Direct employment\\n* Apple Intelligence infrastructure and data centers\\n* Corporate facilities\\n* Apple TV+ productions in 20 states\\n\\nApple currently supports more than 2.9 million jobs across the country.\\n\\n## Employment and Manufacturing Plans\\n* Plans to hire around 20,000 people, focusing on:\\n  - R&D\\n  - Silicon engineering\\n  - Software development\\n  - AI/machine learning\\n* Advanced Manufacturing Fund increase from $5 billion to $10 billion\\n* Multibillion-dollar commitment to produce advanced silicon in TSMC's Arizona facility\\n\\n## Skills Development\\nTo support skills development, Apple will open the Apple Manufacturing Academy in Detroit, offering free courses and consulting services for small and medium-sized businesses on AI and smart manufacturing techniques."
}