{
  "title": "Italy and US agree to oppose 'discriminatory' tech taxes",
  "publication_date": "2025-04-18T00:27:21+01:00",
  "summary": "Italy and the United States have jointly opposed discriminatory digital service taxes, potentially indicating Rome's shift away from its current 3% levy on major tech companies. The announcement came during Prime Minister Meloni's White House visit, where both nations agreed on creating a non-discriminatory environment for digital services taxation to encourage tech investments.",
  "content": "Italy and the United States have issued a joint statement against \"discriminatory\" taxes on digital services, in a possible signal that Rome is moving away from a levy that has irked Washington.\n\nEuropean levies aimed at hitting dominant US tech giants such as Alphabet's Google, Meta's Facebook, Apple and Amazon have been a longstanding irritant for US administrations, including Donald Trump's.\n\nItaly applies a 3% levy on revenue from internet transactions for digital companies with sales of at least €750 million, which is worth less than €500 million in revenue for the state each year.\n\n\"We agreed that a non-discriminatory environment in terms of digital services taxation is necessary to enable investments from cutting-edge tech companies,\" Italy and the US said following Prime Minister Meloni's visit to the White House on Thursday.\n\nThe statement also welcomed US investments in AI computing and cloud services in Italy to support Italy as the key regional data hub for the Mediterranean and North Africa.\n\nAmazon's computing unit AWS said last year it would invest €1.2bn in Italy over five years in a further expansion of its data centre business in the country.\n\nDespite the relatively small level of revenue the measure generates in a country with total budget spending topping €800bn, the Italian web tax remains a thorny issue for Ms Meloni, who must balance US pressure against her coalition's desire to secure funding from big tech companies.",
  "category": "Business",
  "tags": [
    "technology",
    "taxation",
    "international relations",
    "digital economy",
    "Italy",
    "United States",
    "tech companies"
  ],
  "location": "Italy",
  "source": {
    "title": "Italy and US agree to oppose 'discriminatory' tech taxes",
    "publication_date": 1744912641,
    "content": [
      {
        "title": "Italy and US agree to oppose 'discriminatory' tech taxes",
        "publication_date": "2025-04-18T00:27:21+01:00",
        "content": "Italy and the United States have issued a joint statement against \"discriminatory\" taxes on digital services, in a possible signal that Rome is moving away from a levy that has irked Washington.\n\nEuropean levies aimed at hitting dominant US tech giants such as Alphabet's Google, Meta's Facebook, Apple and Amazon have been a longstanding irritant for US administrations, including Donald Trump's.\n\nItaly applies a 3% levy on revenue from internet transactions for digital companies with sales of at least €750 million, which is worth less than €500 million in revenue for the state each year.\n\n\"We agreed that a non-discriminatory environment in terms of digital services taxation is necessary to enable investments from cutting-edge tech companies,\" Italy and the US said following Prime Minister Meloni's visit to the White House on Thursday.\n\nThe statement - which also said Mr Trump would pay an official visit to Italy in the near future - did not clarify whether Rome had committed to scrapping the tax.\n\nDespite the relatively small level of revenue the measure generates in a country with total budget spending topping €800bn, the Italian web tax is a thorny issue for Ms Meloni.\n\nWhile she has to deal with the US pressure, parties in her ruling coalition want her to increase pressure on big tech to secure funding needed to adopt costly measures without straining Italy's fragile public finances, political sources said.\n\nThe joint statement also welcomed US investments in AI computing and cloud services in Italy to support Italy as the key regional data hub for the Mediterranean and North Africa.\n\nAmazon's computing unit AWS said last year it would invest €1.2bn in Italy over five years in a further expansion of its data centre business in the country.\n\nWe need your consent to load this rte-player contentWe use rte-player to manage extra content that can set cookies on your device and collect data about your activity. Please review their details and accept them to load the content.Manage Preferences\n\nVance in Rome for talks amid EU tariff deal hopes\n\nUS Vice President JD Vance is in Rome for talks with Ms Meloni.\n\nMr Trump's threatened tariffs could have a major impact on Italy, the world's fourth-largest exporter, which sends around 10% of its exports to the United States.\n\nThe trip is also Mr Vance's first back to Europe since delivering a combative speech at the Munich Security Conference in February, in which he lambasted the EU's members on culture war issues while calling for the bloc to \"step up\" in managing its own security.\n\nMr Vance is also due to talk with Cardinal Pietro Parolin, the Vatican's secretary of state, the second-highest official at the Holy See after Pope Francis.\n\nThe 40-year-old Mr Vance, who converted to Catholicism in his mid-30s, travelled with his wife and three young children, with the family due to celebrate Easter at the Vatican on Sunday.\n\nMs Meloni was the first leader from Europe to visit Mr Trump since he slapped 20% tariffs on EU exports, which he has since suspended for 90 days.\n\nThe two leaders struck a warm tone yesterday during a working lunch and a meeting in the Oval Office, with Mr Trump hailing the 48-year-old Italian premier as \"fantastic\".\n\n\"There will be a trade deal, 100%,\" Mr Trump said during her visit. Ms Meloni said she was \"sure\" they could reach a deal.\n\nWatch: Trump and Meloni talk up EU tariff deal hopes\n\nCasting herself as the only European who can de-escalate Mr Trump's trade war, Ms Meloni highlighted their conservative common ground and said she wanted to \"make the West great again\".\n\nMs Meloni's decision to personally intercede with Mr Trump has caused some disquiet among EU allies, who are concerned that her visit could undermine bloc unity.\n\nWhile Mr Trump expressed confidence about an eventual deal with the 27-nation bloc he accuses of trying to \"screw\" the United States, he said yesterday that he was in \"no rush\".\n\nTánaiste Simon Harris met Commerce Secretary Howard Lutnick and other US officials in Washington last week.\n\nMs Meloni said Mr Trump had accepted an invitation to visit Rome in the \"near future\" and that he might also meet European leaders there.\n\n\"Even if we have some problems between the two shores of the Atlantic, it is the time that we try to sit down and find solutions,\" she said.\n\nMs Meloni highlighted their shared views on immigration and \"woke\" ideology and added: \"The goal for me is to make the west great again, and I think we can do it together.\"\n\n'Get smart'\n\nMr Trump also returned to his administration's familiar criticisms of Europe, saying it needed to \"get smart\" on immigration and boost defence spending on NATO.\n\nThe US leader said separately that superpower rival China had \"reached out\" about a possible deal to end the bitter trade war between the world's biggest economies.\n\nMr Trump has slapped eye-watering 145% tariffs on Chinese goods after it retaliated to his worldwide \"Liberation Day \" tariffs announcement on 2 April.\n\n\"I think we're going to make a very good deal with China,\" he added.\n\nRead more:China says it will ignore US 'tariff numbers game'\n\nUncertainty\n\nMs Meloni had earlier acknowledged the uncertainty weighing on her trip as Europe reels from repeated blows from a country that has been the continent's defender for decades.\n\n\"I am aware of what I represent and I am aware of what I am defending,\" Ms Meloni said.\n\nItalian newspapers reported that one of the goals of Ms Meloni's visit was to pave the way for a meeting between Mr Trump and European Commission President Ursula von der Leyen.\n\nMs Meloni's decision to personally intercede with Mr Trump has caused some disquiet among EU allies, who are concerned that her visit could undermine bloc unity.\n\n\"If we start having bilateral discussions, obviously it will break the current dynamic,\" France's Industry Minister Marc Ferracci warned last week.\n\nA European Commission spokeswoman said that while the EU alone could negotiate trade agreements, Ms Meloni's \"outreach is very welcome\" and was coordinated with Brussels.\n\nAccreditation:AFP\n\n© RTÉ 2025. RTÉ.ie is the website of Raidió Teilifís Éireann, Ireland's National Public Service Media. RTÉ is not responsible for the content of external internet sites.\n\nImages Courtesy of Getty Images."
      },
      {
        "title": "Italy and US agree to oppose 'discriminatory' tech taxes",
        "author": "Unknown Author",
        "publication_date": "2025-04-18T00:27:21+01:00"
      }
    ],
    "authors": [],
    "source": "RTE.ie",
    "image_url": "https://img.rasset.ie/00225054-500.jpg",
    "url": "https://www.rte.ie/news/us/2025/0418/1508301-meloni-trump/"
  },
  "markdown_content": "## Digital Tax Dispute\\n\\nItaly and the United States have issued a joint statement against \"discriminatory\" taxes on digital services, in a possible signal that Rome is moving away from a levy that has irked Washington.\\n\\nEuropean levies aimed at hitting dominant US tech giants such as Alphabet's Google, Meta's Facebook, Apple and Amazon have been a longstanding irritant for US administrations, including Donald Trump's.\\n\\nItaly applies a 3% levy on revenue from internet transactions for digital companies with sales of at least €750 million, which is worth less than €500 million in revenue for the state each year.\\n\\n> \"We agreed that a non-discriminatory environment in terms of digital services taxation is necessary to enable investments from cutting-edge tech companies,\" Italy and the US said following Prime Minister Meloni's visit to the White House on Thursday.\\n\\n## Investment Plans\\n\\nThe statement also welcomed US investments in AI computing and cloud services in Italy to support Italy as the key regional data hub for the Mediterranean and North Africa.\\n\\nAmazon's computing unit AWS said last year it would invest €1.2bn in Italy over five years in a further expansion of its data centre business in the country.\\n\\n## Political Challenges\\n\\nDespite the relatively small level of revenue the measure generates in a country with total budget spending topping €800bn, the Italian web tax remains a thorny issue for Ms Meloni, who must balance US pressure against her coalition's desire to secure funding from big tech companies."
}