{
  "title": "Could CT scans be fuelling future rise in cancer cases, as new study suggests",
  "publication_date": "2024-04-17T00:00:00Z",
  "summary": "A new study in JAMA Internal Medicine suggests CT scans performed in the US in 2023 could lead to over 100,000 future cancer cases. With CT scan usage up 30% in a decade and 93 million exams performed in 2023, researchers estimate scans could account for 5% of new cancer diagnoses annually. While individual scan risks are low, concerns exist especially for younger patients.",
  "content": "CT scans are a vital part of modern medicine. Found in every hospital and many clinics, they give doctors a fast and detailed look inside the body – helping to diagnose everything from cancer and strokes to internal injuries. But a new study suggests there may be a hidden cost to our growing reliance on this technology.\n\nThe study, published in Jama Internal Medicine, warns that CT scans performed in the US in 2023 alone could eventually lead to over 100,000 extra cancer cases. If the current rate of scanning continues, the researchers say CT scans could be responsible for around 5% of all new cancers diagnosed each year.\n\nThat figure has raised concerns. Especially when you consider that the number of CT scans done in the US has jumped by 30% in just over a decade. In 2023, there were an estimated 93 million CT exams carried out on 62 million people.\n\nThe risk from a single scan is low – but not zero. And the younger the patient, the greater the risk. Children and teenagers are especially vulnerable because their bodies are still developing, and any damage caused by ionising radiation may not show up until many years later.\n\nDespite all this, doctors stress that CT scans are often life-saving and remain essential in many cases. They help catch conditions early, guide treatment and are crucial in emergencies. The challenge is making sure they're only used when really needed.\n\nNewer technologies could help reduce the risk. Photon-counting CT scanners, for example, deliver lower doses of radiation, and MRI scans don't use radiation at all. The researchers suggest that better use of diagnostic checklists could also help doctors decide when a scan is necessary, and when a safer alternative like MRI or ultrasound might do the job.",
  "category": "Health",
  "tags": [
    "medical technology",
    "cancer",
    "healthcare",
    "radiation",
    "medical research",
    "public health",
    "CT scans",
    "diagnostic imaging"
  ],
  "location": "United States",
  "source": {
    "title": "Could CT scans be fuelling future rise in cancer cases, as new study suggests",
    "publication_date": 1744915615,
    "content": [
      {
        "title": "Could CT scans be fuelling future rise in cancer cases, as new study suggests",
        "publication_date": "2025-04-18T00:16:55+00:00",
        "content": "NEW DELHI, Apr 17: CT scans are a vital part of modern medicine. Found in every hospital and many clinics, they give doctors a fast and detailed look inside the body – helping to diagnose everything from cancer and strokes to internal injuries. But a new study suggests there may be a hidden cost to our growing reliance on this technology.The study, published in Jama Internal Medicine, warns that CT scans performed in the US in 2023 alone could eventually lead to over 100,000 extra cancer cases. If the current rate of scanning continues, the researchers say CT scans could be responsible for around 5% of all new cancers diagnosed each year.That figure has raised concerns. Especially when you consider that the number of CT scans done in the US has jumped by 30% in just over a decade. In 2023, there were an estimated 93 million CT exams carried out on 62 million people.The risk from a single scan is low – but not zero. And the younger the patient, the greater the risk. Children and teenagers are especially vulnerable because their bodies are still developing, and any damage caused by ionising radiation may not show up until many years later.That said, over 90% of CT scans are performed on adults, so it’s this group that faces the largest overall impact. The most common cancers linked to CT exposure are lung, colon, bladder and leukaemia. For women, breast cancer is also a significant concern.What makes this latest estimate so striking is how much it has grown. In 2009, a similar analysis projected around 29,000 future cancers linked to CT scans. The new number is over three times higher – not just because of more scans, but because newer research allows for a more detailed analysis of radiation exposure to specific organs.The study also makes an eye-catching comparison: if things stay as they are, CT-related cancers could match the number of cancers caused by alcohol or excess weight – two well-known risk factors.Not all scans carry the same level of risk. In adults, scans of the abdomen and pelvis are thought to contribute the most to future cancer cases. In children, it’s head CTs that pose the biggest concern – especially for babies under the age of one.Often life-saving\n\nDespite all this, doctors stress that CT scans are often life-saving and remain essential in many cases. They help catch conditions early, guide treatment and are crucial in emergencies. The challenge is making sure they’re only used when really needed.Newer technologies could help reduce the risk. Photon-counting CT scanners, for example, deliver lower doses of radiation, and MRI scans don’t use radiation at all. The researchers suggest that better use of diagnostic checklists could also help doctors decide when a scan is necessary, and when a safer alternative like MRI or ultrasound might do the job.It’s worth noting that this study doesn’t prove CT scans cause cancer in individual people. The estimates are based on “risk models” – not direct evidence. In fact, the American College of Radiology points out that no study has yet linked CT scans directly to cancer in humans, even after multiple scans.Still, the idea that radiation can cause cancer isn’t new. It’s scientifically sound. And with the huge number of scans being done, even small risks can add up.CT scans save lives, but they’re not risk-free. As medical technology evolves, so too should the way we use it. By cutting down on unnecessary scans, using safer alternatives where possible, and keeping radiation doses as low as practical, we can ensure CT scans continue to help more than they harm. (The Conversation)\n\nAs a subscriber, you will have full access to all of our Newsletters and News Bulletins.\n\nDesigned Developed & Hosted by Pugmarks."
      },
      {
        "title": "Could CT scans be fuelling future rise in cancer cases, as new study suggests",
        "author": "Daily Excelsior",
        "publication_date": "2025-04-18T00:16:55+00:00"
      }
    ],
    "authors": [],
    "source": "Daily Excelsior",
    "image_url": "https://cdndailyexcelsior.b-cdn.net/wp-content/uploads/2025/04/CT.jpg",
    "url": "https://www.dailyexcelsior.com/could-ct-scans-be-fuelling-future-rise-in-cancer-cases-as-new-study-suggests/"
  },
  "markdown_content": "## The Growing Role of CT Scans\\nCT scans are a vital part of modern medicine. Found in every hospital and many clinics, they give doctors a fast and detailed look inside the body – helping to diagnose everything from cancer and strokes to internal injuries. But a new study suggests there may be a hidden cost to our growing reliance on this technology.\\n\\n## Study Findings\\nThe study, published in Jama Internal Medicine, warns that CT scans performed in the US in 2023 alone could eventually lead to over 100,000 extra cancer cases. If the current rate of scanning continues, the researchers say CT scans could be responsible for around 5% of all new cancers diagnosed each year.\\n\\nThat figure has raised concerns. Especially when you consider that the number of CT scans done in the US has jumped by 30% in just over a decade. In 2023, there were an estimated 93 million CT exams carried out on 62 million people.\\n\\n## Health Risks\\nThe risk from a single scan is low – but not zero. And the younger the patient, the greater the risk. Children and teenagers are especially vulnerable because their bodies are still developing, and any damage caused by ionising radiation may not show up until many years later.\\n\\n## Balancing Benefits and Risks\\nDespite all this, doctors stress that CT scans are often life-saving and remain essential in many cases. They help catch conditions early, guide treatment and are crucial in emergencies. The challenge is making sure they're only used when really needed.\\n\\n## Future Solutions\\nNewer technologies could help reduce the risk:\\n* Photon-counting CT scanners, which deliver lower doses of radiation\\n* MRI scans that don't use radiation at all\\n* Better use of diagnostic checklists to help doctors decide between scanning options\\n* Safer alternatives like MRI or ultrasound when appropriate"
}