[
  {
    "title": "Anxious about Finding a Prospective Groom for Marriage",
    "url": "https://www.reddit.com/r/india/comments/1k2dpd2/anxious_about_finding_a_prospective_groom_for/",
    "created_utc": 1745005309.0,
    "subreddit": "india",
    "media": [],
    "content": "I am 26 years old and have an elder sister who is 28. We come from a lower caste, and throughout my life, people have constantly reminded us of that. Because of this, I ended up hiding my caste. I was in a relationship for over four years, but things went wrong and we broke up.\n\nWe are a family of four. Both my parents work in respectable government jobs, and we now belong to the upper-middle class. However, many of our relatives still live in poverty. I completed my MBA this year, and by next month, I’ll be starting a well-paying job.\n\nMy parents are struggling to find a suitable groom for my sister. Most of the matches we've come across are from villages or hold backward mindsets. She has met around 11–12 potential matches through arranged setups, but none have worked out. She is also in a relationship, but her boyfriend is from a different caste, and his family will not accept us.\n\nNow I’m anxious about my own future. How will I find a good husband? Where should I place my hopes?\n\nHaving been in a long-term relationship, I now have a few non-negotiables in my list. But even if I compromise on those, I still worry that I won’t find the right person.\n\nWhat should I do?"
  },
  {
    "title": "Please help mass report this influencer- Lakshay Jaggi",
    "url": "https://www.reddit.com/gallery/1k2dmd9",
    "created_utc": 1745005096.0,
    "subreddit": "india",
    "media": [
      "https://preview.redd.it/eq6dfg72cnve1.jpg?width=1179&format=pjpg&auto=webp&s=f0cc5c8466878ea0632b353520c3f7e95f528ee2",
      "https://preview.redd.it/43erwf72cnve1.jpg?width=1179&format=pjpg&auto=webp&s=6eac356917eda11384be648162c42df653c70280"
    ],
    "content": ""
  },
  {
    "title": "IGNOU Professor Allegedly Beaten up by Army in Jammu, Probe Ordered",
    "url": "https://thewire.in/security/ignou-professor-allegedly-beaten-up-by-army-in-jammu-probe-ordered",
    "created_utc": 1745004759.0,
    "subreddit": "india",
    "media": [
      "https://external-preview.redd.it/7h4M9jtESIXXKICxMiPk7PEd0mWNfLrRhJMficA93KI.jpg?auto=webp&s=73abf09aa0107f844e30bb349807f3e08f046cc7"
    ],
    "content": ""
  },
  {
    "title": "AI on prioritising Caste based reservation in professional jobs.",
    "url": "https://www.reddit.com/r/india/comments/1k2dfvv/ai_on_prioritising_caste_based_reservation_in/",
    "created_utc": 1745004631.0,
    "subreddit": "india",
    "media": [],
    "content": "In roles like scientists, doctors, engineers, and other professional positions, prioritizing meritocracy versus caste-based reservations involves weighing technical competence against social equity. These roles demand high skill, precision, and accountability, directly impacting public safety, innovation, and economic outcomes. Here’s a concise analysis of what should take precedence, grounded in evidence and reasoning.\n\nCase for Prioritizing Meritocracy:\n1. **Critical Competence**:\n   - **Scientists**: Breakthroughs in fields like physics or AI require deep expertise, often measurable through rigorous exams or research output. Lower entry standards (e.g., 30-40/100 vs. 70/100) risk selecting candidates unprepared for cutting-edge work.\n   - **Doctors**: Medical errors can be fatal. A 2018 study on NEET (medical entrance exam) showed reserved candidates with lower scores needed more remedial training to match peers, raising concerns about initial competence in high-stakes roles like surgery.\n   - **Engineers**: Infrastructure or tech failures (e.g., bridge collapses, software bugs) can cost lives or billions. IIT admission data shows reserved candidates often score 20-30% lower, potentially affecting readiness for complex projects without extensive support.\n\n2. **Public Safety and Trust**:\n   - Professions like medicine and engineering directly affect lives. Public trust hinges on perceived competence. If reservations lead to visibly underqualified hires, it fuels skepticism, as seen in X posts where users question reserved doctors’ capabilities.\n   - Example: A 2016 survey found 55% of patients preferred doctors selected purely on merit, citing confidence in outcomes.\n\n3. **Global Competitiveness**:\n   - India’s tech and science sectors compete globally. Companies like ISRO or Infosys rely on top talent to rival NASA or Google. A 2020 NASSCOM report emphasized merit-based hiring as key to India’s IT edge, where caste-based quotas could dilute quality.\n   - China’s merit-driven system, producing high-caliber scientists and engineers, is often cited on X as a contrast to India’s quota model, correlating with its technological lead.\n\n4. **Long-Term Efficiency**:\n   - While training can bridge gaps, the time and cost of upskilling lower-scoring candidates strain resources, especially in fast-paced fields. A 2019 study on public sector engineers found reserved hires took 1-2 years longer to match unreserved peers’ productivity.\n\n### Case for Prioritizing Caste-Based Reservations:\n1. **Historical Equity**:\n   - SCs/STs/OBCs, ~50% of India’s population, faced centuries of exclusion from education and professional roles. Without reservations, their representation in elite fields would be negligible (e.g., pre-quota IITs had <5% SC/ST students). Reservations ensure access to roles historically dominated by upper castes.\n   - Example: By 2020, SC/ST doctors in government hospitals rose to ~15%, aligning closer to their 25% population share, due to quotas.\n\n2. **Diversity Benefits**:\n   - Diverse teams enhance innovation and empathy. A 2020 McKinsey study found companies with diverse leadership were 25% more likely to innovate. Reserved professionals bring unique perspectives, especially in medicine, where SC/ST doctors may better understand marginalized patients’ needs.\n   - Example: Reserved scientists from underrepresented groups have contributed to ISRO missions, showing quotas don’t always compromise quality.\n\n3. **Systemic Barriers**:\n   - SC/ST/OBC candidates often face inferior schooling, limited coaching, and economic hardship. A 2018 NSSO survey showed only 12% of SC households access private tutoring vs. 25% for upper castes. Lower exam cutoffs (e.g., 30-40/100) compensate for these disparities, not inherent ability.\n   - With training, reserved candidates often excel. A 2016 IIM study found SC/ST students admitted with lower scores matched peers in placements after coursework.\n\n4. **Social Stability**:\n   - Excluding marginalized groups from high-status roles risks unrest. Reservations reduce caste tensions by ensuring representation, as seen in the rise of SC/ST professionals in bureaucracy and academia.\n\n### Balancing the Two:\n- **Meritocracy’s Edge in High-Stakes Roles**: For scientists, doctors, and engineers, meritocracy should take priority due to the immediate risks of underperformance (e.g., medical errors, engineering failures) and the need for global competitiveness. A surgeon or rocket scientist with a 30/100 score, even with training, may struggle in roles requiring instant expertise.\n- **Reservations’ Role in Equity**: However, completely ignoring reservations perpetuates exclusion. SC/ST/OBC underrepresentation in elite fields (e.g., only 10% of private sector tech roles) reflects ongoing barriers. Reservations can ensure access but should be paired with robust mechanisms to maintain quality.\n\n### Recommended Approach:\n1. **Merit-Based Selection with Support**:\n   - Use high but fair cutoffs for all, supplemented by pre-qualification programs (e.g., free coaching, scholarships) to help SC/ST/OBC candidates compete. For instance, IITs’ preparatory courses for reserved students have boosted pass rates without lowering standards.\n   - Example: ISRO’s merit-focused hiring, combined with outreach to diverse talent, balances quality and inclusion.\n\n2. **Training and Mentorship**:\n   - Post-selection training (e.g., medical residencies, engineering apprenticeships) can bridge gaps for reserved candidates, ensuring they meet professional standards. UPSC’s training model, where reserved IAS officers excel post-induction, is a success case.\n\n3. **Limited Quotas in Critical Roles**:\n   - Cap reservations in high-stakes fields (e.g., 10-15% vs. 50%) to prioritize competence while ensuring some diversity. South Africa’s affirmative action in medicine uses similar caps to balance equity and quality.\n\n4. **Economic-Based Supplements**:\n   - Add income-based quotas (like EWS) to support poor unreserved candidates, reducing resentment and broadening upliftment without diluting merit.\n\n### Conclusion:\nIn roles like scientists, doctors, and engineers, **meritocracy should be prioritized** due to the need for technical excellence, public safety, and global competitiveness. Caste-based reservations, while critical for equity and diversity, risk compromising quality if cutoffs are too low (e.g., 30-40/100 vs. 70/100). A balanced approach—high merit standards, pre-qualification support, robust training, and limited quotas—can uphold competence while addressing historical inequities. This ensures professionals are both skilled and representative, avoiding the pitfalls of either extreme."
  },
  {
    "title": "I'm a 15-year-old student launching a podcast to interview women in STEM—looking for inspiring guests!",
    "url": "https://www.reddit.com/r/india/comments/1k2d4tu/im_a_15yearold_student_launching_a_podcast_to/",
    "created_utc": 1745003823.0,
    "subreddit": "india",
    "media": [],
    "content": "’m a 15-year-old high school student from India and I’m launching a podcast to **highlight the stories of women in STEM**—from teachers and professors to doctors, engineers, researchers, and more. My goal is to inspire other young girls (like myself!) to explore science, tech, engineering, and math by hearing from real women doing incredible work.\n\nI’d love to speak with:\n\n* Science teachers or professors\n* Researchers or scientists\n* Women in medicine\n* Women in tech, engineering, or space\n* Anyone in a STEM-related field with a story to share!\n\nThe interviews will be held over **Zoom (20–30 mins)**, and I’ll send questions in advance. It's meant to be relaxed, conversational, and inspirational—your voice could truly make a difference to young listeners out there.\n\nIf you or someone you know might be interested, please comment or DM me. I’d be *so grateful* to hear from you and include your story in my podcast!\n\nThanks so much 💫\n\nEDIT- HEY\n\nthis is the op\n\nI'm so happy with alll the love and responses I've recieved, truely grateful\n\nIs there any way, all of you can contact your coworkers, relatives or anyone whose also into the STEM field, I want to intreview as many women as possible\n\nThank you so much"
  },
  {
    "title": "A political scumbag kidnapped a girl in Ludhiana and is bragging about it. (Verified). Police hasn't taken any action",
    "url": "https://i.redd.it/52ho6lt57nve1.jpeg",
    "created_utc": 1745003449.0,
    "subreddit": "india",
    "media": [
      "https://i.redd.it/52ho6lt57nve1.jpeg",
      "https://preview.redd.it/52ho6lt57nve1.jpeg?auto=webp&s=6eb2f46064037ecb1c15dbaa13b468a289616c44"
    ],
    "content": "Tdlr - A boy made a complaint against this scumbag, so this scumbag kidnaped his sister"
  },
  {
    "title": "Will you allow Muslims on Hindu boards? Supreme Court questions Waqf composition",
    "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-questions-waqf-board-composition-non-muslim-members-inclusion-2709934-2025-04-16",
    "created_utc": 1744999879.0,
    "subreddit": "india",
    "media": [
      "https://external-preview.redd.it/Akq3Jv-5VNzkNJISp4A2Vo6yjPe2ScO-mL3BoaAZaak.jpg?auto=webp&s=f434f967ed5546a6839fc4a7c27724cf5e7f54ce"
    ],
    "content": ""
  },
  {
    "title": "Confused buying my first acoustic guitar",
    "url": "https://www.reddit.com/r/india/comments/1k2b75g/confused_buying_my_first_acoustic_guitar/",
    "created_utc": 1744998939.0,
    "subreddit": "india",
    "media": [],
    "content": "I always wanted to learn guitar and now finally i have time to learn it before starting my college.\nI am looking for an acoustic guitar around the price range of 5k, i searched online and everyone is recommending yamaha f280 which is around 7k, now the thing is, it will be my first guitar, my first musical instrument and i don't wanna spend too much for the first time (yes, 7k is a lil bit high for me rn), I have no issues buying a second hand but the thing is even in fb and olx, people are demanding 7k for a second hand piece, like howww? why will i buy a second hand when iam already getting the same model new, i don't know what should i do, do you guys have any friend or anyone who is willing to sell yamaha f280 for smth like 5k, or any other suggestion cause people are saying guitars under 4k are just waste of money blah blah, and iam really passionate about learning to play it.\ni can't save more money rn as i have no source of income (not even pocket money). please help me out, anyone willing to sell their yamaha acoustic guitar for like 5k"
  },
  {
    "title": "Are India's rape videos being sold on dark web?",
    "url": "https://www.reddit.com/r/india/comments/1k2b3mn/are_indias_rape_videos_being_sold_on_dark_web/",
    "created_utc": 1744998686.0,
    "subreddit": "india",
    "media": [],
    "content": "I've been following news in India and honestly, it's horrifying and every other week there’s another case of a girl, often a minor, being raped, tortured, and sometimes killed in the most disturbing ways possible.\n\nI've a theory that this isn’t just about lust. These cases show signs of something much darker, it requires planning, recording, even public staging.\n\nSo, are these crimes part of a hidden business?\n\nThe dark web is full of illegal content. Videos of real abuse, especially from countries where law enforcement is weak or corrupt, are sold for high prices.\n\nIndia is frequently mentioned as a source. Combine this with the rise in untraceable transactions (crypto, UPI tricks, and laundering methods) and it starts to form a sick pattern.\n\nWhat if these brutal crimes are being filmed and sold?\nWhat if the violence isn't just a side effect but the product itself?\n\nThis needs to be talked about. If there’s a network profiting from real abuse videos, then we’re not just dealing with criminals, we're dealing with a market that rewards horror.\n\nHas anyone else thought about this?\n\nAre there any data or reports that go deeper into this possible link between brutal sexual violence and dark web trade?"
  },
  {
    "title": "How Gandhi Became the Villain & Godse, the Martyr | Nope w/ Kunal Kamra  | Episode 003",
    "url": "https://youtu.be/ju_j8sYNmcE?si=orWevZbf0YEkltKs",
    "created_utc": 1744997365.0,
    "subreddit": "india",
    "media": [
      "https://external-preview.redd.it/w0C7M5reSKENyGJjf_xD_2H_sC995JGPZuzKD14euYk.jpg?auto=webp&s=4f4ccf6845875fe817d34150558d0c2b1e830353"
    ],
    "content": ""
  },
  {
    "title": "Minimum wages hiked in Delhi: Unskilled workers to get Rs 18,456, skilled Rs 22,411",
    "url": "https://www.msn.com/en-in/news/India/minimum-wages-hiked-in-delhi-unskilled-workers-to-get-rs-18456-skilled-rs-22411/ar-AA1CY8MN",
    "created_utc": 1744996234.0,
    "subreddit": "india",
    "media": [],
    "content": ""
  },
  {
    "title": "Witnessed an accident",
    "url": "https://www.reddit.com/gallery/1k2a2os",
    "created_utc": 1744996096.0,
    "subreddit": "india",
    "media": [
      "https://preview.redd.it/uczih9e9lmve1.jpg?width=4080&format=pjpg&auto=webp&s=7efd867cef40c654a1f141ef725850949f1df42c",
      "https://preview.redd.it/hx3us4oalmve1.jpg?width=3060&format=pjpg&auto=webp&s=dc97dc41052be80786e90465afa3dccbdd10f61f"
    ],
    "content": "I was visiting Thanjavur and Kumbakonam, and around 9 PM, I was walking from the Thanjavur Periya Kovil to the Old Bus Stand. Suddenly, I heard a loud noise from pehind. It was from scooters. An accident had just happened. A guy on a scooter was riding on the wrong side, and while trying to avoid him, another boy, probably in his teenage years, ended up getting into an accident. From what I saw, I don't think there was a collision, but the boy lost control and fell. The guy who caused it fled the scene immediately\n \nPeople nearby rushed in to help, and the boy went unconscious. I know it's not always the right move to nterfere physically in such situations, especially without proper training, because sometimes it can cause more harm than good. Everyone around was trying to help in their own way. Some were attempting to unlock his phone to reach his parents or friends. I wasn't sure what else to do, but I felt I had to act. So, i searched google for ambulance number and for the first time in my life, I called 108.\n \nTo be honest, I used to think services like 108 were just for show. But the person on the line took the details seriously, and within 10 minutes, an ambulance was arranged. The driver even called me to coordinate. When i talking to ambulancedriver, a group of his friends, a bunch of teenagers arrived. Even though the boy was still not fully conscious, they lifted him and took him away on a scooter. I don't know where they were headed. I told this to driver and he told me call 108 inform them to cancel ambulance, I called 108 again and cancelled the ambulance.\n \nI'm sharing this here to spread some awareness, especially for people like me who didn't know how real and responsive 108 can be. In this case, I wasn't able to do much, but I've realized that everyone can do something. Our government system isn't as bad as we often think. Sometimes, it just takes someone to act.\n\nI hope that boy is okay."
  },
  {
    "title": "Dirty for eating fish: Non-veg row sparks Marathi vs Gujarati clash in Mumbai",
    "url": "https://www.indiatoday.in/cities/mumbai/story/dirty-for-eating-fish-non-veg-row-sparks-marathi-vs-gujarati-clash-in-mumbai-2710644-2025-04-17",
    "created_utc": 1744993925.0,
    "subreddit": "india",
    "media": [
      "https://external-preview.redd.it/4rz-C0iHT_5e3ex6b_R881P5WNYU-IzML2GSat6DWug.jpg?auto=webp&s=98828fdfb10262d0d69bc119ff8e4fc5499e729e"
    ],
    "content": ""
  },
  {
    "title": "GST on UPI transactions above Rs 2,000: Government issues clarification",
    "url": "https://timesofindia.indiatimes.com/technology/tech-news/gst-on-upi-transactions-above-rs-2000-government-issues-clarification/articleshow/120411307.cms",
    "created_utc": 1744993726.0,
    "subreddit": "india",
    "media": [
      "https://external-preview.redd.it/yofNpcE9mv6XVf3hKOo9QegfUAmcXDg6axEWVDD-4Hs.jpg?auto=webp&s=7c5d102370f0b5f286ca7a57fbe7ce21598275ad"
    ],
    "content": ""
  },
  {
    "title": "NCERT gives Hindi names to English textbooks, sparks language row",
    "url": "https://www.indiatoday.in/education-today/news/story/ncert-gives-hindi-names-to-english-textbooks-sparks-language-row-2708688-2025-04-14?utm_source=washare&utm_medium=socialicons&utm_campaign=shareurltracking",
    "created_utc": 1744991446.0,
    "subreddit": "india",
    "media": [
      "https://external-preview.redd.it/s-HX-PR0pZGQhu6dnF1rpnilyiRe9olbKbPAf1HoB7s.jpg?auto=webp&s=96bf8b932a44eaf99dfead4f5cb4aca5de2b9ccb"
    ],
    "content": ""
  },
  {
    "title": "My Thoughts on the Language Debate as a North Indian",
    "url": "https://www.reddit.com/r/india/comments/1k27ci4/my_thoughts_on_the_language_debate_as_a_north/",
    "created_utc": 1744989260.0,
    "subreddit": "india",
    "media": [],
    "content": "As a North Indian, I’ve been observing the ongoing debate about language imposition—especially the fear around Hindi being forced in South India. So I decided to read and understand what our Constitution actually says. And here’s what I found, along with what I personally believe\n\nArticle 345 – States can adopt any language in use as their official language.\n\nThis gives every state the power to declare its own language—like Tamil, Telugu, Malayalam—as official. So if the Centre tries to impose a common language like Hindi, it goes against the federal spirit of this Article.\n\n\nArticle 351 – The Union should promote Hindi, but without hurting other languages.\n\nThis means Hindi can be promoted, but not in a way that makes other languages feel inferior. That’s where the real tension begins—when promotion feels like replacement.\n\n\nArticle 347 – If a large group of people speaks a language, they can ask the President for recognition.\n\nMost South Indian languages are already recognized, but still, there's fear. And honestly—I get it.\n\n\nWhy the Fear Is Valid\n\nI agree that Hindi is spoken by 43.7% of Indians. That's a huge percentage. Compared to that, the percentage of Tamil, Telugu, Kannada, or Malayalam speakers is smaller.\n\nSo I completely understand why people from South India might feel insecure. It’s not just about language—it’s about cultural identity, respect, and representation. If Hindi keeps growing in influence—through school syllabuses, government exams, national broadcasts—it may slowly push regional languages to the side. And that’s a valid fear.\n\n\nMy Perspective as a North Indian\n\nBeing from a Hindi-speaking region, I see Hindi everywhere—in schools, in media, in everyday life. But does that mean others should have to give up or bend to our language? Absolutely not.\n\nIn fact, if we expect others to learn Hindi, why don’t we learn their languages too?\n\nLanguages like Tamil, Kannada, Malayalam, and Telugu are beautiful and ancient. So why aren’t they taught in North Indian schools—even as optional subjects?\n\n\nWhat Can Be Done (By People + Government)\n\n1. Freedom to Choose – Let students pick Hindi or English as their second language.\n\n\n2. Two-Way Language Learning – Encourage North Indians to learn South Indian languages too.\n\n\n3. Cultural Respect > Political Power – Promote diversity, not dominance.\n\n\n4. More South Indian Language Visibility – In media, government programs, and education.\n\n\nUnity doesn't mean making everyone speak the same language. It means giving space to every language to grow and flourish. We can only become a stronger India when every Indian feels respected—linguistically, culturally, emotionally.\n\nAs a humanities student, I’ve read about these\n concepts in the Constitution, which is why I feel it’s important to approach this debate with understanding and respect for all languages.\n\nDisclaimer: These are purely my personal thoughts and observations. I’m not trying to impose any opinion on anyone—just sharing what I feel after reading, thinking, and listening to both sides of the debate."
  },
  {
    "title": "After 40 years, India to send astronaut Shubhanshu Shukla to International Space Station in May",
    "url": "https://economictimes.indiatimes.com/news/science/after-40-years-india-to-send-astronaut-shubhanshu-shukla-to-international-space-station-in-may/articleshow/120409253.cms",
    "created_utc": 1744986813.0,
    "subreddit": "india",
    "media": [
      "https://external-preview.redd.it/2qh6e34t_Tplf979t3BBDJNV0A04H1HDW21wGd9xVRw.jpg?auto=webp&s=ba495bfd9e10e66366dc8c1c33e73d1a79fdbb16"
    ],
    "content": ""
  },
  {
    "title": "Where in India do they make these silk scarves?",
    "url": "https://www.reddit.com/gallery/1k2557a",
    "created_utc": 1744983476.0,
    "subreddit": "india",
    "media": [
      "https://preview.redd.it/51yl5x8cjlve1.jpg?width=2160&format=pjpg&auto=webp&s=72500a8bc342f3cf4d6112fb33184ebb775d588d",
      "https://preview.redd.it/eoj65aekjlve1.jpg?width=3060&format=pjpg&auto=webp&s=ed08ee581886478e057abd873c12f35001c147e3",
      "https://preview.redd.it/3esk9fekjlve1.jpg?width=3060&format=pjpg&auto=webp&s=491e45d0a5387281eed8302968257b832d1c40ba"
    ],
    "content": "Hand rolled edges, block print, super fine silk\nId like to head to the best place/ market to fid these in India"
  },
  {
    "title": "T.N. CM Stalin hits back at PM Modi over ‘crying for funds’ remark, reminds his statements as Gujarat CM",
    "url": "https://www.thehindu.com/news/national/tamil-nadu/tn-cm-stalin-hits-out-at-pm-modi-over-crying-for-funds-remark-reminds-his-statements-as-gujarat-cm/article69463985.ece",
    "created_utc": 1744981876.0,
    "subreddit": "india",
    "media": [
      "https://external-preview.redd.it/JvAAcFVSdPI4rmVmzWEuLK1IMnVZQ7CUmKDWqQEvwHA.jpg?auto=webp&s=75ef93e592ad36c95a0cb93fadc0f94cf1342290"
    ],
    "content": ""
  },
  {
    "title": "Viral: The Puncture Pushback. After PM Comment, Muslim Youth Post Pictures.",
    "url": "https://youtu.be/otQ2xbFuR6Q",
    "created_utc": 1744979779.0,
    "subreddit": "india",
    "media": [
      "https://external-preview.redd.it/_1ygMEjVHFSqu8HiWSVcYr_uc1ykfDw2nh-qb_OIS18.jpg?auto=webp&s=04637171be9d71398c662c3d465693c3e159dba8"
    ],
    "content": ""
  },
  {
    "title": "DMI Finance scam calls - beware",
    "url": "https://www.reddit.com/r/india/comments/1k232np/dmi_finance_scam_calls_beware/",
    "created_utc": 1744977209.0,
    "subreddit": "india",
    "media": [],
    "content": "Didn't know what flair to add to this post. \n\nI am constantly being harrassed by DMI Finance calls. I've blocked close to 50 numbers but they keep calling me from different numbers. They put allegations on me for unpaid EMI on some phone and the loan is linked to someone named Arjun from UP. \n\nMy name is not Arjun and neither do I live in UP. They are extremely rude and start misbehaving when I tell them I am not Arjun and I haven't taken any loan. They accuse me of fraud and ask me how did I get this phone number when this phone number belongs to Arjun.\n\nI talk to them nicely trying to get them to delete my number from the database but they never listen and just keep misbehaving more and more until I have no choice but to hang up. And when I say misbehave, they really go to all extents. \n\nI wanted to see if anyone else has been harassed by repeated calls like this and how did you get out of this mess. I don't know how many more numbers I can block as they call me 20 times from different numbers everyday. \n\nI tried talking to DMI finance customer care, they asked me to share my aadhar and pan card so they can verify my identity. I obviously didn't send them any documents as it clearly didn't feel safe. I threatened them with a consumer court complaint after which they said they'll try and remove my number but nothing ever happened. \n\nLet this be a lesson for everyone, keep your phone number private and don't give it out unnecessarily, everyone is selling your data. And don't do business with shady companies like DMI finance."
  },
  {
    "title": "India’s Trade Deficit with China Hits Record $99.2bn: Manufacturing Gaps to Blame?",
    "url": "https://www.outlookbusiness.com/amp/story/economy-and-policy/indias-trade-deficit-with-china-hits-record-992bn-manufacturing-gaps-to-blame",
    "created_utc": 1744975002.0,
    "subreddit": "india",
    "media": [
      "https://external-preview.redd.it/oC_Xx1q--7RkM1iaP85-LF_HpsarjZC5S7PQhQpV0iQ.jpg?auto=webp&s=6059f2306aaad92b31041a359e354cc137e8fd16"
    ],
    "content": "\"A fortress built on lies is destined to collapse.\"\n\n\nAfter all the \"Atmanirbhar Bharat\" chest-thumping, this is where we are. $99.2 BILLION\nflowing out of our economy into China's hands—a country that has shown nothing but aggression on our borders.\nWhere is Make in India? Where are the manufacturing zones, the industrial clusters, the real support for Indian MSMEs? For years, we've been served slogans, photo-ops, and startup summits-while China kept shipping in everything from machinery to toys to diodes. And we kept importing.\nIf we can't even produce basic components or consumer goods at scale, what are we even doing?\nThis isn't just a trade number. This is economic dependence-and worse, national vulnerability.\nWe need manufacturing reform, not just schemes.\nWe need supply chains, not supply speeches.\nWe need execution, not excuses.\nIndia deserves better.\n#TradeDeficit #China #MakelnIndia\n#AtmanirbharBharat #EconomicRealityCheck"
  },
  {
    "title": "I reported a crime but feel mentally stressed and unsafe",
    "url": "https://www.reddit.com/r/india/comments/1k224z1/i_reported_a_crime_but_feel_mentally_stressed_and/",
    "created_utc": 1744973924.0,
    "subreddit": "india",
    "media": [],
    "content": "I am a student, from Bihar and i found a job agency about 4 km far from my  home, and I have financial issues so I contacted the agency which promised me a part time job with a average pay for a student and I need to register in there for 1500 rupees and aadhar and photo will be submitted. The job was a online work that I will need to do but I needed to visit the agency to register. \n\n\nI visited and asked details about job and everything which they clarified there and they claimed that I will be hired from tomorrow morning.\nAnd next morning the manager of agency messaged me that I need to pay 4500 Ruppee extra which wasn't mentioned nor have been told about in any agreement not even in there advertisement.\nThey daily call me and say that I will need to pay this amount for software and some training practice. I always confront him that as being a student, I can't simply pay this sum of money in just a day and also states that this wasn't written on the agreement that I signed for which he completely dodge or ignore whenever confronted.\n\n\nLater I searched very deeply online about the agency and i found that this same agency name with same GSTIN is in other state and on Justdial website there is a single comment for that other branch that they charge 1500 and then charge another 4500 out of surprise and give a job online which actually create online advertisement to lure youngsters and student in the name of part time job. They never actually pay anyone and leave the applicant after some time in ignorance and block them. This agency has been doing this from years around other states too with all of there other branches. Creating a network of scam to lure youngsters ans students.\n\nThen 3 days later he started to put pressure on me that if I don't pay, i will need to pay the 1500 sum again as it will expire.\n\nI felt very pressured and i wrote a letter with all attached documents like call recording and every evidence I had against him and filed it to cyber police as it felt like mental harassment. They simply don't care if I am student or not, they just want the money anyhow.\n\nI first wanted to report this to the police in local area but the fact that there are 4 police station around 3km radius of that scam agency and they are very confident in exploiting youth/student this openly put my faint in my local police down. I can not believe they are doing this, this open and wide in such area. \n\nEven though I have filed this on cybercrime mail and website and even NHC (I filed there first because they refused for the 1500 refund and I was unaware of the scam network of the company that time). I feel scared since they have my partial address, name, phone number, whatsapp number and Aadhar number, they don't have my photo. But these given information are already very much that he have about me. And knowing that even 4 police station surrounding the scam center are simply unaware, I feel unsafe about it."
  },
  {
    "title": "India in Bottom 10-20% Bracket on Academic Freedom Index, Ranks 156th Globally",
    "url": "https://m.thewire.in/article/education/india-in-bottom-10-20-bracket-on-academic-freedom-index-ranks-156th-globally/amp",
    "created_utc": 1744969932.0,
    "subreddit": "india",
    "media": [
      "https://external-preview.redd.it/nvBDFWSShJkL3wInFsnqsJxCeIqo6RER7ihW7rOH9rU.jpg?auto=webp&s=bba7dbeaa70d8f09655c3274e681dd72bb45fc35"
    ],
    "content": "In the 2025 update to the Academic Freedom Index, India ranked 156th of the 179 countries assessed in the report. Its score fell from 0.38 in 2022 to 0.16, putting it in the bottom 10-20% bracket.\n\nAFI, published by the V-Dem Institute, measures countries on the following factors: freedom to research and teach; freedom of academic exchange and dissemination; institutional autonomy; campus integrity; and freedom of academic and cultural expression.\n\nIn its latest report, the V-Dem Institute said that electoral success of anti-pluralist parties is “a potential driver of academic freedom decline”. “Drawing on data over a period of 50 years, we show that academic freedom is at risk when anti-pluralist parties reach government,” the report said.\n\nThe report identifies 34 countries and territories that experienced a “statistically significant and substantially meaningful decline in academic freedom compared to ten years ago”. India is among them.\n\nAmong its neighbours, India was among the worst performing countries measuring only above China in the bottom 10% bracket. While Bangladesh was in the same bracket as India, Pakistan, Nepal and Bhutan fell in the top 30-40% bracket and Sri Lanka in the top 40-50%."
  },
  {
    "title": "Varanasi gang-rape case: SIT formed as suspects’ families pick holes in complainant claims",
    "url": "https://indianexpress.com/article/cities/lucknow/varanasi-gang-rape-case-sit-formed-as-suspects-families-pick-holes-in-complainant-claims-9950538/",
    "created_utc": 1744968534.0,
    "subreddit": "india",
    "media": [
      "https://external-preview.redd.it/VKKtjRl6u8yipJuSR22LbbysUORLi9E1xVkXdjIeUGE.jpg?auto=webp&s=0a6ba68aae4374726436ba0cd38c0048fec85384"
    ],
    "content": ""
  },
  {
    "title": "Vance to meet Modi, Meloni during trip to India and Italy with wife Usha",
    "url": "https://apnews.com/article/vance-travel-italy-india-3e15a473751a24be3eca09d5cdf1009c?utm_source=reddit.com&utm_medium=referral&utm_campaign=post",
    "created_utc": 1744968298.0,
    "subreddit": "india",
    "media": [
      "https://external-preview.redd.it/Giyb0b9M_iFAuco470WYbyP-1niKrg1m-xflDXKzzaw.jpg?auto=webp&s=3b6c663a1972ff878300f5946a9034045de059f7"
    ],
    "content": ""
  },
  {
    "title": "Kaam ho gaya: Minor girl, aides stab husband 36 times with beer bottle in MP, show body to lover on video call | Indore News",
    "url": "https://timesofindia.indiatimes.com/city/indore/kaam-ho-gaya-minor-girl-aides-stab-husband-36-times-with-beer-bottle-in-mp-show-body-to-lover-on-video-call/articleshow/120403116.cms",
    "created_utc": 1744967000.0,
    "subreddit": "india",
    "media": [
      "https://external-preview.redd.it/QLprHJugYABRsAaboNix-kPsYv1VQa7nmBzMR1HwWzA.jpg?auto=webp&s=ae6c6fdc038f122492f3e9f0e0e9d5bdb6e75faa"
    ],
    "content": ""
  },
  {
    "title": "[Help] Choosing Between MAHE (Manipal) and NMIMS for Online MBA – Need Guidance!",
    "url": "https://www.reddit.com/r/india/comments/1k1zsym/help_choosing_between_mahe_manipal_and_nmims_for/",
    "created_utc": 1744964174.0,
    "subreddit": "india",
    "media": [],
    "content": "Hey folks,\n\nI’m currently working as a software developer with 2 years of experience and a [B.Tech](http://b.tech/) in Computer Science. For the past 6 months, I’ve felt like my career has hit a plateau. Job market’s been tough, and I’m thinking of upskilling. 😓\n\nI’ve decided to pursue an **online MBA** to build a foundation in management while keeping my tech background relevant. After a lot of research, I’ve shortlisted two options:\n\n# 🎓 MAHE (Manipal University Jaipur) – Online MBA\n\n* UGC & AICTE approved\n* Fees \\~₹2.9L (semester-wise payment)\n* Offers specializations like **Data Science, IT, Business Analytics**\n* Provides **placement support**\n* Flexible structure (pre-recorded + live classes)\n\n# 🎓 NMIMS (Narsee Monjee Institute of Management Studies) – Online MBA\n\n* UGC, AICTE approved + NAAC A+\n* Fees \\~₹2.1L\n* 800+ hours of live lectures\n* Access to job portals like iimjobs, hirist, etc.\n* More reputed brand name and alumni network\n\nI’m confused between the two.\n\n🧠 My interests: Business Analytics, Finance, International Business, and eventually some diploma in AI or Data Science.  \n💼 Goal: Climb the corporate ladder while keeping doors open for both tech + business roles.  \n💰 Budget: I make \\~25K/month, live with my parents, and can afford semester-wise payments.\n\nWould love to hear from folks who’ve done online MBAs from either of these (or are currently pursuing).\n\n* How’s the learning experience?\n* Did it help your career?\n* Is brand value really that big in online MBAs?\n\nAny help or advice is appreciated 🙏\n\n**TL;DR**: Software dev wants to upskill with an online MBA. Confused between Manipal (MAHE) and NMIMS. Seeking career-boosting + tech-friendly MBA. Which is better?"
  },
  {
    "title": "DUSU President Ronak Khatri smeared cow dung on Lakshmibai College principal Pratyush Vatsala's office in protest against her applying it on classroom walls for a research project on cooling methods.",
    "url": "https://news.abplive.com/cities/dusu-president-smears-cow-dung-on-principal-office-wall-in-protest-against-viral-cooling-experiment-at-lakshmibai-college-watch-video-1765504",
    "created_utc": 1744961258.0,
    "subreddit": "india",
    "media": [
      "https://external-preview.redd.it/EnVl-KRXJhzajdMyfsXAkrv1stq3mrQc_9I6ZOb7sv0.jpg?auto=webp&s=38dd41d728e92bd3230c9fe4922648f969323848"
    ],
    "content": ""
  },
  {
    "title": "Urgent!! Mother is diagnosed with cancer.",
    "url": "https://www.reddit.com/r/india/comments/1k1yyhq/urgent_mother_is_diagnosed_with_cancer/",
    "created_utc": 1744960491.0,
    "subreddit": "india",
    "media": [],
    "content": "I'm so sorry for disturbing you guys, I'm Aarushi, 18 years old. My mother (44) is diagnosed with cancer . She has dual cancer, (Lungs and ovarian) there may be more but the biopsy is not done yet. They have found tumour in my mother's lungs which needs to be done ASAP, it's getting close to her heart that's why she can't breathe right now.\n\nMy mother is very serious rn, she is having chest pain, she can't speak and hardly breathe, and can't walk properly. Father is alcoholic and abusive, didn't even ask what she is diagnosed with, he doesn't care about us and ignore us. My mother is the one who raised us from the very start, by doing 10 hours petrol pump job where she used to stand all day long since they didn't allow the workers to sit. I can't manage to lose her since she never saw Happy days from her childhood and I don't want her to die before seeing those days.\n\nWe took her to GTB and Lok nayak in emergency but they denied taking her into emergency. Safdarjung didn't pay enough attention to her in emergency, they just injected some pain relief liquid that didn't even help at all. AIIMS, RGCI, TATA memorial might be the only option who could perform the surgery, but the surgery needs to be done asap. RGCI is a private hospital might take a lot of cost, and TATA memorial is free but we are from Delhi and the accomodations will be too high for us to bear. I tried making ayushman card but it not available for delhi residents. We don't have BPL and Ration card. AIIMS will take a lot of time due to very high waiting line. If any of you know some organisations or anyone who is in touch with someone from AIIMS, please help. If you could help us in anything, we would be very grateful to you till death. \nThankyou \nEdit: My username is partypooper _06, I have tweeted this on twitter, please get me reach there."
  },
  {
    "title": "Assam leads in social equality while across India show decade-wise reduction in inequality.",
    "url": "https://www.moneycontrol.com/news/business/economy/kerala-more-unequal-assam-most-equal-social-inequality-in-india-has-declined-over-a-decade-mc-analysis-12997292.html#goog_rewarded",
    "created_utc": 1744958791.0,
    "subreddit": "india",
    "media": [
      "https://external-preview.redd.it/g-S2RPNJekw_eh-lsDiuUNxBzJt2S7FKkBoh5bGL3U8.jpg?auto=webp&s=c0d6a203e1baba18b562fa8ddd25506f1450aa03"
    ],
    "content": "Gujarat and Kerala tops the states with most social inequality as per this report"
  },
  {
    "title": "Manuscripts of Bhagavad Gita, Natyashastra inscribed on UNESCO's Memory of World Register",
    "url": "https://www.ptinews.com/story/national/Manuscripts-of-Bhagavad-Gita--Natyashastra-inscribed-on-UNESCO-s-Memory-of-World-Register/2475168",
    "created_utc": 1744957555.0,
    "subreddit": "india",
    "media": [],
    "content": ""
  },
  {
    "title": "'Focus on protecting rights of own minorities': India slams Bangladesh's remark on Murshidabad violence | India News - The Times of India",
    "url": "https://timesofindia.indiatimes.com/india/focus-on-protecting-rights-of-own-minorities-india-slams-bangladeshs-remark-on-murshidabad-violence/articleshow/120400447.cms",
    "created_utc": 1744956779.0,
    "subreddit": "india",
    "media": [
      "https://external-preview.redd.it/e6Cop5fhhOA32h5l3vS938J_woHp170AEDLuDX2Ct0g.jpg?auto=webp&s=3d8c9c9acd63bf3be65b82ca41a86a97a8ed7738"
    ],
    "content": ""
  },
  {
    "title": "The rise and wobble of India's EV pioneer Ola",
    "url": "https://www.bbc.com/news/articles/c15vgegl7pjo",
    "created_utc": 1744955301.0,
    "subreddit": "india",
    "media": [
      "https://external-preview.redd.it/46XerOfZ4D8BsaukMNRjerSg2sJDMLPsYHgmH7gUUJg.jpg?auto=webp&s=11177035fe5627ff04f9b835a51f5459e4339036"
    ],
    "content": ""
  },
  {
    "title": "Need urgent legal help for a couple separated by family and police - Chennai",
    "url": "https://www.reddit.com/r/india/comments/1k1x153/need_urgent_legal_help_for_a_couple_separated_by/",
    "created_utc": 1744952723.0,
    "subreddit": "india",
    "media": [],
    "content": "Yesterday, I was traveling by bus from Chennai when I met a guy who seemed visibly nervous. He had a small piece of paper with some phone numbers and was asking fellow passengers for their phones to make a call. After a while, he asked to borrow my phone twice. I didn’t think much of it and was happy to help.\n\nLater, when we reached a stop, he turned to me and said, “Bro, I’m in a big problem.” He then asked if I’d join him for a cup of tea. That’s when he opened up and shared his story with me.\n\nHe recently got married—just three months ago—to his girlfriend. Both are 27 years old and from different castes. His family opposed the marriage, and her family, especially her father (who is quite wealthy), wanted her to marry a rich doctor. She is a physiotherapist, and he works in IT.\n\nThey were living in Walajah, away from Chennai, until recently. Her father managed to use his influence—possibly by bribing police—and sent two policemen to their place, saying they just needed to visit the Chennai police station to sign some documents. Since they are adults and married with consent, they didn’t expect anything serious.\n\nBut once they reached the police station, they were separated. The guy was humiliated, his phone, wallet, and photos were taken, and he was threatened to return to his hometown. None of his family or friends are supporting him. His wife was taken away by her family, despite crying and protesting. (He also mentioned she is pregnant, but her family doesn’t know yet.)\n\nNow, he’s completely hopeless. He has little to no money. The police have asked him to come again to Chennai with all the documents related to their marriage and also to resolve some minor issue involving his ex-girlfriend (he claims it’s nothing serious, just something the police dug up).\n\nHe fears that if his wife stays at her parents’ house for two months, they might forcefully marry her off to someone else or brainwash her.\n\nHe wants to hire a good lawyer to help them reunite, but he has no idea how to go about it.\n\nCan someone please help or guide me on what can be done legally so that:\n\n1. They can meet or talk again.\n2. She is not forcibly married off.\n3. They are protected from harassment by police or her family.\n4. He can take legal action to live with his wife peacefully.\nAny help or legal advice would be deeply appreciated."
  },
  {
    "title": "JNU sacks professor over sexual misconduct complaint by Japanese Embassy official",
    "url": "https://indianexpress.com/article/education/jnu-professor-accused-of-molesting-japanese-embassy-official-terminated-9949881/",
    "created_utc": 1744951347.0,
    "subreddit": "india",
    "media": [
      "https://external-preview.redd.it/Zfg25yFopzoq8cQ5fQi9xn_51BIKzKVMORr0trEaduo.jpg?auto=webp&s=ee7583d4de352e1d3f28dd376cec6cb570449b54"
    ],
    "content": ""
  },
  {
    "title": "Is IPL 2025 being scripted for betting addicts",
    "url": "https://www.reddit.com/r/india/comments/1k1syf0/is_ipl_2025_being_scripted_for_betting_addicts/",
    "created_utc": 1744938944.0,
    "subreddit": "india",
    "media": [],
    "content": "Is IPL 2025 being scripted for betting addicts!?!?\n\nHear me out—this isn’t just another conspiracy. It’s a pattern that’s becoming hard to ignore.\n\nThis year’s IPL has been chaotic:\n\nTeams defending scores as low as 111.\n\nMomentum swinging every few overs.\n\nStar players underperforming and then suddenly clutching up.\n\nOn the surface, it's peak entertainment. But zoom out, and you start seeing something deeper—a system that thrives on unpredictability.\n\nThe Real MVPs: Betting & Fantasy Apps\nApps like Dream11, My11Circle, and others have been aggressively promoted—through ads, players, influencers, even inside JioCinema. They’re framed as \"skill-based\" games, but let’s be honest—they function like betting platforms.\n\nWhen a match flips:\n\nOdds swing wildly.\n\nPeople switch bets mid-match.\n\nVolume goes up, and platforms rake in more cash.\n\nIt’s not about the cricket anymore. It’s about who can milk the chaos best.\n\nThe Word-of-Mouth Hype Machine\nWhat really fuels the system is mouth publicity. Everyone knows someone who says:\n\n“Bro, if I had just bet ₹1 on Punjab yesterday, I’d have gotten ₹1,000.”\n\nThis kind of talk spreads like wildfire. It triggers FOMO, greed, and gets more people on the apps. The platforms don’t even need to advertise anymore—the users do it for them.\n\nAnd the Government? They're Not Losing Either.\nEvery transaction on these apps:\n\nPays GST or platform fees.\n\nApplies TDS on winnings.\n\nGenerates digital payment data and tax revenue.\n\nSo technically, the government isn’t against it—it’s benefiting quietly while the apps grow bigger every season.\n\nSo What’s Really Happening?\nHere’s the full cycle:\n\nIPL delivers unpredictable matches that feel scripted for drama.\n\nFantasy and betting apps capitalize on emotional engagement.\n\nSocial media and peer hype pull more people in.\n\nEveryone from BCCI to the government profits.\n\nThe only ones losing are the majority of fans who keep betting, thinking they’re the next genius to beat the odds.\n\nEdit :- My rage bait worked...the amount of people that got rattled by this post is hilarious...they're really defending cricket as if its actually a religion\nJoke's on all of you emotional fools"
  }
]
